[
  {
    "Organization": "Name of Organization",
    "Description": "Statement of Purpose",
    "Type": "Type",
    "Main Person": "Main Contact Person",
    "Contact": "Email"
  },
  {
    "Organization": "Accounting Club",
    "Description": "The purpose of this organization shall be: A. To provide members with opportunities for academic, personal, and professional  development so they may contribute effectively and ethically to society and their  organizations B. To serve the community and develop conscientious members of the community through  participation in civic activities C. To build unity within the club while establishing friendships and networks that extend beyond the college career D. To educate members about the opportunity provided by all sectors of the accounting industry. E. To aspire continuous improvement in all activities to ensure that members perform  effectively in today’s business environment.",
    "Type": "Academic/Professional",
    "Main Person": "Britney Pham",
    "Contact": "phambrit@hawaii.edu"
  },
  {
    "Organization": "Addiction Medicine and Harm Reduction Interest Group",
    "Description": "The purpose of this organization is to increase student understanding of harm reduction principles and practices in the context of addiction medicine and public health, with a particular focus on Hawaii-specific challenges and resources. A vital aspect of our aim is to include Indigenous and culturally-diverse approaches to the above-listed topics, in addition to a more Western-medicine and current standard of care lens. This group was founded in response to the ongoing and alarming national trends of opioid related morbidity and mortality, as well as the well-documented history and ongoing challenges relating to substance use in Hawai’i. \n",
    "Type": "Academic/Professional",
    "Main Person": "Jewel Ito",
    "Contact": "jewelito@hawaii.edu"
  },
  {
    "Organization": "Advocates for Public Interest Law",
    "Description": "The purpose of the organization is to support and promote the commitment of the students, alumni of the William S. Richardson School of Law, and the legal community to serve the public interest and to encourage the practice of public interest law. The purpose of the organization shall be accomplished by educating students and the legal community about opportunities in public interest law and providing monetary grants to students and alumni to further justice by serving underrepresented persons addressing issues that affect the public interest.",
    "Type": "Academic/Professional",
    "Main Person": "Sumin Kim",
    "Contact": "sumink3@hawaii.edu"
  },
  {
    "Organization": "Aikido at UHM",
    "Description": "To practice Aikido",
    "Type": "Leisure/Recreational",
    "Main Person": "Tim Halliday",
    "Contact": "halliday@hawaii.edu"
  },
  {
    "Organization": "Alpha Gamma Delta Delta Sigma",
    "Description": "The purpose of Alpha Gamma Delta Delta Sigma is to offer women the opportunity to have sisterly connections with other University of Hawaii students whom value being loving, leading, and lasting. We have weekly meetings to connect with each other and develop ourselves professionally. We live by the Alpha Gamma Delta Purpose: \n\"To gain understanding that wisdom may be vouchsafed to me. To develop and prize health and vigor of body.\nTo cultivate acquaintance with many whom I meet. To cherish friendships with but a chosen few and to study the perfecting of those friendships.\nTo welcome the opportunity of contributing to the world's work in the community where I am placed because of the joy of service thereby bestowed and the talent of leadership multiplied.To honor my home, my country, my religious faith.To hold truth inviolable, sincerity essential, kindness invaluable.\nTo covet beauty in environment, manner, word and thought.To possess high ideals and to attain somewhat unto them.\nThis shall be my purpose that those who know me may esteem Alpha Gamma Delta for her attainments, revere her for her purposes and love her for her Womanhood.\" We aim to better the campus, local, and global community through service, philanthropic efforts, and extending kindness to all we come across. All students of Alpha Gamma Delta are current students at University of Hawaii at Manoa and are provided assistance in achieving great academic success which heightens our member's experience.",
    "Type": "Fraternity/Sorority",
    "Main Person": "Gabriela Robles",
    "Contact": "grobles@hawaii.edu"
  },
  {
    "Organization": "Alpha Omega Hawaii",
    "Description": "A.The primary function of Alpha Omega Hawaii will be to provide students with the\nopportunity for spiritual growth by interacting with other students who are\nChristians at UH\nB. To encourage academic excellence\nC. Alpha Omega Hawaii aims to encourage members to uphold the standards held\nand established by the University policies.",
    "Type": "Religious/Spiritual",
    "Main Person": "Jennifer Moya",
    "Contact": "jdmoya@hawaii.edu"
  },
  {
    "Organization": "American Institute for Aeronautics and Astronautics Student Branch at the University of Hawai'i at Manoa",
    "Description": "Establish a community for aerospace-related student projects and programs at the UHM and further the purposes and programs of AIAA.",
    "Type": "Academic/Professional",
    "Main Person": "Kenoi Salvador",
    "Contact": "kenoisal@hawaii.edu"
  },
  {
    "Organization": "American Library Association Student Chapter (ALAsc)",
    "Description": "The American Library Association Student Chapter at the University of Hawai‘i at Mānoa, Library and Information Science Program, exists to foster professional engagement, leadership, and community among students preparing for careers in librarianship and information science. The organization encourages active participation in the American Library Association, acquaints members with its goals, objectives, and resources, and provides official representation to ALA and related organizations. Through networking, leadership development, and involvement in professional activities beyond the classroom, the chapter aims to build skills, relationships, and awareness that empower students to make a creative and lasting impact on the profession. By serving as a local forum for the exchange of ideas, trends, and opportunities, the chapter connects students with national and global issues in the field while promoting collaboration and professional growth.",
    "Type": "Academic/Professional",
    "Main Person": "Camille Dahmen",
    "Contact": "cdahmen@hawaii.edu"
  },
  {
    "Organization": "American Marketing Association",
    "Description": "The mission of the American Marketing Association centers on creating an inclusive and dynamic community where members can deepen their understanding of the ever-evolving marketing landscape and confidently transition into the professional world.\n\nWe welcome students from all academic disciplines who share a passion for marketing or seek to expand their knowledge and skills. Through thoughtfully curated programs and events, we strive to provide unparalleled networking opportunities, enhance professional development, and promote a strong commitment to ethical practices within our growing membership.",
    "Type": "Academic/Professional",
    "Main Person": "Michelle Tanabe",
    "Contact": "rmtanabe@hawaii.edu"
  },
  {
    "Organization": "American Society of Civil Engineers",
    "Description": "The American Society of Civil Engineers (ASCE) student chapter at the University of Hawaii at Manoa is a proud organization geared towards promoting the civil engineering profession and providing a better understanding of the field outside of the classroom. The mission of the University of Hawai'i at Manoa ASCE student chapter is to expand the knowledge of aspiring civil engineers through networking, monthly meetings, socials, fundraisers and community service. In addition, it is our goal to give our members the opportunity to participate, as well as compete, in the PSWS for a once-in-a-lifetime engineering experience they will never forget.",
    "Type": "Academic/Professional",
    "Main Person": "Amier Ishaque",
    "Contact": "aishaque@hawaii.edu"
  },
  {
    "Organization": "Animal Science Club at UH Manoa",
    "Description": "The Animal Science Club at the University of Hawaii at Manoa is committed to students who share an interest and passion for animals and livestock production systems. The club accomplishes its mission by organizing events that emphasize education and hands-on experience. The club also participates in community service events.",
    "Type": "Academic/Professional",
    "Main Person": "Abigail Ana",
    "Contact": "aheana@hawaii.edu"
  },
  {
    "Organization": "American Society of Heating, Refrigerating and Air-Conditioning Engineers",
    "Description": "The purpose of this organization is to provide opportunities to mechanical engineering students interested in pursuing a career in HVAC. ASHRAE promotes professional development through informative and networking events.",
    "Type": "Academic/Professional",
    "Main Person": "Micah Shibuya",
    "Contact": "shibuya4@hawaii.edu"
  },
  {
    "Organization": "Associated Students of the John A. Burns School of Medicine",
    "Description": "The purpose of ASJABSOM and the JABSOM Classes is to serve as the official body representing the medical students of JABSOM. To that end, purposes include, but are not limited to advocating on behalf of the medical students of JABSOM, promoting the welfare of JABSOM and its students, and fostering student morale.",
    "Type": "Academic/Professional",
    "Main Person": "Kai Hirayama",
    "Contact": "kaihira@hawaii.edu"
  },
  {
    "Organization": "Association for Educational Communications and Technology - Hawaii (AECT-HI)",
    "Description": "The AECT-HI Chapter is organized to provide a campus-based focal point for individuals interested in using technology in training and education in association with the University of Hawaii at Manoa Department of Learning Design and Technology (LTEC). The purpose of the Chapter is to provide professional development activities, leadership opportunities, and social interaction for its Members. The mission of AECT-HI is to build a network among ETEC students, faculty, and alumni. Further, AECT-HI aims to foster interaction and partnerships with AECT Chapters at other universities and the global AECT community.",
    "Type": "Academic/Professional",
    "Main Person": "Audrey Villanueva",
    "Contact": "audreyv@hawaii.edu"
  },
  {
    "Organization": "Aquaholics Scuba Club",
    "Description": "Create a community of scuba divers and lovers of the Ocean. Give students more opportunities to dive and help raise awareness of oceanic threats and conservation through volunteer work, education, and fun. ",
    "Type": "Leisure/Recreational",
    "Main Person": "Megan Mcferson",
    "Contact": "mcferson@hawaii.edu"
  },
  {
    "Organization": "Ballroom Dance Club @UH",
    "Description": "Promote social and competitive ballroom dance within the UH community",
    "Type": "Leisure/Recreational",
    "Main Person": "Ravi Narayan ",
    "Contact": "rnarayan@hawaii.edu"
  },
  {
    "Organization": "Baptist Collegiate Ministries O'ahu",
    "Description": "BCM O‘AHU exists to engage college students with the Gospel, develop disciples of Jesus Christ, and mobilize servant leaders for the Church in order to reach the world. We strive to partner with local churches to advance God’s kingdom on every college campus in Hawai‘i and the regions inside of Hawai‘i-Pacific Baptist Convention.",
    "Type": "Religious/Spiritual",
    "Main Person": "Tomas Ochoa",
    "Contact": "tochoa7@hawaii.edu"
  },
  {
    "Organization": "Belly Dance RaQs",
    "Description": "Belly Dance RaQs was created to give students within the University of Hawai’i system\nan opportunity to learn about belly dance in a fun and safe environment. Belly dance is\nnot only a great way to relieve stress, but provides a light to medium impact workout.\nThus, the organization aims to improve student health and fitness as well. The belly\ndance community is non-judgmental, and open to all students and members of the UH\ncommunity that might share an interest in learning a new dance form. The organization\nwill create a strong sense of community among members, valuing and encouraging\ndancers of all experience levels and backgrounds.",
    "Type": "Sports/Leisure",
    "Main Person": "India Ching",
    "Contact": "ikcc@hawaii.edu"
  },
  {
    "Organization": "Beta Alpha Psi - Delta Theta Chapter",
    "Description": "Our purpose is to develop our members into becoming driven and successful students and accounting professionals by providing them with unique resources and opportunities during their time in college",
    "Type": "Academic/Professional",
    "Main Person": "Kaitlyn Hasegawa",
    "Contact": "kmh22@hawaii.edu"
  },
  {
    "Organization": "Beta Beta Gamma Sorority",
    "Description": "Fostering a supportive and inclusive environment that promotes personal growth, leadership development, academic excellence, and service to the community. Creating a welcoming environment where members can cultivate lifelong friendships, celebrate diversity, and make meaningful contributions to society. Empowering our members to become confident, compassionate, and engaged members of the sorority and beyond. ",
    "Type": "Fraternity/Sorority",
    "Main Person": "Dakota Bow",
    "Contact": "dbow@hawaii.edu"
  },
  {
    "Organization": "Black Law Students Association",
    "Description": "The mission of the Black Law Students Association (BLSA) at the William S. Richardson School of Law is to promote, inspire, and empower Black students and Allies to achieve excellence in academics, career progression, personal development, and community engagement. We are committed to exemplifying integrity, leadership, and character, striving to transform both the internal and external communities of Hawai‘i. Through the development of programs and initiatives, we seek to address injustices, foster inclusivity, and uplift Black professionals while educating the broader community on the invaluable contributions of Black individuals in the field of law.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Hannah Hawley",
    "Contact": "hehawley@hawaii.edu"
  },
  {
    "Organization": "Black Student Association",
    "Description": "The Black Student Association (BSA) was established in 2016 in response to the lack of representation for Black students, faculty, and staff at the University of Hawaiʻi at Mānoa (UHM). \n\nThe goals of the student-led organization are to: increase awareness and understanding of African American issues, history and culture, promote unity among African American students, engage and connect with topics surrounding Blackness in Hawaiʻi, and promote and preserve Black studies at the University of Hawaiʻi at Mānoa.\n\nThe Black Student’s Association and all members hereafter will adhere to the rules and regulations set forth by this Constitution of The University of Hawaii Black Student Association.\n\nAll members of the  University of Hawaii Black Student Association are willing to abide by established University of Hawaii policies.\n",
    "Type": "Ethnic/Cultural",
    "Main Person": "Niya McAdoo",
    "Contact": "nmcadoo@hawaii.edu"
  },
  {
    "Organization": "Business Executive Society of Tomorrow",
    "Description": "The Business Executive Society of Tomorrow is a general business club at the University of Hawaii at Manoa’s Shidler College of Business. Founded by students in 1998, BEST has a proud history of maintaining and perpetuating excellence in its members. Through the years, we have developed a culture of diligence and dedication to personal and professional growth. Through a combination of tours, workshops, networking events, alumni events, community services, and socials, we strive to mold our members into well-rounded individuals. We pride ourselves in producing the business leaders of tomorrow, and we provide our members with ample opportunities to continually advance toward that goal.",
    "Type": "Honorary Society",
    "Main Person": "Alan Ichinose",
    "Contact": "ari2022@hawaii.edu\n"
  },
  {
    "Organization": "Business of Medicine Interest Group",
    "Description": "The Business of Medicine Interest Group at JABSOM aims to educate medical students on the economic and organizational aspects of healthcare to promote success and competency in Hawaii's future physicians.",
    "Type": "Academic/Professional",
    "Main Person": "Chloe McCreery",
    "Contact": "chloemcc@hawaii.edu"
  },
  {
    "Organization": "Cafe Hoppers",
    "Description": "Our club is formed for students to relax, chill during our busy school semesters.\n\nTargeted for students to socialize and make new connections through weekly coffee and cafe events, including occasional coffee making lessons and themed pop-up events. \n\nWe also explore and engage with small businesses owners within our community.",
    "Type": "Leisure/Recreational",
    "Main Person": "Jade Zhang",
    "Contact": "zhangj2@hawaii.edu"
  },
  {
    "Organization": "Campus Chinese Christian Ministry",
    "Description": "The purpose is to offer a welcoming space for students and scholars at the University of Hawaii to ﬁnd support, companionship, and spiritual fulﬁllment. Our focus is not only on academic and professional excellence but also on understanding the deeper meaning of life through family, kinship, love, and faith. Most of our events are conducted in Mandarin Chinese, though everyone is welcome regardless of language background.",
    "Type": "Religous/Spritual",
    "Main Person": "Sen Zhao",
    "Contact": "zhaos@hawaii.edu"
  },
  {
    "Organization": "CARP Hawai'i",
    "Description": "CARPs’ purpose is to help every student practice life principles essential for personal fulfillment and leadership skills with which to make a positive difference in society. To inspire and empower students by fostering beliefs in God and principles of life, and its application in furthering the cause of world unity and peace.",
    "Type": "Religious/Spiritual",
    "Main Person": "Rena Saito",
    "Contact": "saito22@hawaii.edu"
  },
  {
    "Organization": "Chi Alpha Hawaii",
    "Description": "We disciple university students to fulfill their purpose in God's global plan. Our mission is to reconcile students to Christ, equipping them through Spirit-Filled communities of prayer, worship, fellowship, discipleship, and mission to transform the university, the marketplace and the world.",
    "Type": "Religous/Spritual",
    "Main Person": "Destiny Yasuhara",
    "Contact": "destinyy@hawaii.edu"
  },
  {
    "Organization": "Chi Epsilon",
    "Description": "Chi Epsilon is the Hawaii chapter of the larger national Chi Epsilon Civil Engineering Honor Society. It was organized to recognize the characteristics of the individual civil engineer deemed to be fundamental to the successful pursuit of an engineering career, and to aid in the development of those characteristics in the civil engineering student.  Membership into Chi Epsilon is by invitation only.  Our membership is largely comprised of undergraduates, but membership is open to graduate students as well.  Our program emphasizes the four pillars of Chi Epsilon: Scholarship, Practicability, Sociability, and Character. We do community services activities, professional development workshops in collaboration with industry, and socials.",
    "Type": "Honorary Society",
    "Main Person": "Ashlyn Uehara",
    "Contact": "ashlyneu@hawaii.edu"
  },
  {
    "Organization": "Chinese Club",
    "Description": "The Chinese Club seeks to create a community where students of all majors and backgrounds can learn, appreciate, and celebrate various aspects of Chinese culture and language. The Chinese Club aims to create an inclusive environment for students to immerse themselves in Chinese culture and build meaningful connections through engaging events, language workshops, and collaborations with other cultural and community organizations. We aspire to foster deeper global perspectives and mutual respect through continuous learning, collaborations, and appreciation of diversity.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Katherine Kaw",
    "Contact": "kkaw@hawaii.edu"
  },
  {
    "Organization": "Church in Honolulu",
    "Description": "The purpose of this organization is to bring together followers of Christ at UH Mānoa to grow in faith, fellowship, and service. We seek to encourage spiritual growth through prayer, study, and worship, while fostering unity as one body in Christ and sharing His love within the campus and greater Honolulu community",
    "Type": "Religous/Spritual",
    "Main Person": "Xinghui Li",
    "Contact": "Xli7@hawaii.edu"
  },
  {
    "Organization": "Class of 2026 at JABSOM",
    "Description": "1. Serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs).\n2. Consult, deliberate, and make decisions for student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from here on).\n3. Fundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (i.e., graduation and senior lūʻau).\nThe organization was founded with the intention to allow students the opportunity to, when elected by the student body, represent and serve the class. The group will abide by all established University of Hawaii (and JABSOM) rules, regulations, and policies, as well as all local, state, and federal laws.",
    "Type": "Academic/Professional",
    "Main Person": "D-Dré Wright",
    "Contact": "ddre@hawaii.edu"
  },
  {
    "Organization": "Class of 2027 at JABSOM",
    "Description": "The purpose of this organization is to gather a group of students to: (1) serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs); (2) consult, deliberate, and make decisions for student-led events held at JABSOM; and (3) fundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (i.e., graduation and senior lūʻau). The organization was founded with the intention to allow students the opportunity to, when elected by the student body, represent and serve the class. The group will abide by all established University of Hawaii (and JABSOM) rules, regulations, and policies, as well as all local, state, and federal laws.",
    "Type": "Academic/Professional",
    "Main Person": "Jenny Nguyen",
    "Contact": "nj23@hawaii.edu"
  },
  {
    "Organization": "Class of 2028 at JABSOM",
    "Description": "Serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs).\nConsult, deliberate, and make decisions for student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from here on).\nFundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (i.e., graduation and senior lūʻau).",
    "Type": "Academic/Professional",
    "Main Person": "Kai Hirayama",
    "Contact": "kaihira@hawaii.edu"
  },
  {
    "Organization": "Club Management Association of America",
    "Description": "The objectives of the Association are to promote relationships between club management professionals and other similar professions; to encourage the education and advancement of members; and to provide the resources needed for efficient and successful club operations. Under the covenants of professionalism, education, leadership, and community, CMAA continues to extend its reach as the leader in the club management practice.",
    "Type": "Academic/Professional",
    "Main Person": "Taylor Morikawa",
    "Contact": "tkmorika@hawaii.edu"
  },
  {
    "Organization": "C.O.P. Alakaʻina Club",
    "Description": "Our purpose is to promote college success and post-secondary opportunities for our College Opportunities Program (COP) students. COP Alaka'ina serves our COP freshmen and alumni throughout the academic year by providing guidance, information, and workshops about academic and college life at UH Manoa. Our areas of focus are the following: professional development, community service, socials, and fundraising. ",
    "Type": "Academic/Professional",
    "Main Person": "Kawaianuhea Moss",
    "Contact": "kmoss@hawaii.edu"
  },
  {
    "Organization": "CRU",
    "Description": "A caring community that seeks to love God and love others. The purpose of the movement, as articulated in the Charter, is to build movements of people who are transformed by Jesus Christ. The student-led movement seeks to introduce students to Jesus Christ, help them to grow in their faith, encourage them to live life passionately under the lordship of Christ, and inspire commitment to advancing the purposes of God in the world. ",
    "Type": "Religous/Spritual",
    "Main Person": "Sara Ireland",
    "Contact": "sni812@hawaii.edu"
  },
  {
    "Organization": "Delta Sigma Pi: Rho Chi",
    "Description": "Delta Sigma Pi is a professional fraternity organized to foster the study of business in universities; to encourage scholarship, social activity and the association of students for their mutual advancement by research and practice; to promote closer affiliation between the commercial world and students of commerce, and to further a higher standard of commercial ethics and culture and the civic and commercial welfare of the community.",
    "Type": "Honorary Society",
    "Main Person": "Jacie Sakaino",
    "Contact": "jacies8@hawaii.edu"
  },
  {
    "Organization": "Domestic Violence Awareness Committee",
    "Description": "Spread awareness about domestic violence and its impact on the health and wellness of our community. In addition, equip our members with knowledge to be able to recognize warning signs that may identify survivors of domestic violence by educating the members of our community\n",
    "Type": "Service",
    "Main Person": "Michael Ajimura",
    "Contact": "ajimuram@hawaii.edu"
  },
  {
    "Organization": "Dungeons and Tables at Manoa",
    "Description": "This club provides a social and fun extracurricular activity where UHM students may participate in old school table top role playing games. (Ex. Dungeons and Dragons, warhammer, fallout) Dungeons and Tables at Manoa also provides the experience of meeting new students with similar interests from all backgrounds.",
    "Type": "Leisure/Recreational",
    "Main Person": "Jason Solano Jr",
    "Contact": "solanoj@hawaii.edu"
  },
  {
    "Organization": "East-West Toastmasters",
    "Description": "To provide a mutually supportive and positive learning environment in which every member has the opportunity to develop communication and leadership skills, which in turn foster self-confidence and  personal growth",
    "Type": "Academic/Professional",
    "Main Person": "Fernando Santiago-Mandujano",
    "Contact": "santiago@hawaii.edu"
  },
  {
    "Organization": "Emergency Medicine Interest Group",
    "Description": "It is the purpose of EMIG to provide a forum for medical students to foster their interest in the Emergency Medicine specialty, to serve as the base for hands-on activities and research opportunities pertaining to EMIG, and to provide guidance for students interested in applying for Emergency Medicine residency programs.",
    "Type": "Academic/Professional",
    "Main Person": "Jackson Underhill",
    "Contact": "junderhi@hawaii.edu"
  },
  {
    "Organization": "Engineers' Council at the University of Hawai'i",
    "Description": "The purpose of the Engineering Council of the University of Hawaii is to \n- represent the engineering student body;\n- support engineering organizations in reaching their full potential; \n- and promote a diverse community through successful collaboration between students, faculty, organizations, and the college of engineering.\n- to help coordinate the activities of organizations and groups within the Engineering College; \n- to gather and formulate student opinion on policies of the College of Engineering affecting the student body; \n- to provide a liaison between the student body and the administration; \n- to undertake service projects for the general good of the College of Engineering; \n- and to stimulate interest in the student activities of the College of Engineering.\n- Build upon a widely supported effort to improve interdisciplinary communication within the College of Engineering.\n- Facilitate student opportunities in industry, academia and the greater engineering community.\n- Provide a volunteer support network between our student organizations.\n- Enhance the quality and quantity of opportunities students and advisers facilitate in support of our professional and technical development.\n- Increase participation in our student engineering organizations by providing a resource to pre-engineering students and undergraduates.\n- Build upon our community as engineering students and future alumni of the College of Engineering.",
    "Type": "Academic/Professional",
    "Main Person": "Tiffany Rose, Mendoza",
    "Contact": "trcmendo@hawaii.edu"
  },
  {
    "Organization": "English Majors Association",
    "Description": "The purpose of this organization shall be to promote interaction amongst the students and faculty within the English Department, create an active literary community, and increase participation in both on-campus and off-campus English related events and activities. The purpose will also be to support the Ānuenue Review, an undergraduate literary journal from the University of Hawaiʻi at Mānoa, and any other related English related organizations for that matter. The English Majors Association will extend its membership opportunity once per semester to the entirety of the English major and minor in the hopes of increasing interconnectivity amongst students. With passion and dedication put forth towards the English discipline, the EMA will actively seek substantial opportunities for student involvement and recognition amongst peers and faculty. Increased participation and influence in the English department will be available to members of the EMA, as well as, an open-minded environment which values individual intellect, opinion, and creativity. ",
    "Type": "Academic/Professional",
    "Main Person": "Samantha Avila Gomez",
    "Contact": "sag9@hawaii.edu"
  },
  {
    "Organization": "Eta Sigma Delta",
    "Description": "Eta Sigma Delta is an international honor society that recognizes the scholastic and professional achievements of students and alumni from institutions granting diplomas, associate and baccalaureate degrees, or their equivalents, in the field of hospitality, tourism, and culinary arts.",
    "Type": "Honorary Society",
    "Main Person": "Kana Wang",
    "Contact": "kanaw@hawaii.edu"
  },
  {
    "Organization": "Every Nation Honolulu",
    "Description": "We aim to invite students and young adults into a Christ-centered community that spans over 80+ nations. ",
    "Type": "Religious/Spiritual",
    "Main Person": "Kaisho Collins",
    "Contact": "kaishoc@hawaii.edu"
  },
  {
    "Organization": "Family Medicine Interest Group",
    "Description": "The purpose of FMIG is to increase interest in Family Medicine and address Hawaii’s primary care deficit, provide professional development through networking opportunities with Family Medicine physicians, and increase community outreach to Hawaii’s underserved and vulnerable populations.",
    "Type": "Academic/Professional",
    "Main Person": "Lindney Acosta",
    "Contact": "lindneya@hawaii.edu"
  },
  {
    "Organization": "Federal Bar Association - Hawaiʻi Student Chapter",
    "Description": "The mission of the FBA Hawai‘i Student Chapter is to support the interests and needs of Richardson law students aspiring to Federal practice, both public and private, as well as to strengthen student interest and knowledge of the Federal legal system. The Hawaii Student Division, like other law school chapters, strives to advance the mission of the national FBA as set forth in Article III, Section 1, to “strengthen the federal legal system and administration of justice by serving the interests and the needs of the Federal practitioner, both public and private, the federal judiciary and the public they serve.” Law School Student Chapters also serve to advance the General Objectives of the FBA, as set forth in Article III, Section 3, including but not limited to:\n\nTo enhance the professional growth and development of members of the Federal legal profession and promote high standards of professional competence and ethical conduct, including through the provision of quality education programs. \nTo support the members of the Association including through promoting professional and social interaction, notifying and educating members as to developments in their respective fields of interest, encouraging member involvement in activities of the Association, and providing opportunities for members to assume leadership roles in the Association.",
    "Type": "Academic/Professional",
    "Main Person": "Kai Okazaki",
    "Contact": "kaio73@hawaii.edu"
  },
  {
    "Organization": "Filipino Law Students Association",
    "Description": "To foster a strong community in support of legal issues surrounding the Filipino community here at the William S. Richardson School of Law. We also want to forge strong relationships with active community leaders that support our cause.",
    "Type": "Academic/Professional",
    "Main Person": "Mindnay Nisa Gapet",
    "Contact": "mngapet@hawaii.edu"
  },
  {
    "Organization": "Financial Management Association",
    "Description": "The purpose of the Financial Management Association is to further the professional and personal development of Hawaiis next generation of finance professionals and leaders.",
    "Type": "Academic/Professional",
    "Main Person": "Chanel Higa ",
    "Contact": "chanelhi@hawaii.edu"
  },
  {
    "Organization": "Global Health Interest Group",
    "Description": "The purpose of this organization shall be to provide resources and support for students interested in global health initiatives. We will coordinate meetings and events to make global health more accessible to students. ",
    "Type": "Academic/Professional",
    "Main Person": "Chloe McCreery",
    "Contact": "chloemcc@hawaii.edu"
  },
  {
    "Organization": "Go Club at the University of Hawaii",
    "Description": "The Go Club at the University of Hawaii aims to promote the Game of Go. By providing a platform for players of all skill levels, the club encourages collaboration, friendly competition, and the exploration of Go’s rich history and techniques.",
    "Type": "Leisure/Recreational",
    "Main Person": "Chloe McCreery",
    "Contact": "chloemcc@hawaii.edu"
  },
  {
    "Organization": "Gold Humanism Honor Society",
    "Description": "The John A. Burns School of Medicine (JABSOM) endeavors to facilitate the growth of competent, compassionate, culturally sensitive, and socially responsible physicians. The strengthening of personal attributes such as integrity, compassion, altruism, respect, excellence, and empathy is essential to this process. JABSOM promotes these humanistic traits throughout the four year medical school curriculum. Humanistic values are also modeled by faculty and residents in clinical teaching experiences. The Arnold P. Gold Humanism Honors Society (GHHS) chapter at JABSOM is a natural extension to further establish a vision of exemplifying humanistic attributes. GHHS members serve as leaders and role models for the entire JABSOM student body.",
    "Type": "Academic/Professional",
    "Main Person": "D-Dré Wright",
    "Contact": "ddre@hawaii.edu"
  },
  {
    "Organization": "Graduate Student Sociological Association",
    "Description": "The GSSA provides a safe space for graduate students to present the ideas, interests, and concerns of the members of the student body and serves as a liaison between the students, faculty, and administration. The GSSA facilitates communication and involvement among students through scheduled meetings, coordination of social and educational activities, and dissemination of necessary information.  The GSSA is an organization that provides students with opportunities to promote Sociology within both the university and Hawaiʻi community at large through outreach, education, and fundraising. Another facet of the group is to provide support and guidance for incoming students and link students in the Sociology graduate program with other students and Sociology professionals locally, nationally, and internationally. ",
    "Type": "Academic/Professional",
    "Main Person": "Matthieu Kalua",
    "Contact": "mkalua4@hawaii.edu"
  },
  {
    "Organization": "Graduate Women in Science Hawaii",
    "Description": "Our mission is to support and honor the past, present, and future women scientists of Hawai‘i and the Pacific Region. \n\nWe aim to unite all scientific disciplines and diverse backgrounds in celebrating women, girls, non-binary and gender non-conforming folks in their personal and professional endeavors as scientists, individuals, and community members. To this end, we provide a collaborative network of inspired and practicing scientists, professional development to strengthen women’s contributions to science, and a community presence to nurture the leaders of tomorrow.",
    "Type": "Academic/Professional",
    "Main Person": "Linnea Wolniewicz",
    "Contact": "linneamw@hawaii.edu"
  },
  {
    "Organization": "Hawai'i Branch of the American Society of Microbiology Student Chapter",
    "Description": "The Society’s mission is to promote and advance the microbial sciences. ASM is a global\nscientific society whose goals are to shape the future of the microbial sciences, connect microbial sciences stakeholders worldwide, and ensure appropriate societal impact of the microbial sciences. ASM is committed to promoting and advancing the microbial sciences through the elevation, embodiment, and sustainability of inclusive diversity with equity, access, and accountability (IDEAA).",
    "Type": "Academic/Professional",
    "Main Person": "Brianna Correa",
    "Contact": "correabr@hawaii.edu"
  },
  {
    "Organization": "Hawaii Pickleball Club at The University of Hawaii at Manoa ",
    "Description": "The purpose of the Hawaiʻi Pickleball Club is to provide students with regular open play sessions where they can decompress from school, socialize, and build new connections through the sport of pickleball. Our club offers a fun and welcoming environment for all skill levels, giving students a chance to stay active, relieve stress, and form lasting friendships while enjoying the game.",
    "Type": "Sports/Leisure",
    "Main Person": "Conner Koga ",
    "Contact": "cmk26@hawaii.edu"
  },
  {
    "Organization": "Hawaii Powerlifting Club",
    "Description": "The mission of the organization is to support the University of Hawai'i community by providing an engaging, encouraging, and safe environment for members. The  purpose of forming the organization is to create a team that can represent the University at local,  state, and national competitions.",
    "Type": "Sports/Leisure",
    "Main Person": "Hunter Von Tungeln",
    "Contact": "hvt7@hawaii.edu"
  },
  {
    "Organization": "Hawaii Sigma Pi",
    "Description": "In order to establish a closer bond of fellowship which will result in mutual benefit to those men and women in the study and in the profession of mechanical engineering, who by their academic or practical achievements, manifest a real interest and marked ability in their chosen work, this constitution of the International Pi Tau Sigma Mechanical Engineering Honor Society was established.\n",
    "Type": "Honorary Society",
    "Main Person": "Matthew Fujioka",
    "Contact": "mt66@hawaii.edu"
  },
  {
    "Organization": "Hawaii Student Entrepreneurs Club",
    "Description": "Inspire and grow students’ entrepreneurial mindset. All of our members will learn how to start a business, meet established entrepreneurs, and learn about various entrepreneurial topics.",
    "Type": "Academic/Professional",
    "Main Person": "Jazmyne Faith Viloria",
    "Contact": "jazmynef@hawaii.edu"
  },
  {
    "Organization": "Hawaii Undergraduate Initiative",
    "Description": "HUI RIO strives to build a community and support system for current Hawai'i Undergraduate Initiative students, alumni, and friends by providing resources, academic services, social, and community activities needed to ensure that students continue to have a college going attitude.",
    "Type": "Academic/Professional",
    "Main Person": "Taryn Tyau",
    "Contact": "tarynlt@hawaii.edu"
  },
  {
    "Organization": "Hillel Hawai'i",
    "Description": "\"    Enrich the lives of Jewish students—both undergraduate and graduate—within the University of Hawaiʻi system and beyond, through intellectual, spiritual, cultural, and social engagement; \n\n    Foster an inclusive and pluralistic community supporting tzedek (social justice), tikkun olam (repairing the world), Jewish learning, support for Israel, and global Jewish peoplehood; \n\n    Provide meaningful leadership, advocacy, and community-building opportunities that enable students to explore and celebrate their Jewish identity while engaging with broader societal and communal goals. \"",
    "Type": "Religious/Spiritual",
    "Main Person": "Shai Michael Zaid",
    "Contact": "shaiz@hawaii.edu"
  },
  {
    "Organization": "HONU Scientists",
    "Description": "The purpose of this organization is to provide a supportive hui to promote opportunities for the development of nurse scientists among students and faculty at UHM and the larger nursing professional community. Specific activities and functions of the organization will include mentoring, professional networking, and other activities that promote nursing research. ",
    "Type": "Academic/Professional",
    "Main Person": "Samia Valeria Ozorio Dutra",
    "Contact": "samiaval@hawaii.edu"
  },
  {
    "Organization": "HOSA at UH Mānoa",
    "Description": "Establishing and reviving the HOSA - Future Health Professionals chapter at UH Mānoa. Providing pre-health related opportunities to members of the chapter, such as shadowing, volunteering, and skill-based workshops. Additionally coaching and assisting peers for competing in HOSA - FHP health competitions. Open to all majors and scholars who have an interest in health.",
    "Type": "Academic/Professional",
    "Main Person": "Joshua Bryn Ramo",
    "Contact": "jramo@hawaii.edu"
  },
  {
    "Organization": "Hui Dui",
    "Description": "All registered Library and Information Science (LIS) graduate students are part of Hui Dui, the student organization of LIS. Hui Dui represents students at LIS faculty and committee meetings, and collaborates with other student organizations to advocate for LIS students at local professional organizations. Hui Dui also sponsors community building events including but not limited to a New Student Orientation at the beginning of every semester and a Graduation Dinner at the end of every semester. ",
    "Type": "Academic/Professional",
    "Main Person": "Allyson Taylor",
    "Contact": "ajt6@hawaii.edu"
  },
  {
    "Organization": "Information Technology Management Association",
    "Description": "To foster among students a better understanding of the vital business role of\ninformation technology, the proper relationship of information technology to\nmanagement, and the necessity for a professional attitude among information\ntechnology professionals in their approach to an understanding and application of\nthe principles underlying the science of information technology.",
    "Type": "Academic/Professional",
    "Main Person": "Dylan Chen",
    "Contact": "dylanche@hawaii.edu"
  },
  {
    "Organization": "Inspire Church YA",
    "Description": "The purpose of Inspire Church YA is to provide a Christ-centered community where students can grow in their faith, build authentic relationships, and live out their calling as followers of Jesus. We exist to inspire, equip, and send young adults to impact their campus, families, and communities with the love of Christ.",
    "Type": "Religious/Spiritual",
    "Main Person": "Irie Gray",
    "Contact": "iriegray@hawaii.edu"
  },
  {
    "Organization": "Institute of Electrical and Electronics Engineers (IEEE)",
    "Description": "We aim to encourage students to engage with the electrical and computer engineering community at the University of Hawaii at Manoa. The IEEE Student Branch wants to promote students’ academic and professional success. We are open to all majors and do not require members to pay any fees or dues.",
    "Type": "Academic/Professional",
    "Main Person": "Stephanie Chu",
    "Contact": "shchu@hawaii.edu"
  },
  {
    "Organization": "Inter-Business Council",
    "Description": "We, the represented registered independent business organizations of the Shidler College of Business (SCB), Inter-Business Council (IBC) as it stands: in order to better serve and be responsive to the needs of the recognized undergraduate population; to serve as liaison between the SCB undergraduate student body, the SCB student organizations, the SCB administration, the faculty of the SCB, the Alumni Association, and the Hawai’i community.",
    "Type": "Academic/Professional",
    "Main Person": "Marisa Van Duyne",
    "Contact": "marisa22@hawaii.edu"
  },
  {
    "Organization": "International Business Organization",
    "Description": "The International Business Organization (IBO) champions global awareness and professional growth through professional development events, global analysis workshops, study abroad aid, and more. By aligning with the Shidler College of Business’s mission of International Excellence, IBO cultivates a community of global-minded professionals, equipping its members to thrive in the diverse landscape of international business. Membership is open to all majors, and we encourage all students interested in International Business to join.",
    "Type": "Academic/Professional",
    "Main Person": "Noah Kessler",
    "Contact": "kesslern@hawaii.edu"
  },
  {
    "Organization": "International Student Association (ISA)",
    "Description": "The purpose of the International Student Association (ISA) is:\nTo promote global friendship and understanding;\nTo support new and continuing students in their educational objectives;\nTo explore issues and places in Hawaii;\nTo develop leadership among students;\nTo have fun.",
    "Type": "Academic/Professional",
    "Main Person": "Joann Lin",
    "Contact": "joannlin@hawaii.edu"
  },
  {
    "Organization": "Intervarsity Christian Fellowship/USA",
    "Description": "Transformed by God's Aloha, together we bless the campus, the islands, and the nation.",
    "Type": "Religious/Spiritual",
    "Main Person": "Mark Brehm",
    "Contact": "mbrehm@hawaii.edu"
  },
  {
    "Organization": "JABSOM c/o 2029 Class Council",
    "Description": "Our purpose is to serve as a unified voice for the JABSOM Class of 2029, fostering a strong sense of community and ensuring our collective well-being throughout our medical school journey. As the Class Council, we do this by acting as the primary liaison between our classmates and JABSOM's administration, advocating for our academic, social, and wellness needs. We will be actively organizing and coordinating events—from collaborative study sessions and fundraising initiatives to celebratory gatherings like the senior lu'au—that enhance our shared experience and build lasting bonds. We are dedicated to creating an inclusive and supportive environment where every voice is heard and our class can thrive, both individually and together.",
    "Type": "Academic/Professional",
    "Main Person": "Caitlin Tanji",
    "Contact": "ctanji@hawaii.edu"
  },
  {
    "Organization": "Japanese Culture Club at UH Manoa",
    "Description": "To create a safe space for people to enjoy the Japanese culture and make new friends. ",
    "Type": "Ethnic/Cultural",
    "Main Person": "Leilah Eusebio",
    "Contact": "leilahve@hawaii.edu"
  },
  {
    "Organization": "Jehovah's Witnesses",
    "Description": "Event Title: Bible based discussions with free Bible based literature will be available to the public. Two two-wheeled carts will offer the literature. Each cart is approx. 3 feet wide by 5ft high. One cart will have literature printed in the English language and the other cart will have literature in multiple foreign languages. The carts will be approx. 10 feet apart. An attendant will be standing on each side of the carts to answer questions. No food or drinks, including alcohol will be served.",
    "Type": "Religious/Spiritual",
    "Main Person": "Roberta Baird",
    "Contact": "Bairdr@hawaii.edu"
  },
  {
    "Organization": "Judo Team/Club at University of Hawaii at Manoa",
    "Description": "- To provide opportunity to practice judo, a lifelong physical and mental education system. -To develop excellent moral character and promote the spirit of social entrepreneurship to serve community.\n- To offer leadership development opportunities to members through club and team organizational management and hosting community events. -To serve as a local community hub for young adult judo practitioners from Hawaii, USA, Japan, and other international countries to foster lifelong friendship. \n- To inspire and promote K-12 students to pursue higher education through our presence in the local judo community. \nThe Judo Team/Club does not offer lessons, membership, or mentorship to anyone under the age of 18",
    "Type": "Leisure/Recreational",
    "Main Person": "Dayven Hom",
    "Contact": "dhom23@hawaii.edu"
  },
  {
    "Organization": "K-pop Cardio Crew ",
    "Description": "The K-Pop Cardio Crew strives to promote fitness and spread appreciation for pop music of all languages. Our purpose is to create a supportive community for students who love K-Pop and dancing. We aim to expand knowledge of different cultures through exercise. The club’s mission is to make exercise fun and empower members with the confidence to express themselves. We value inclusivity, cultural awareness, and creativity.",
    "Type": "Leisure/Recreational",
    "Main Person": "Phoeberly Ungos",
    "Contact": "pungos@hawaii.edu"
  },
  {
    "Organization": "Ka Mea Kolo",
    "Description": "The University of Hawaiʻi Ka Mea Kolo Entomology Club strives to share our understanding and enthusiasm for the earth’s most diverse creatures especially those that have made Hawaiʻi their home. Although we often think of insects that don’t belong in Hawaiʻi like ants and roaches, we are actually home to thousands of endemic insects that arrived on the islands long before people did. ",
    "Type": "Academic/Professional",
    "Main Person": "Sarah Pennington",
    "Contact": "sarahkp@hawaii.edu"
  },
  {
    "Organization": "Kilohana at the University of Hawaii American Choral Directors Association Student Chapter ",
    "Description": "The purpose is to promote excellence in the field of choral music and to support and encourage the activities of the University of Hawaiʻi at Mānoa Music Department. Choral ensembles include the Concert Choir and Chamber Singers.\n\nThe purpose of this organization shall also promote and abide by the National Constitution of the American Choral Directors Association, and are stated as follows:\nTo foster and promote choral singing which will provide artistic and spirited experiences for the participants.\nTo foster and promote the finest types of choral music to make these experiences possible.\nTo foster and encourage rehearsal procedures conducive to attaining the highest level possible in musicianship and artistic performance.\nTo foster and promote the organization and development of choral groups of all types in schools, colleges, and churches.\nTo foster and promote the organization and development of choral societies in cities and communities.\nTo foster and promote the intelligent understanding of choral music as an important medium of artistic expression.\nTo foster and promote significant research in the field of choral music.\nTo foster and promote the composition of superior quality in both music and text for all choral combinations.\nTo cooperate with all organizations dedicated to the development of musical culture in America.\nTo disseminate professional news and information about choral music.",
    "Type": "Academic/Professional",
    "Main Person": "Alina Taniguchi",
    "Contact": "alinat@hawaii.edu"
  },
  {
    "Organization": "Kim's Tae kwon Do at UHM",
    "Description": "To promote fitness, disciple, self-defense, self-esteem through Martial Arts at the University of Hawaii and the surrounding community.",
    "Type": "Sports/Athletics",
    "Main Person": "Mason Nakadomari",
    "Contact": "nakadoma@hawaii.edu"
  },
  {
    "Organization": "La Alianza",
    "Description": "The purpose of this organization is to support the William S. Richardson School of Law’s (hereinafter WSRSL) Latine/Hispanic/Caribbean (LHC) community and to advance equal participation and opportunity for LHC individuals and members of other minority groups at WSRSL and beyond.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Steven Manso",
    "Contact": "mansos@hawaii.edu"
  },
  {
    "Organization": "Lambda Law Student Association of Hawaiʻi",
    "Description": "The purpose of this organization is to support the William S. Richardson School of Law (hereinafter WSRSL) queer, lesbian, gay, bisexual, transgender, gender non-conforming, asexual, and intersex (hereinafter LGBTQIA+) community and to advance equal rights for LGBTQIA+ individuals at WSRSL and beyond.",
    "Type": "Academic/Professional",
    "Main Person": "Isis Usborne",
    "Contact": "iu@hawaii.edu"
  },
  {
    "Organization": "Law Review at the University of Hawaiʻi",
    "Description": "The University of Hawaiʻi Law Review at the William S. Richardson School of Law serves the local legal community by providing an elite academic forum for legal scholarship in Hawaiʻi and the Pacific, and contributes to the national discourse on emerging legal issues through the publication of compelling legal writing. \n\nFirst organized in 1979, the University of Hawaiʻi Law Review is a student-run organization that publishes Hawaiʻi’s leading journal of legal scholarship authored by contributors from the legal community, including law professors, practitioners, jurists, and law students. The Law Review produces two issues annually, published in the winter and summer. Each issue contains content that is on the cutting edge of legal scholarship, and addresses topics of great importance and interest to our legal community. Manuscripts have been published relating to Land Use in Hawaiʻi; Environmental and Energy Law; Native Hawaiians and other Indigenous Peoples; and Racial and Social Justice. Articles published in the University of Hawaiʻi Law Review are often cited by scholars and practitioners, both in the State of Hawaiʻi and throughout the United States.\n\nIn addition to written publications, the Law Review launched its very own podcast – Hawaiʻi Law.  Established in Fall 2022, Hawaiʻi Law brings together esteemed guests from all backgrounds to discuss legal issues facing our state. \n\nThe University of Hawaiʻi Law Review has two primary purposes: (1) to advance legal scholarship and discourse in local, national, and international legal communities and (2) to provide an academic forum for Richardson’s leading law students to further sharpen their legal analysis, writing, and editing skills.",
    "Type": "Academic/Professional",
    "Main Person": "Gabriel Baugh",
    "Contact": "gbaugh@hawaii.edu"
  },
  {
    "Organization": "LIFE (Love Is For Everyone)",
    "Description": "LIFE is a Christian club for students who are interested in having fellowship and fun. This club is committed to providing opportunities for all students to study the bible, get together and have fun while abiding by all established policies of the University. A variety of activities will be conducted ranging from dances and hikes to prayer times and devotionals.",
    "Type": "Religious/Spiritual",
    "Main Person": "Samantha Pinera",
    "Contact": "sjpin89@hawaii.edu"
  },
  {
    "Organization": "Linguistic Society of Mānoa",
    "Description": "The mission of LSM is to promote academic and social activity among the students, staff,\nand faculty of the University of Hawaiʻi at Mānoa who are interested in linguistics. We\nare dedicated to the promotion of linguistics, and to making the study of language and\nlinguistics fun, social, inclusive, and interactive.",
    "Type": "Academic/Professional",
    "Main Person": "Hunter Procter",
    "Contact": "procter7@hawaii.edu"
  },
  {
    "Organization": "Living Stone Chinese Christian Fellowship",
    "Description": "The purpose of Living Stone Chinese Christian Fellowship is to provide a welcoming community for students at the University of Hawaiʻi who are interested in exploring the Christian faith and building fellowship within a culturally inclusive environment. Our mission is to support the spiritual growth of Chinese-speaking and international students through Bible study, worship, prayer, and small group discussions. In addition, we seek to foster cross-cultural friendships by hosting outreach events, service activities, and cultural exchanges that encourage mutual understanding and care for the wider campus community.",
    "Type": "Religious/Spiritual",
    "Main Person": "Quan Zhang",
    "Contact": "quanz@hawaii.edu"
  },
  {
    "Organization": "Lord of the Universe Society (LOTUS)",
    "Description": "To coordinate the cultural events of Diwali and Holi for the community and school",
    "Type": "Ethnic/Cultural",
    "Main Person": "Venkataraman Balaraman",
    "Contact": "venkatar@hawaii.edu"
  },
  {
    "Organization": "Mānoa Scholars Club ",
    "Description": "The purpose of the Mānoa Scholars Club is to give students—both incoming and continuing New Warrior Scholars—the opportunity to represent the best and brightest at UH Mānoa both academically and in character. Students who have a stronger commitment to their university are more likely to retain and enhance their success. Many of the scholars were active members in their high schools and community and would like to carry that same sense of pride and commitment as a University of Hawai’i at Mānoa student.",
    "Type": "Academic/Professional",
    "Main Person": "Trista Yamaguchi",
    "Contact": "tristay@hawaii.edu"
  },
  {
    "Organization": "Marine Technology Society O‘ahu Student Section",
    "Description": "The Marine Technology Society (MTS) is an international, multidisciplinary society whose purpose is to promote awareness, understanding, advancement, and application of marine technology.",
    "Type": "Academic/Professional",
    "Main Person": "Tyler Inkley",
    "Contact": "inkley@hawaii.edu"
  },
  {
    "Organization": "Math Club at the University of Hawaii at Manoa",
    "Description": "The Math Club at the University of Hawaiʻi at Mānoa is dedicated to fostering a vibrant community for students passionate about mathematics. We aim to create a space where members can explore and deepen their understanding of mathematical concepts, collaborate on problem-solving, and engage in stimulating discussions. Through our events, we connect students with professors and professionals who demonstrate the practical applications of mathematics in various fields, offering insight into how math is used in research, industry, and beyond.",
    "Type": "Academic/Professional",
    "Main Person": "Gillen Vale Jusi",
    "Contact": "gjusi@hawaii.edu"
  },
  {
    "Organization": "Medical Education Student Interest Group",
    "Description": "It is the purpose of Medical Education Student Interest Group to provide a forum for medical students to foster their extra-curricular interest in medical education. Medical Education Student Interest Group shall provide support for those pursuing the Dean’s Certificate of Distinction in Medical Education, who in turn shall demonstrate the knowledge acquired through projects/research, presentation and instruction.",
    "Type": "Academic/Professional",
    "Main Person": "Kristal Xie",
    "Contact": "kristalx@hawaii.edu"
  },
  {
    "Organization": "Medical Student Pride Alliance",
    "Description": "The purpose of the Medical Student Pride Alliance (MSPA) is to support sexual and gender minority (SGM) diversity efforts within JABSOM and the community by promoting education, safe spaces, awareness, and ongoing discussion of SGM health.",
    "Type": "Academic/Professional",
    "Main Person": "Kasen Wong",
    "Contact": "kasentks@hawaii.edu"
  },
  {
    "Organization": "Midshipman Association",
    "Description": "The purpose of the organization shall be to provide a community for Midshipman of Naval Reserve Officer Training Corps at the University of Hawai’i at Manoa (UH NROTC), as well as a community of supporters to the Midshipman. The group shall be focused on providing a service foundation to the community as well as a way to fundraise to promote growth and opportunities for those in the organization. ",
    "Type": "Service",
    "Main Person": "Tiana Dayrit-Fuimaono",
    "Contact": "tianaday@hawaii.edu"
  },
  {
    "Organization": "Molecular Cell Biology at UH Manoa",
    "Description": "The Molecular Cell Biology Club at UH Mānoa serves to foster student interest in the field of cell biology, promote extra-curricular educational opportunities, and support student interactions with peers and professionals who have similar interests. ",
    "Type": "Academic/Professional",
    "Main Person": "Kristyn Miyamoto",
    "Contact": "kmmiyamo@hawaii.edu"
  },
  {
    "Organization": "Mortar Board National Honor Society Hui Po'okela Chapter at the University Of Hawaiʻi at Mānoa",
    "Description": "Mortar Board Senior National Honor Society has long been recognized in the O'ahu community for its continued partnership with diverse service projects with other student clubs and non-profit organizations all over the island. This is a national collegiate honor society for students in their senior year. Each chapter is typically composed of only a handful of carefully selected applicants for the year - the Hui Po'okela Chapter usually does not exceed 25 members at a time. Potential members are chosen based on how they measure in accord with Mortar Board's key values: scholarship, leadership, and service. Those who excel in said values are then carefully examined through a series of interviews hosted by the chapter's current members. It is a great opportunity to give back to the community and form close friendships with fellow Mortar Board members. \n\nThis honor society is more than just prestige, but rather, an opportunity for every undergraduate senior to make a local impact in their campus and community before they graduate. Once initiated in Mortar Board, every member will engage in various community service and fundraising activities. We not only help support each other and the Oʻahu community through various events but above all, we are making a global impact by building and growing the best leaders of tomorrow.",
    "Type": "Honorary Society",
    "Main Person": "Kayla Mishima",
    "Contact": "mishimak@hawaii.edu"
  },
  {
    "Organization": "MRUH (Marine Robotics at the University of Hawaii)",
    "Description": "Team Kanaloa (MRUH) is a multidisciplinary research lab aimed at developing unmanned marine systems. The Unmanned Port Security Vessel (UPSV) is an existing maritime robot developed by the University of Hawaii at Manoa for the purpose of autonomously surveying ports for possible threats including those posed by unknown physical and chemical quantities in times of uncertainty such as a natural disaster or terrorist threat.",
    "Type": "Academic/Professional",
    "Main Person": "Jason Kanemoto",
    "Contact": "jasonmka@hawaii.edu"
  },
  {
    "Organization": "Multiʻōlelo",
    "Description": "Section 1:        Goal: Multiʻōlelo’s main goal is to make language research more accessible to the general public.\nSection 2:         Primary Functions: The primary functions of Multiʻōlelo shall be to:\nPromote research dissemination and scholarly exchange both within and beyond the English-speaking academy. Provide practitioners (e.g., teachers, policy-makers) access to the research they require for their practice. Curate language research related materials in multiple languages from multiple voices (e.g., multilingual text summaries of peer-reviewed articles, infographics, videos and podcasts summarizing research).\nProvide professional development opportunities for current students to contribute to our mission. Promote multilingualism in general.\nSection 3:         UHM Policy: Multiʻōlelo is willing to abide by all UHM policies and guidelines, especially relating to on or off campus activities in which we may participate.",
    "Type": "Academic/Professional",
    "Main Person": "Sarah Aartila",
    "Contact": "saartila@hawaii.edu"
  },
  {
    "Organization": "Nā Lauhoe o ka Lanakila/PADDLING CLUB at the University of Hawaiʻi at Mānoa",
    "Description": "To promote and perpetuate Hoe Waʻa (Hawaiian Outrigger Canoe paddling) within the University of Hawaiʻi community.",
    "Type": "Leisure/Recreational",
    "Main Person": "Robert Foley",
    "Contact": "rfoley7@hawaii.edu"
  },
  {
    "Organization": "NMDP/Be The Match Chapter",
    "Description": "As the NMDP Chapter at UH Mānoa, we believe each of us can make a significant impact in the fight against blood cancers and disorders. As a Campus Chapter under the National Marrow Donor Program® (NMDP℠), we aim to grow the marrow donor registry and expand access to life-saving treatments. Members of our chapter have the opportunity to interact with others who share a passion for this cause and earn non-clinical volunteering (service) hours, while making a tangible difference. We invite students to join our mission: find cures, save lives.",
    "Type": "Academic/Professional",
    "Main Person": "Mariel Tadena",
    "Contact": "marielnt@hawaii.edu"
  },
  {
    "Organization": "NATIONAL MOCK TRIAL TEAM AT UNIVERSITY OF HAWAI‘I SCHOOL OF LAW",
    "Description": "National Mock Trial Team at The University of Hawai‘i School of Law is a student organization dedicated to trial advocacy, advancing the trial advocacy skills of its members, and successfully representing the University of Hawai‘i School of Law in trial advocacy competitions across the nation. It is composed of the most skilled advocates at the University of Hawai‘i School of Law and seeks to represent the school at the highest level in the National Mock Trial Competition and other competitions.",
    "Type": "Academic/Professional",
    "Main Person": "Carolina Frances",
    "Contact": "cfrances@hawaii.edu"
  },
  {
    "Organization": "Natural Resources and Environmental Management Graduate Student Organization at University of Hawaiʻi at Mānoa",
    "Description": "NREM Graduate Student Organization (NREM GSO) is a student-led organization that represents and advocates for graduate students in the Department of Natural Resources and Environmental Management. We provide opportunities for social and professional connections, serve as a voice for student interests at the departmental level, and help facilitate access to funding and resources. The GSO organizes events such as Pau Hana gatherings that bring together students, faculty, and staff, as well as workshops and professional development activities to strengthen skills and foster collaboration. Open to all NREM graduate students, our organization aims to build community, support academic and professional growth, and encourage dialogue on issues relevant to natural resources, the environment, and sustainability.",
    "Type": "Academic/Professional",
    "Main Person": "Helen Hastedt",
    "Contact": "hhastedt@hawaii.edu"
  },
  {
    "Organization": "Natural Sciences Student Ambassadors",
    "Description": "Our organization strives to promote a welcoming and inclusive community for all students pursuing an undergraduate degree in the Natural Sciences. Members of our organization will act as mentors and leaders, aiding incoming students in their transition to our University and building camaraderie amongst continuing students.",
    "Type": "Academic/Professional",
    "Main Person": "Kurt Wong",
    "Contact": "kwong28@hawaii.edu"
  },
  {
    "Organization": "Newman Club",
    "Description": "Newman Club is a Catholic Campus Ministry serving the University of Hawai'i at Manoa students, faculty, and staff. We are a diverse and inclusive community, a home away from home for students where \"heart speaks to heart.\" We provide life-long spiritual development, leadership skills training, retreats, community building, socials, and more to help people of all ages to grow in understanding of how we are called to live our faith. ",
    "Type": "Religious/Spiritual",
    "Main Person": "Fay Pabo",
    "Contact": "fayc@hawaii.edu"
  },
  {
    "Organization": "JABSOM OB/GYN Interest Group",
    "Description": "It is the purpose of OB/GYN IG is to provide a forum for medical students to foster their extra-curricular interest in the obstetrics and gynecology (OB/GYN) specialty, to serve as\nthe base for hands-on activities and research opportunities pertaining to OB/GYN, and to provide guidance for students interested in applying for OB/GYN residency programs.",
    "Type": "Academic/Professional",
    "Main Person": "Alexandra Masca",
    "Contact": "amasca@hawaii.edu"
  },
  {
    "Organization": "Oncology Interest Group at JABSOM",
    "Description": "Oncology Interest Group at JABSOM is a student run program located at the John A Burns School of Medicine whose mission is to provide students with the opportunity to gain greater exposure to the scientific, clinical and personal aspects of oncology. Help students explore interests in oncology and its sub-specialties such as radiation oncology, pediatric oncology, surgical oncology, and gynecological oncology.\n",
    "Type": "Academic/Professional",
    "Main Person": "Xavier Heidelberg",
    "Contact": "xkh@hawaii.edu"
  },
  {
    "Organization": "Pacific Asian Travel Association (PATA)",
    "Description": "To contribute to the sustainable and responsible development of travel and tourism in Asia Pacific through the protection of the environment, the conservation of heritage, and support for education.",
    "Type": "Academic/Professional",
    "Main Person": "Cody-John Sakamoto",
    "Contact": "CODY30@HAWAII.EDU"
  },
  {
    "Organization": "Pasifika Allies Association",
    "Description": "PA‘A–meaning “firm” and “engaged” in ‘Ōlelo Hawai‘i, and “way of life” in fino Chamoru–perpetuates our collective Pasifika values of ancestors, community, family, history, heritage, reciprocity, and respect through collaborative events that provide a safe space, cultivate community, and regenerate relationships for Pasifika students and all others that share our collective values at UHM. “Paʻa ka ʻike i ke aʻo ʻana o nā kūpuna: The knowledge is solidified by the teachings of the ancestors.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Waileia Tupou",
    "Contact": "wtupou@hawaii.edu"
  },
  {
    "Organization": "Patient Safety and Quality Improvement Interest Group",
    "Description": "The purpose of the organization shall be to:\n1. Provide a platform for medical student interested in patient safety and quality\nimprovement to interact with peers who share similar interests and goals.\n2. Provide opportunities for medical students to expand their knowledge on patient safety\nby means of workshops, presentations, and online modules.\n3. Aid medical students in their search for patient safety and quality\nimprovement/outcomes related research.",
    "Type": "Academic/Professional",
    "Main Person": "Maya Nishida ",
    "Contact": "mayakn@hawaii.edu"
  },
  {
    "Organization": "Phi Alpha Honor Society Nu Sigma Chapter",
    "Description": "The purpose of Phi Alpha is to provide a closer bond among students of social work and promote humanitarian goals and ideals. Phi Alpha fosters high standards of education for social workers and invites into membership with those who have attained excellence in scholarship and achievement in social work.",
    "Type": "Honorary Society",
    "Main Person": "Chelsea McDonough",
    "Contact": "cem2015@hawaii.edu"
  },
  {
    "Organization": "Phi Alpha Theta - Alpha Beta Epsilon ",
    "Description": "Phi Alpha Theta (PAT) is a national honor society open to all students with an interest in history—not just history majors: membership requires the completion of a certain number of history courses and a qualifying GPA.",
    "Type": "Honorary Society",
    "Main Person": "Yejun Kweon ",
    "Contact": "yejunk@hawaii.edu"
  },
  {
    "Organization": "Phi Mu Fraternity",
    "Description": "The purpose of the Iota Alpha Chapter shall be to encourage and promote the purpose and ideals of Phi Mu Fraternity to this campus, and to function by the rules in the Fraternity’s Constitution and Bylaws and Standing Rules and Procedures. Our mission statement is: Founded in 1852, Phi Mu is a women's organization which provides personal and academic development, service to others, commitment to excellence and lifelong friendship through a shared tradition. Phi Mu promotes vibrant living, encouraging members to achieve their personal best.",
    "Type": "Fraternity/Sorority",
    "Main Person": "Romi McPherson",
    "Contact": "romim@hawaii.edu"
  },
  {
    "Organization": "Pi Gamma Mu, the International Honor Society in the Social Sciences, Hawai'i Alpha Chapter at the University of Hawai'i at Mānoa",
    "Description": "Encourage and promote excellence in the Social Sciences and to uphold and nurture scholarship, leadership, and service.",
    "Type": "Academic/Professional",
    "Main Person": "Zeven Anderson-Leonard",
    "Contact": "zeven@hawaii.edu"
  },
  {
    "Organization": "Pinoy in Engineering ",
    "Description": "Club PIE (Pinoy in Engineering) is a student organization at the University of Hawaiʻi at Mānoa dedicated to celebrating and sustaining Filipino culture within the college experience. Our mission is to foster a strong, supportive space for Filipino-identifying students in engineering, architecture, and STEM by blending cultural identity with academic and professional growth.\n\nWe aim to build lasting connections among members through cultural events, social gatherings, and leadership opportunities. Beyond campus, we aim to engage with the local Filipino community in Hawaiʻi through service projects and collaborative outreach.\n\nClub PIE is more than just a cultural club, it’s a community that embraces our roots while empowering each other to succeed and represent the next generation of Filipino professionals.",
    "Type": "Academic/Professional",
    "Main Person": "Kamryn Tiana Acoba",
    "Contact": "ktacoba@hawaii.edu"
  },
  {
    "Organization": "Planned Parenthood Generation Action at the University of Hawaii at Manoa",
    "Description": "Our purpose is to mobilize advocates for reproductive freedom and to create awareness surrounding reproductive justice on our campus. We aim to be a safe space and resource for all students.",
    "Type": "Political",
    "Main Person": "Emily Kulaga",
    "Contact": "kulagae@hawaii.edu"
  },
  {
    "Organization": "Pre-Dental Association",
    "Description": "To support pre-dental students by providing volunteer opportunities, meetings with dental care professionals, and coordinating specialized workshops. Through this, our main objective is to assist passionate pre-dental students become competitive dental school applicants.",
    "Type": "Academic/Professional",
    "Main Person": "Kyle Koga",
    "Contact": "kkoga4@hawaii.edu"
  },
  {
    "Organization": "Pre-Medical Association",
    "Description": "To develop and stimulate a realistic understanding of healthcare professions. To expand our knowledge of admissions policies and our acceptance potential to health programs. To unite pre-health students of the University of Hawai‘i system through a unique social and intellectual fellowship. To nurture a sense of humanity through community involvement.",
    "Type": "Academic/Professional",
    "Main Person": "Joanne Wong",
    "Contact": "joannevw@hawaii.edu"
  },
  {
    "Organization": "Pre-Optometry/Ophthalmology Club",
    "Description": "The organization will serve as a community first UH Mānoa students interested in optometry, ophthalmology, or general vision science.",
    "Type": "Academic/Professional",
    "Main Person": "Darwin Do",
    "Contact": "darwindo@hawaii.edu"
  },
  {
    "Organization": "Pre-Veterinary Club at the University of Hawaii at Manoa",
    "Description": "The Pre-Veterinary Club at the University of Hawaii at Manoa is committed to students who share an interest and passion for animals and veterinary medicine. The club accomplishes its mission by organizing events that emphasize education and hands-on experience. The club also participates in community service activities.",
    "Type": "Academic/Professional",
    "Main Person": "Ayla Hakikawa",
    "Contact": "ath8@hawaii.edu"
  },
  {
    "Organization": "Psi Chi, the International Honor Society in Psychology, UH Mānoa Chapter",
    "Description": "to encourage, stimulate, and maintain excellence in scholarship of the individual members in all fields, particularly in psychology, and to advance the science of psychology",
    "Type": "Honorary Society",
    "Main Person": "Angelica Nelson",
    "Contact": "atnelson@hawaii.edu"
  },
  {
    "Organization": "Psi Sigma: The Psychology Connection",
    "Description": "To serve as the connection among psychology students; facilitate social interaction and psychology discussion. We encourage the pursuit of psychological science, foster enduring connections among peers in psychology, and advance the academic and professional development of ​our members.​  Psi Sigma uphold​s​ the values of knowledge, benevolence, and integrity.",
    "Type": "Academic/Professional",
    "Main Person": "Jaydon Lai",
    "Contact": "jaydon8@hawaii.edu"
  },
  {
    "Organization": "Public Health Interest Group at JABSOM",
    "Description": "The purpose of this organization is to provide public health exposure to medical \nstudents and how they can incorporate these principles into clinical medicine practice.",
    "Type": "Academic/Professional",
    "Main Person": "Diana Holden",
    "Contact": "dianazyh@hawaii.edu"
  },
  {
    "Organization": "Public Relations Student Society of America (PRSSA) ",
    "Description": "PRSSA strives to provide exceptional service to our members by enhancing their education, broadening their professional network and helping launch their professional careers after graduation. ",
    "Type": "Academic/Professional",
    "Main Person": "Mailani Magbanua",
    "Contact": "Mailani4@hawaii.edu"
  },
  {
    "Organization": "Real Estate Club at University of Hawaii",
    "Description": "To provide opportunities for networking and career development for students interested in the Real Estate industry by serving as a medium between the student body, representatives, and organizations in the field of Real Estate. ",
    "Type": "Academic/Professional",
    "Main Person": "Cassie Matsumoto",
    "Contact": "cassiecm@hawaii.edu"
  },
  {
    "Organization": "Regents and Presidential Scholars Club",
    "Description": "The Regents and Presidential Scholars (RAPS) Club is an organization dedicated to fostering a vibrant community among the accomplished recipients of the Regents and Presidential scholarships at the University of Hawai’i at Mānoa. With a primary focus on promoting student interaction and camaraderie, the club aims to provide guidance and information-sharing to students in hopes of empowering members to excel in their collegiate pursuits and develop professionally alongside their peers. The club will actively offer various community service opportunities to help members meet service hour requirements and will also seek ways for scholarly involvement and recognition so that scholars are well-connected within the university. ",
    "Type": "Academic/Professional",
    "Main Person": "Victoria Hung",
    "Contact": "vhung@hawaii.edu"
  },
  {
    "Organization": "Risk Management and Insurance Club ",
    "Description": "The purpose of this organization shall be to spread awareness of insurance as a\ncareer field. The organization will strive to provide opportunities for the students\nat the University of Hawaii at Manoa to be exposed to the insurance industry.",
    "Type": "Academic/Professional",
    "Main Person": "Lisa Takebe",
    "Contact": "ltakebe@hawaii.edu"
  },
  {
    "Organization": "Rural Health Interest Group",
    "Description": "The Rural Health Interest Group (RHIG) serves to promote medical practice on the neighbor islands and underserved areas of Hawaiʻi. To increase awareness about the physician shortage in Hawaii and nationwide. To educate medical students about rural health issues, and to advocate for better healthcare in rural communities.",
    "Type": "Academic/Professional",
    "Main Person": "Jeanette Tajiri",
    "Contact": "jtajiri@hawaii.edu"
  },
  {
    "Organization": "Salsa Dancing at UHM",
    "Description": "",
    "Type": "Leisure/Recreational",
    "Main Person": "Gordon Walker",
    "Contact": "gwalker@hawaii.edu"
  },
  {
    "Organization": "Second Language Studies Student Association (SLSSA)",
    "Description": "SLSSA is an association of the Students of the Second Language Studies Department at the University of Hawai’i at Mānoa. \n\nIt is dedicated to developing the academic, professional, and social identities of its members. It also seeks to connect them to the career and volunteer opportunities \noutside the Department and University. \n\nIt seeks to provide avenues for these identities to be developed among its members, through various events in the school year.",
    "Type": "Academic/Professional",
    "Main Person": "Milang Shin",
    "Contact": "milangs@hawaii.edu"
  },
  {
    "Organization": "Society of American Archivists Student Chapter",
    "Description": "The purpose of forming this student chapter was to encourage discussion and awareness of archival issues and the archival profession in Hawaii, across the United States and around the world. Today, we are fulfilling our purpose by providing our members with opportunities to explore local archives through tours and service projects, attend archival conferences and network with local archivists to promote a stronger archivist community within the islands of Hawai'i.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Anna Wood",
    "Contact": "woodanna@hawaii.edu"
  },
  {
    "Organization": "Society of Physics Students (SPS) at UH Mānoa",
    "Description": "The purpose of SPS is to provide professional development to physics & astro students and all those interested in physics so they may become productive and responsible citizens in the larger scientific community. It also aims to foster a sense of fellowship among its members, providing them opportunities to network with other science students around campus and allowing them to explore the world of possibilities and wonders that physics offers beyond the classroom. Lastly, SPS strives to promote awareness and understanding of physics & astronomy in the general public through outreach.",
    "Type": "Academic/Professional",
    "Main Person": "Stephen Wagner",
    "Contact": "swagner3@hawaii.edu"
  },
  {
    "Organization": "Society of Women Engineers",
    "Description": "Empower women to achieve full potential in careers as engineers and leaders, expand the image of the engineering and technology professions as a positive force in improving the quality of life, and demonstrate the value of diversity and inclusion.",
    "Type": "Academic/Professional",
    "Main Person": "Rona Lei Duldulao",
    "Contact": "ronaleid@hawaii.edu"
  },
  {
    "Organization": "Soka Gakkai International (SGI) Club at the University of Hawai’i at Mānoa",
    "Description": "The fundamental purpose of SGI Club is to help students unlock their \nhidden potential and achieve creative harmony with their environment through the philosophy and practice of Nichiren Buddhism in the SGI-USA. This is the ultimate expression of individual empowerment — that each student can transform the inevitable challenges of daily life into sources of growth and fulfillment and become a positive influence in his or her school, workplace, family and community. By promoting an understanding of how Nichiren Buddhism can be applied to the challenges of modern living, our activities contribute to the development of peace, culture and education within society, inspire respect for cultural diversity and human rights, and encourage the protection of nature and the environment.",
    "Type": "Academic/Professional",
    "Main Person": "Kimara Alger",
    "Contact": "kimaraa@hawaii.edu"
  },
  {
    "Organization": "SPARK: Service, Passion, Action, Responsibility, and Kindness",
    "Description": "\"SPARK fosters enriching experiences for UH students by encouraging them to participate in their communities through volunteer-based work. SPARK’s programs will support students in seeking out volunteer opportunities that are best suited to their passions and goals. \n\nSPARK establishes a volunteer program, with the opportunity for students to receive 1 of 2 certifications of completion. A 20 hour certificate or a 35 hour certificate may be awarded after one or two semesters. Our mandatory Kuleana Workshop, along with our weekly Mentorship Mondays, will educate and inspire students to engage in community projects and activism in a fun and meaningful way. \n\nSPARK can and will abide by any and all relevant University, state, or federal policies. If a discrepancy between our procedures and an existing relevant policy is brought to our attention, we will take immediate action to correct.\"",
    "Type": "Academic/Professional",
    "Main Person": "Laila Gallardo",
    "Contact": "lailag@hawaii.edu"
  },
  {
    "Organization": "Stocks and Investment Society at University of Hawai'i at Manoa",
    "Description": "This group’s purpose is to provide an educational and social community for financial investments and active investing, with the focus on publicly-traded individual stocks and recognition of diverse investment strategies. Our goal is to both provide a community for experienced investors and promote an environment of financially literate and educated individuals through financial education (not advice).",
    "Type": "Academic/Professional",
    "Main Person": "Brandon Chang",
    "Contact": "changb25@hawaii.edu"
  },
  {
    "Organization": "Stole Society",
    "Description": "Stole Society is dedicated to the manufacturing of stoles for the graduating classes for the College of Tropical Agriculture and Human Resources (CTAHR) at the University of Hawaii at Mānoa. On occasion, Stole Society will also manufacture the stoles across all majors if requested, however, we do have the ability to deny said request if output is not achievable. The main objective is the production of stoles for CTAHR graduates. The proceeds gathered from stoles created by Stole Society supplement scholarships and events for the Fashion Design and Merchandising (FDM) students, and its members of the organization. Stole Society aims to foster positive relationships through the FDM community with organized club activities that include, but are not limited to; manufacturing stoles, festive academic events, inspirational educational trips, etc. Stole Society also aids with coordinating fundraiser events, assisting in the necessary operational functions of FDM’s annual fashion show, and promoting the FDM program at the University of Hawaii at Mānoa.",
    "Type": "Academic/Professional",
    "Main Person": "Latisha Tong",
    "Contact": "latishat@hawaii.edu"
  },
  {
    "Organization": "Student Association at the College of Education (CESA)",
    "Description": "The general purpose and goal of the Student Association at the College of Education shall be to enhance the personal and professional growth of students of the College of Education and those preparing to enter the College of Education.",
    "Type": "Academic/Professional",
    "Main Person": "Tayne Furuta",
    "Contact": "tfuruta3@hawaii.edu"
  },
  {
    "Organization": "Students Interested in Pathology Interest Group",
    "Description": "The Students Interested in Pathology Interest Group aims to educate medical students about the field of Pathology through networking, mentorship, and events such as pathology lab tours and pathology-related workshops.",
    "Type": "Academic/Professional",
    "Main Person": "Jacey Mitchell",
    "Contact": "jaceyn@hawaii.edu"
  },
  {
    "Organization": "Surgery Interest Group",
    "Description": "To offer valuable learning opportunities and foster a welcoming environment for medical students interested in the field of surgery.",
    "Type": "Academic/Professional",
    "Main Person": "Albert Jiang",
    "Contact": "ahwjiang@hawaii.edu"
  },
  {
    "Organization": "Tadoku Talk",
    "Description": "The purpose of this club is to allow for students studying languages (primarily Japanese and English) at the University of Hawaii to engage in reading and talking activities in the language they are studying. ",
    "Type": "Academic/Professional",
    "Main Person": "Brett Mohar",
    "Contact": "mohar@hawaii.edu"
  },
  {
    "Organization": "Taiwanese Student's Association",
    "Description": "To help Taiwanese students in Oahu, Hawaii, understand Hawaiian culture, traditions, and environment, while providing guidance on local resources and campus life to assist them in adapting to the new environment.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Maxwell Lee",
    "Contact": "mcjlee@hawaii.edu"
  },
  {
    "Organization": "Team Hōkūlele",
    "Description": "Team Hōkūlele’s mission is to design, manufacture, launch, and recover a high-powered rocket capable of reaching 25,000 feet max altitude, while providing students with valuable hands-on experience in a professional engineering project environment. The purpose of this project is to foster teamwork, problem-solving, and technical growth. The team also strives to build community, represent Hawaiʻi in the rocketry field, and inspire future University of Hawaiʻi at Mānoa students to pursue ambitious projects of their own. Looking ahead, the team plans to participate in the Friends of Amateur Rocketry (FAR) Oxidizers Unlimited Tournament (OUT) at the FAR Launch Site in the Mojave Desert, California during June 2026, continuing its tradition of representing Hawaiʻi on the national stage.",
    "Type": "Academic/Professional",
    "Main Person": "Aidan Lee",
    "Contact": "Aidanl@hawaii.edu"
  },
  {
    "Organization": "Team RoSE (Robotic Space Exploration)",
    "Description": "Team RoSE (Robotic Space Exploration) is a multidisciplinary student team competing in premier robotics challenges, including the NASA-supported RASC-AL competition and the University Rover Challenge. We unite top talent in engineering, computer science, and biochemistry to build advanced rovers, cultivating the next generation of innovative leaders through hands-on experience.",
    "Type": "Academic/Professional",
    "Main Person": "Micah Tajiri",
    "Contact": "mtajiri@hawaii.edu"
  },
  {
    "Organization": "THE ETHNOMUSICOLOGY ASSOCIATION AT THE UNIVERSITY OF HAWAI‘I AT MĀNOA",
    "Description": "The purpose of the Ethnomusicology Association is to promote world musics and cultures through education, service, and performance; to use music to help others understand social difference and to encourage mutual cooperation; and to provide support to students, scholars, and performers in music at the University of Hawai‘i at Mānoa, our community, and the world.",
    "Type": "Leisure/Recreational",
    "Main Person": "Jack Hernandez",
    "Contact": "JackDH@Hawaii.edu"
  },
  {
    "Organization": "The Public Administration Student Organization at the\nUniversity of Hawai‘i at Mānoa ",
    "Description": "\"Section 1: The mission of the Public Administration Student Organization at the University of\nHawai‘i at Mānoa (PASO at UHM) is to foster educational collaboration and networking among members, to provide a platform for the exchange of ideas, and to build professional\nrelationships with the public service community in Hawai‘i.\n\nSection 2: As a Registered Independent Organization of the University of Hawai‘i at Mānoa, this organization will abide by established University policies.\"",
    "Type": "Academic/Professional",
    "Main Person": "Rafael Munoz",
    "Contact": "rcmunoz@hawaii.edu"
  },
  {
    "Organization": "The Vanguard Initiative",
    "Description": "The purpose of The Vanguard Initiative is to:\n 1. Create a safe and affirming environment for young men of color to engage in open dialogue.\n 2. Foster personal, cultural, and academic development.\n 3. Promote leadership, accountability, and empowerment.\n 4. Explore identity, history, and purpose through workshops, discussions, and mentorship.\n 5. Build community and provide mutual support among members.\n 6. Challenge and dismantle stereotypes and limiting societal narratives.",
    "Type": "Academic/Professional",
    "Main Person": "Deonte Dennis",
    "Contact": "ddennis9@hawaii.edu"
  },
  {
    "Organization": "The Way of Tea Club",
    "Description": "Our organization seeks to provide a place for students to practice the Urasenke school of chado (traditional Japanese tea ceremonies), as well as to preserve Japanese culture and Jakuan tea house for future generations. We also strive to promote peacefulness through a bowl of tea, which is the mission of our 15th-generation grand master, Dr. Genshitsu Sen, who donated Jakuan tea house over 50 years ago. ",
    "Type": "Ethnic/Cultural",
    "Main Person": "Ashley Tamura",
    "Contact": "tamura2@hawaii.edu"
  },
  {
    "Organization": "Timpuyog Organization",
    "Description": "➤To serve the needs of students of the Ilokano language and literature program and others interested in the Ilokano the Ilokano language and Philippine culture.\n➤To promote the Ilokano language and Philippine culture in the community.\n➤To instill pride in our Ilokano heritage.\n➤To develop leadership skills among the students.\n➤To help students develop proficiency in Ilokano and awareness of Filipino traditions and values through meaningful language and cultural activities.\n➤To serve the community through cultural presentations.\n➤To encourage Ilokano students to speak Ilokano.\n➤To serve as role models for our Filipino youth.\nOur Mission and Motto\n➤We, the students of the Timpuyog Organization, believe in establishing a spirit of pride, emphasizing the advancement of the Ilokano language and culture, and providing opportunities for the meaningful exchanges of ideas.\n➤\"Striving to preserve the Ilokano language, culture, and traditions in today's youth...the leaders of tomorrow.\"”      \n➤To serve the needs of students of the Ilokano language and literature program and others interested in the Ilokano the Ilokano language and Philippine culture.\n➤To promote the Ilokano language and Philippine culture in the community.\n➤To instill pride in our Ilokano heritage.\n➤To develop leadership skills among the students.\n➤To help students develop proficiency in Ilokano and awareness of Filipino traditions and values through meaningful language and cultural activities.\n➤To serve the community through cultural presentations.\n➤To encourage Ilokano students to speak Ilokano.\n➤To serve as role models for our Filipino youth.\nOur Mission and Motto\n➤We, the students of the Timpuyog Organization, believe in establishing a spirit of pride, emphasizing the advancement of the Ilokano language and culture, and providing opportunities for the meaningful exchanges of ideas.\n➤\"Striving to preserve the Ilokano language, culture, and traditions in today's youth...the leaders of tomorrow.\"”",
    "Type": "Ethnic/Cultural",
    "Main Person": "Marlon Basilio",
    "Contact": "marlondb@hawaii.edu"
  },
  {
    "Organization": "Travel Industry Management Student Association",
    "Description": "TIMSA, the Travel Industry Management Student Association at the University of Hawaii at Manoa is a student-led organization, dedicated to supporting students' academic and professional journeys within the travel industry. TIMSA has provided clear pathways to success for many students and alumni, guiding them to becoming Hawaii's future leaders. The Travel Industry Management Student Association encourages all students who wish to enhance their experience at UHM and indulge in Hawaii's ever-changing tourism industry. Throughout the year, the club provides opportunities to network with industry professionals, increase their involvement through community-service events, and student engagement.",
    "Type": "Academic/Professional",
    "Main Person": "Sally Citrawireja",
    "Contact": "sallycit@hawaii.edu"
  },
  {
    "Organization": "Tropical Medicine Club at the University of Hawaii at Manoa",
    "Description": "The purpose of this organization shall be: \n- Promote student interest and further improves the quality of the Microbiology programs within the University of Hawaiʻi systems and at other institutions in the state.\n- Promote and explain the benefits and value of HI-ASM membership to students, postdocs, and early career scientists in the state of Hawaiʻi \n- Provide aid and professional development opportunities for students in Microbiology within the state in respects to academic curriculum, research, and employment. \n- Promote student, community and professional participation in local, state and national ASM meetings and activities. ",
    "Type": "Academic/Professional",
    "Main Person": "Jerrisa Ching Choe",
    "Contact": "jching21@hawaii.edu"
  },
  {
    "Organization": "TPSS Organization of Graduate Students at the University of Hawaii at Manoa ",
    "Description": "To engender a community between TPSS students and faculty through its mission of providing educational and professional resources, opportunities, networking, and advocacy within and beyond our department. ",
    "Type": "Academic/Professional",
    "Main Person": "Kenneth Kiehl",
    "Contact": "kkiehl@hawaii.edu"
  },
  {
    "Organization": "United Network of Inclusivity (UNITY) for Disabilities",
    "Description": "Our purpose is to uplift the voices of students with disabilities by providing a supportive and compassionate space run by and for neurodivergent and disabled students.",
    "Type": "Leisure/Recreational",
    "Main Person": "Cecile Vimond",
    "Contact": "cvimond@hawaii.edu"
  },
  {
    "Organization": "University Students of Urban and Regional Planning",
    "Description": "University Students of Urban and Regional Planning (USURP) is a departmental student council comprised of Department of Urban and Regional Planning (DURP) students. The council meets to discuss the needs of the students in efforts to  discover resources and solutions that would help improve the student experience. Networking opportunities are a key component for USURP discussions because we find it important to link students with APA members and future employers. Students on the council are typically second year students with insight on the program, the best places to study on campus, and the resources available to UH Manoa students.",
    "Type": "Academic/Professional",
    "Main Person": "Losamalia Takayawa",
    "Contact": "takayawa@hawaii.edu"
  },
  {
    "Organization": "Vida Volunteer ",
    "Description": "\"VIDA is a non-profit humanitarian volunteer organization whose mission is to positively impact the quality of life in underserved communities, while offering volunteers a life-changing experience. Along with affiliated collegiate clubs at other established universities, our VIDA Hawaii team recruits student volunteers, collects donations, and raises funds to participate in volunteer-based medical, dental, and veterinary clinics. VIDA’s current focus is to help impoverished communities in Guatemala, Nicaragua, and Costa Rica, and will often collaborate with local ministry of health officials, schools, and local community leaders. We will organize trip(s) to one or more of these Central American countries each academic year. Along with providing free basic medical, dental, and veterinary care, students will have the opportunity to participate in community public health projects that aim to educate and improve the quality of life in these underserved areas.\n\n To summarize, the purpose of VIDA Hawaii is to:\nCoordinate annual student-oriented volunteer trips\nBuild a campus presence and connect with students who are interested in pursuing a career in the veterinary and healthcare fields, as well as students who are interested in helping communities in need \nEducate the general public and student population about the healthcare discrepancies in the Central American countries VIDA works\nEncourage student involvement in our own community by offering volunteer opportunities throughout the school year \n\n\"",
    "Type": "Service",
    "Main Person": "James Rodden",
    "Contact": "jrodden8@hawaii.edu"
  },
  {
    "Organization": "Vietnamese Student Association at the University of Hawaii at Manoa.",
    "Description": "The objectives of this organization are as follows:\nA. To serve the needs of students of the Vietnamese language and literature program and others interested in the Vietnamese language and Vietnamese culture.\nB. To promote the Vietnamese language and Vietnamese culture in the community.\nC. To instill pride in our Vietnamese heritage.\nD. To develop leadership skills among the students.\nE. To help students develop proficiency in Vietnamese and awareness of Vietnamese traditions and values through meaningful language and cultural activities.\nF. To serve the community through cultural presentations.\nG. To encourage students to speak Vietnamese.\nH. To serve as role models for our Vietnamese youth.",
    "Type": "Ethnic/Cultural",
    "Main Person": "Yenvy Tran",
    "Contact": "yenvy@hawaii.edu"
  },
  {
    "Organization": "VolunteerAlly at the University of Hawaiʻi at Mānoa",
    "Description": "The purpose of VolunteerAlly at the University of Hawai’i at Mānoa is to empower students to serve their community through meaningful, impactful volunteerism. In collaboration with VolunteerAlly.org, the chapter connects students to service opportunities, promotes civic engagement, and fosters lifelong habits of community leadership",
    "Type": "Service",
    "Main Person": "Aaron Plascencia",
    "Contact": "aaronpla@hawaii.edu"
  },
  {
    "Organization": "Warriors Triathlon at University of Hawaii",
    "Description": "To cultivate students interest in triathlon and form a collaborative team of training and racing individuals. ",
    "Type": "Sports/Leisure",
    "Main Person": "Amber Chong",
    "Contact": "chonga4@hawaii.edu"
  },
  {
    "Organization": " Whining & Dining Club",
    "Description": "Breaking down barriers between majors and build relationships with students they may not have otherwise interacted with, the club aims to foster a sense of community on campus and create a space where students can expand their culinary horizons and connect with others.",
    "Type": "Sports/Leisure",
    "Main Person": "Jenny Brown",
    "Contact": "jennyeb@hawaii.edu"
  },
  {
    "Organization": "Women in STEM",
    "Description": "The mission of the Women in STEM Club is to support, empower, and elevate undergraduate university students who identify as women or women-aligned individuals pursuing degrees and careers in science, technology, engineering, and mathematics (STEM). We aim to build an inclusive campus community that fosters leadership, collaboration, and personal and professional growth.",
    "Type": "Academic/Professional",
    "Main Person": "Aisha Vaughan",
    "Contact": "aishabv@hawaii.edu"
  },
  {
    "Organization": "Women in Surgery Interest Group at JABSOM",
    "Description": "The purpose of the Women in Surgery Interest group is to support women entering the male-dominated field of surgery by promoting education, networking events, and ongoing discussion of how to increase representation within the field.\n",
    "Type": "Academic/Professional",
    "Main Person": "D-Dré Wright",
    "Contact": "ddre@hawaii.edu"
  },
  {
    "Organization": "Young Skål",
    "Description": "To develop friendship and common purpose between the students of the educational establishment, by participating in areas related to the tourism industry, and also in cultural, sports, travel and public relations activities. To encourage and assist in the tourism education or experience of the members by participating in activities and meeting members of Skal International Hawaii. To cooperate voluntarily in all activities and the organization set up by Skal International Hawaii. To promote training opportunities for its members and to acquire professional experience with the support of Skal International. To ensure that its members are fully aware of Skal International, locally, nationally and internationally.",
    "Type": "Leisure/Recreational",
    "Main Person": "Chassidy Sakamoto ",
    "Contact": "cksakamo@hawaii.edu"
  },
  {
    "Organization": "Zen_Ohana",
    "Description": "a Yoga class with the goal to gather students, staff and faculty, in a friendly and supportive environment to get to know each other, have fun, relax, release stress, improve physical and mental health, improve memory, coordination etc.",
    "Type": "Leisure/Recreational",
    "Main Person": "Katy Tarrit",
    "Contact": "katytm7@hawaii.edu"
  },
  {
    "Organization": "Zumba_Ohana",
    "Description": "A Zumba class with the goal to gather students, staff and faculty, in a friendly and supportive environment to get to know each other, have fun, relax, release stress, improve physical and mental health, improve memory, coordination etc.",
    "Type": "Leisure/Recreational",
    "Main Person": "Katy Tarrit",
    "Contact": "katytm7@hawaii.edu"
  }
]