[
  {
    "course_prefix": "ACC",
    "course_number": 200,
    "course_title": "Introduction to Accounting I",
    "course_desc": "Introduction to managerial and financial accounting and methods used to record and report managerial and financial information to decision makers internal and external to the firm.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ACC",
    "course_number": 201,
    "course_title": "Introduction to Financial Accounting",
    "course_desc": "Introduction to accounting principles and practices used to record and communicate financial information. Analyze methods for valuating assets, liabilities, and equity of an organization.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement into ENG 100 or equivalent; Lecture Hours: 3"
  },
  {
    "course_prefix": "ACC",
    "course_number": 202,
    "course_title": "Introduction to Managerial Accounting",
    "course_desc": "An introduction to managerial accounting methods for evaluating performance including cost accounting, budgeting, break-even analysis, ratio analysis, standard cost systems, and reporting for internal decision making.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Pre: ACC 201 with “C” or better.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ACC",
    "course_number": 210,
    "course_title": "Introduction to Accounting II",
    "course_desc": "Introduction to managerial and financial accounting and methods used to record and report managerial and financial information to decision makers internal and external to the firm. Part II.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in ACC 200.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ACC",
    "course_number": 252,
    "course_title": "Using Quickbooks® in Accounting",
    "course_desc": "ACC 252 provides \"hands-on\" approach to computerized accounting using QuickBooks®. This course applies previously acquired accounting skills and knowledge in a computerized environment to setup and maintain accounting records. Emphasis will be placed on the application of QuickBooks® to the accounting cycle. This course also presents the basic concepts of an accounting information system and methods to document such systems. The course content of ACC 252 prepares students for the QuickBooks® Certification Examination.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit or concurrent enrollment in ACC 201 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ACC",
    "course_number": 255,
    "course_title": "Using Excel® in Accounting",
    "course_desc": "ACC 255 provides hands-on training in the use of spreadsheets to solve accounting problems. Coursework involves application of previously acquired accounting skills and knowledge with emphasis on financial and managerial accounting. This course also reviews basic database concepts, and introduces basic Data Analytics concepts and applications in accounting.",
    "num_units": 3,
    "dept_name": "Accounting",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or concurrently enrolled in ACC 201 or the consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": "93V",
    "course_title": "Cooperative Education",
    "course_desc": "This course provides college credit for compensated work experience to reinforce knowledge and skills learned in coursework for the Agricultural Technology Program. Related instruction may be provided as appropriate. Seventy-five hours of work per semester is required for each credit earned. Repeatable to a total of 4 credits that may be applied to the AS degree, 1 credit applicable toward Certificate of Completion.",
    "num_units": "1-4",
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Pre: Open to Agriculture majors only. Instructor’s permission is required."
  },
  {
    "course_prefix": "AG",
    "course_number": 100,
    "course_title": "Agriculture Orientation: Careers",
    "course_desc": "Familiarizes students with different agricultural operations in Hawai‘i through lectures, guest speakers and fieldtrips.",
    "num_units": 1,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "AG",
    "course_number": 120,
    "course_title": "Plant Science",
    "course_desc": "The study of plant science, morphology, anatomy, physiology classification, growth, growth regulators, and propagation. Students are required to write a 10 to 15 page research report.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2; Lab Hours: 2"
  },
  {
    "course_prefix": "AG",
    "course_number": 132,
    "course_title": "Integrated Pest Management",
    "course_desc": "Strategies of integrated pest management; biological and cultural pest controls, weed control, disease control, insect control.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": 149,
    "course_title": "Plant Propagation",
    "course_desc": "Introduction to the principles and practices of propagation of fruit, vegetable, and ornamental crops by seed, cuttings, grafting, budding, layering and division.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": 152,
    "course_title": "Orchid Culture",
    "course_desc": "An extensive study of orchid identification, breeding, growth, and culture. Students are required to write a 10 to 15 page research report.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": 170,
    "course_title": "Introduction to Aquaponics",
    "course_desc": "The course covers aquaculture, hydroponics, aquaponics, sustainable aquatic feed production, renewable local seeding technologies and micronutrient supplementation, fish and plant physiology, renewable energy systems, water catchment and conservation techniques, and best aquaponic food safety practices. The basic physical and biological principles governing sustainable farm and agribusiness operations are emphasized.",
    "num_units": 4,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3; Lab Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": 171,
    "course_title": "Farm Renewable Energy Systems",
    "course_desc": "This course explores the various renewable energy systems potentially employable on small farms. Topics such as solar, solar thermal, wind, micro-hydraulic, biomass, and hybrid technologies are covered in the course.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": "192V",
    "course_title": "Special Topics in Agriculture",
    "course_desc": "Topics related to diversified agriculture chosen by the Instructor. Course content may vary. May be repeated up to 5 credits with different topics.",
    "num_units": "1-4",
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "AG",
    "course_number": 202,
    "course_title": "Agriculture, Environment, and Society",
    "course_desc": "The goal of this course is to establish foundational knowledge of agroecosystems. Emphasis is on the interrelationship among the crop plants, essential plant nutrients, social factors, and cultural practices. Key goals are to introduce students to the broad range of topics covered within agroecosystems, as well technical writing in agricultural science, and oral discussion and argument.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": "202L",
    "course_title": "Agriculture, Environment, and Society Laboratory",
    "course_desc": "The goal of this course is to establish foundational knowledge of agroecosystems. Emphasis is on the interrelationship among the crop plants, essential plant nutrients, social factors, and cultural practices. Key goals are to introduce students to the broad range of topics covered within agroecosystems, as well as field and laboratory investigations in agroecology.",
    "num_units": 1,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better or concurrent enrollment in AG 202.; Lab Hours: 3"
  },
  {
    "course_prefix": "AG",
    "course_number": 235,
    "course_title": "Irrigation Principles and Design",
    "course_desc": "Fundamentals of irrigation principles, plant, soil, water relationships, soil moisture sensing devices, delivery systems, set up of drip, sprinkler, and surface irrigation systems. Use of chemigation.",
    "num_units": 3,
    "dept_name": "Agriculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 140,
    "course_title": "Introduction to Veterinary Technology",
    "course_desc": "This course introduces students to the field of veterinary technology and describes the responsibilities and expectations for students enrolled in the program. Topics include: roles of the veterinary team members, legal and ethical aspects of veterinary practice, breeds of companion animals, safety, sanitation and waste-disposal protocols, and career fields in veterinary medicine.",
    "num_units": 3,
    "dept_name": "Animal Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Registration in or a grade “C” or better in ANSC 142 and ANSC 142L. Credit for or placement in ENG 100 and MATH 101. Confirmed attendance to Windward CC veterinary technology information session.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 142,
    "course_title": "Anatomy and Physiology of Domestic Animals",
    "course_desc": "Introduction to the anatomy and physiology of domestic animals. Compares the anatomy and function of major body systems for the cat, dog and horse, with lesser emphasis on birds, reptiles and amphibians. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Registration in or a grade “C” or better in ANSC 140 and ANSC 142L. Credit for or placement in ENG 100 and MATH 101. Confirmed attendance to Windward CC veterinary technology information session.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "142L",
    "course_title": "Anatomy of Domestic Animals Laboratory",
    "course_desc": "Laboratory to accompany ANSC 142. This course is designed to acquaint the student with the body systems of common domestic species (e.g., cats, dogs, horses and birds) through dissections, examinations of models, laboratory exercises, and other hands-on activities. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Registration in or a grade “C” or better in ANSC 140 and ANSC 142. Credit for or placement in ENG 100 and MATH 101. Confirmed attendance to Windward CC veterinary technology information session.; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 143,
    "course_title": "Medical Dosages and Calculations for Veterinary Technicians",
    "course_desc": "Introduction to Medical Dosages and Calculation for Veterinary Technicians. This course is designed to present the information commonly referred to as posology, which is defined as the study of dose and dosage in the field of applied pharmacology. This course will include, but not be limited to, the following: general mathematics used by veterinary medical personnel involved in calculating dosages of common drugs, reading drug orders and labels, and calculating intravenous fluid rates. Students will learn systems of measure, drug orders, drug concentration, conversions and different methods of dose calculations. The goal of this course is that each student be confident and capable of calculating correct drug doses regardless of the physical form of the medication. This course requires a strong background in algebra, the metric system, and an understanding of word problems. It is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Enrolled as a Veterinary Assisting Program student; Placement in Eng 100 and Math 100 level courses.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 151,
    "course_title": "Clinical Laboratory Techniques",
    "course_desc": "Provides students with the background knowledge needed to perform and interpret laboratory techniques commonly used in veterinary practice. Topics include: Homeostatic relationships, cytology, histology, parisitology and clinical physiology of major body systems. Includes a discussion of common disorders affecting major body systems and the techniques used for diagnosis. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in ANSC 142 and 142L.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "151L",
    "course_title": "Clinical Laboratory Techniques Lab",
    "course_desc": "Laboratory to accompany ANSC 151. Provides students with the knowledge and skills necessary to perform common veterinary lab tests including urinalysis, hematology, blood chemistry, cytology and parasitology. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in ANSC 142 and ANSC 142L.; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 152,
    "course_title": "Companion Animal Diseases and Nutrition",
    "course_desc": "An introduction to the common diseases and medical care of companion animals. Topics include identification, clinical signs and symptoms, and treatment of diseases affecting companion animals. This course is intended for students entering veterinary technology or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses."
  },
  {
    "course_prefix": "ANSC",
    "course_number": 153,
    "course_title": "Companion Animal Nursing and Nutrition",
    "course_desc": "An introduction to the husbandry and medical care of companion animals. Topics include: safe animal handling techniques, medical records and obtaining patient information, nursing tasks such as bandaging, administering medications, and sample collection. This class also discusses nutritional requirements of dogs and cats in all life stages and toxic substances. This course is intended for students entering veterinary technology, veterinary assisting, or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade “C” or better in ANSC 142 and in ANSC 142L.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "153L",
    "course_title": "Companion Animal Nursing Lab",
    "course_desc": "This course provides students with hands-on training in basic companion-animal exam and nursing skills. Topics include: animal restraint methods, medical charting and patient exam procedures, specimen collection, administration of medications, grooming and husbandry. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade “C” or better in ANSC 142 and ANSC 142L.; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 190,
    "course_title": "Veterinary Clinical Practices and Internship I",
    "course_desc": "Practical animal experience at veterinary clinics, zoos, research labs or other animal facilities. Topics covered may include restraint procedures, veinipuncture, vital signs assessment, radiological techniques, veterinary business and front-office procedures, routine nursing care and animal husbandry. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields. Students participating in ANSC 190 are required to show proof of current health insurance and obtain a professional liability policy through their internship supervisor.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses."
  },
  {
    "course_prefix": "ANSC",
    "course_number": 191,
    "course_title": "Veterinary Office and Computer Skills",
    "course_desc": "Veterinary Office and Computer Skills covers the support skills needed in a veterinary office. Because veterinary office skills are critical in the success or failure of a practice, this course will emphasize the following: client communication, public relations, ethical and legal procedures, bookkeeping functions, scheduling, records management, and telephone skills. Students will be introduced to one or more industry-standard veterinary software programs as well as word processing and spreadsheet software.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Registration in or a grade “C” or better in ANSC 142 and ANSC 142L. Credit for or placement in ENG 100 and MATH 101. Confirmed attendance to Windward CC veterinary technology information session.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 252,
    "course_title": "Diagnostic Imaging for Veterinary Technicians",
    "course_desc": "This course covers the nature and use of x-ray technology in veterinary technology. Students are also given an overview of alternative imaging techniques (ultrasound, CT scans, and digital radiography), as well as an introduction to the radiography of large animals and exotics.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "252L",
    "course_title": "Diagnostic Imaging for Veterinary Technicians Lab",
    "course_desc": "This lab trains students to safely and effectively use x-ray technology to obtain diagnostic radiographs of the skeletal- and soft anatomy of companion animals.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 253,
    "course_title": "Applied Pharmacology for Veterinary Technicians",
    "course_desc": "This course is designed to give students a practical knowledge of drugs used in veterinary medicine. Topics include drug classification, methods of action, calculations, administration, effects and side effects. Also includes a discussion of client education, drug safety, and federal regulations governing the purchase and storage of controlled drugs. Upon successful completion, students will be able to properly calculate, dispense, and administer medications, recognize adverse reactions and maintain pharmaceutical inventory and administrative records. This course is intended for students entering veterinary technology, veterinary assisting, or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 258,
    "course_title": "Clinical Laboratory Techniques II",
    "course_desc": "A continuation of ANSC 151& 151L, this course provides students with additional instruction and hands-on experience with laboratory tests commonly used in veterinary practice. Topics include: 1) identification of internal parasites, 2) performance and evaluation of microbiologic and serologic tests, 3) collection & evaluation of cytological samples, 4) veterinary necropsy procedures. Included in this course is a review of the anatomy and physiology of major body systems and an overview of common diseases seen in veterinary practice. This course is intended for students entering veterinary assisting, veterinary technology or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "258L",
    "course_title": "Clinical Laboratory Techniques II Lab",
    "course_desc": "A continuation of ANSC 151 and 151L, this course provides students with additional instruction and hands-on experience with laboratory tests commonly used in veterinary practice. Topics include: 1) identification of internal parasites 2) performance and evaluation of microbiologic and serologic tests, 3) collection & evaluation of cytological samples 4) veterinary necropsy procedures. Included in this course is a review of the anatomy and physiology of major body systems and an overview of common diseases seen in veterinary practice. This course is intended for students entering veterinary assisting, veterinary technology or other animal-related fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 261,
    "course_title": "Anesthesiology and Dentistry for Veterinary Technicians",
    "course_desc": "This course will focus on dental anatomy, common dental diseases, and basic dental procedures. Topics will include proper charting, routine periodontal care, anesthesia, patient monitoring, analgesia, post-op concerns, and homecare for clients. Dental equipment and instruments will be reviewed in preparation for the concurrent lab (ANSC 261L).",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "261L",
    "course_title": "Anesthesiology and Veterinary Dentistry for Veterinary Technicians Lab",
    "course_desc": "This course will focus on the clinical skills necessary for safe and effective anesthesia and dental prophylaxis of companion animal patients (dogs and cats). Skills such as intravenous catheter placement, endotracheal intubation, patient preparation and monitoring, and dental prophylaxis under general anesthesia will be stressed. The use and side effects of commonly used sedatives, analgesics and anesthetics will be covered. Postoperative procedures include patient monitoring and charting as well as client education for postoperative care.",
    "num_units": 2,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lab Hours: 6"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 262,
    "course_title": "Clinical Procedures for Large Animals",
    "course_desc": "The student will learn techniques in large animal restraint, husbandry and clinical procedures and be provided some introduction to relevant large animal diseases. Biosecurity and public health will be discussed as they apply to large animal health care and husbandry. The course is appropriate for those entering animal husbandry, veterinary assisting, veterinary technology or animal science fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "262L",
    "course_title": "Clinical Procedures for Large Animals Lab",
    "course_desc": "The student will learn techniques in large animal restraint, husbandry and clinical procedures and be provided some introduction to relevant large animal diseases. Biosecurity and public health will be discussed as they apply to large animal health care and husbandry. The course is appropriate for those entering animal husbandry, veterinary assisting, veterinary technology or animal science fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 263,
    "course_title": "Exotic and Laboratory Animal Procedures",
    "course_desc": "Introduction to the husbandry, care and use of exotics and laboratory animals. Includes discussion in common diseases, biosecurity, and public health as they apply to a wide variety of species, including those found in Hawaii and beyond. This course is intended for students entering lab animal medicine, veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": "263L",
    "course_title": "Exotic and Laboratory Animal Procedures Lab",
    "course_desc": "Laboratory to accompany ANSC 263. Provides student training in restraint and handling, health assessment, and nursing skills of exotic and laboratory animal species. This course is intended for students entering lab animal medicine, veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses.; Lab Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 266,
    "course_title": "Veterinary Clinical Practices & Internship II",
    "course_desc": "A continuation of ANSC 190, this course provides veterinary technology students with additional practical experience in a clinical setting. Topics covered include: advanced sample collection & handling techniques, dentistry, administration of medications, anesthesiology & surgical assisting, and advanced nursing techniques. Emphasis is placed on integrating classroom learning with practical work experience.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses."
  },
  {
    "course_prefix": "ANSC",
    "course_number": 271,
    "course_title": "Anesthesiology and Surgical Nursing for Veterinary Technicians",
    "course_desc": "This course will focus on the clinical skills necessary for safe and effective anesthesia and surgery of companion animal patients (dogs and cats). Skills such as intravenous catheter placement, proper endotracheal intubation, patient and surgical site preparation, and patient monitoring under general anesthesia will be stressed. The use and side effects of commonly used sedatives, analgesics and anesthetics will be covered. Postoperative procedures include patient monitoring and charting as well as client education for postoperative care.",
    "num_units": 3,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lecture Hours: 3"
  },
  {
    "course_prefix": "ANSC",
    "course_number": 290,
    "course_title": "Veterinary Technician Exam Review",
    "course_desc": "This course prepares students for the Veterinary Technician National Exam (VTNE). Topics include test-taking strategies, formation of a study plan, and a review of topics from previous veterinary technology courses. Students enrolled in this course will develop essential test-taking skills by completing practice exams covering all major topics of the Windward CC veterinary technology curriculum.",
    "num_units": 1,
    "dept_name": "ANSC",
    "inst_ipeds": 141990,
    "metadata": "Pre: Admission in the Veterinary Technology Program and a grade of “C” or better in all completed ANSC courses; Lecture Hours: 1"
  },
  {
    "course_prefix": "ANTH",
    "course_number": 151,
    "course_title": "Emerging Humanity",
    "course_desc": "This course is an introduction to human biological evolution and the archaeology of culture in the world prior to AD 1500.",
    "num_units": 3,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ANTH",
    "course_number": 152,
    "course_title": "Culture and Humanity",
    "course_desc": "Introduction to cultural anthropology. This course explores how humans create, understand, order and modify their natural, social, supernatural and physical environments, and make meaning and order.",
    "num_units": 3,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ANTH",
    "course_number": 175,
    "course_title": "Polynesian Surf Culture",
    "course_desc": "Provides students with an understanding of surf culture in the Pacific Basin. Environmental and cultural factors are assessed in relation to surfing’s development in Polynesia, integration into Hawaiian culture, decline due to Western influence, and revitalization as a modern recreational activity. The modern surfing industry is also assessed through a cultural perspective that analyzes business practices utilized by surfing organizations today.",
    "num_units": 3,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ANTH",
    "course_number": "175L",
    "course_title": "Surf Culture Field Lab",
    "course_desc": "Complements the lecture materials presented in the ANTH 175. Provides students with an understanding of surf culture in the Pacific Basin using O‘ahu as a model for understanding ancient and modern surfing culture in Hawai‘i. Field activities include surfing demonstrations and instruction, opportunities to speak with local cultural informants, and fieldtrips to various museums to learn about Hawai‘i’s surfing heritage. A coastal tour of O‘ahu will be made to study the history of several major surf breaks.",
    "num_units": 1,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in ANTH 175.; Lab Hours: 3"
  },
  {
    "course_prefix": "ANTH",
    "course_number": 210,
    "course_title": "Archaeology",
    "course_desc": "This course is an introduction to prehistoric archaeology providing a overview of methods and techniques of excavation and laboratory analysis and a brief survey of theory in relation to change and diversity in prehistoric human groups.",
    "num_units": 3,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ANTH",
    "course_number": 296,
    "course_title": "Special Topics in Anthropology",
    "course_desc": "Students will investigate important topics, issues, or subfields within the discipline of Anthropology. May be repeated up to 9 credits with different topics.",
    "num_units": 3,
    "dept_name": "Anthropology",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in ANTH 151 or ANTH 152; Lecture Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": 106,
    "course_title": "Small Scale Aquaculture",
    "course_desc": "Survey of possibilities of small scale aquaculture. Application of basic biological and ecological concepts and theories to the selection, planning and design of small scale aquaculture systems.",
    "num_units": 3,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": "106L",
    "course_title": "Small Scale Aquaculture Laboratory",
    "course_desc": "Companion laboratory to AQUA 106, Small Scale Aquaculture. Practical, hands-on experiences in small scale aquaculture. Laboratory/field trip class.",
    "num_units": 1,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in AQUA 106.; Lab Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": 110,
    "course_title": "Introduction to Algae Cultivation",
    "course_desc": "An introduction to algal biology and sustainable cultivation for both limu (macroalgae) and microalgae. Students are introduced to water and nutrient cycling, water testing methods, algae anatomy and chemical structure as they relate to potential products from algae. Student will engage in a deep dive into photosystems and photosynthesis is also provided. In addition, a practical focus on water pumping and filtration systems, carpentry and plumbing will be taught.",
    "num_units": 3,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": "110L",
    "course_title": "Introduction to Algae Cultivation Lab",
    "course_desc": "An introduction to algal biology and sustainable cultivation. Students are introduced to media preparation, sterile technique, culture inoculation, and microscopy through hands on instruction/experiential learning activities. Students scale-up from isolated strains to 10-liter photobioreactors. Standard monitoring equipment is also introduced for the analysis of water and media chemistry, monitoring algal growth rates, and troubleshooting. Data collection, record keeping, and safety are emphasized throughout the course. If possible, students will be exposed to algae cultivation facilities in operation.",
    "num_units": 1,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better or registration in AQUA 110.; Lab Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": 201,
    "course_title": "The Hawai‘i Fishpond",
    "course_desc": "An introduction into the history, development, biology and ecology, management, restoration, and future of Hawaiian fishponds. This course will study traditional Hawaiian fishponds, merging traditional knowledge with the principles of modern Western science.",
    "num_units": 3,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "AQUA",
    "course_number": "201L",
    "course_title": "The Hawai‘i Fishpond Lab",
    "course_desc": "An introduction into the history, development, biology and ecology, management, restoration, and future of Hawaiian fishponds. This course will study traditional Hawaiian fishponds, merging traditional knowledge with the principles of modern Western science.",
    "num_units": 1,
    "dept_name": "Aquaculture",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in AQUA 201 or consent of instructor.; Lab Hours: 3"
  },
  {
    "course_prefix": "ART",
    "course_number": 101,
    "course_title": "Introduction to the Visual Arts",
    "course_desc": "Art101 is an introductory course that focuses on the question “What is the nature of visual art?” and the forms and conditions under which art is expressed. Projects will be required. Independent field trips to art galleries may be required.",
    "num_units": 3,
    "dept_name": "Art",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ART",
    "course_number": "104D",
    "course_title": "Introduction to Printmaking/Screen Printing",
    "course_desc": "Studio experience mainly for non-majors. An introduction to printmaking providing experience in the development of skills used in designing for screen printing on paper. Includes skill in photo screening. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "Art",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": "105B",
    "course_title": "Introduction to Ceramics–handbuilding",
    "course_desc": "Studio experience mainly for no majors. An introduction to clay as an art medium. Emphasis on basic handbuilding techniques, three-dimensional concepts in clay, glazing, decorating and firing kilns. NOTE: Art Majors: ART 105B and ART 105C must both be taken to receive equivalency at UH Mānoa as an art elective. Liberal Arts Students: ART 105B or ART 105C will transfer to fulfill the Humanities DA core requirements.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": "105C",
    "course_title": "Introduction to Ceramics–wheelthrowing",
    "course_desc": "Studio experience mainly for non-majors. Introduction to the potter’s wheel. Emphasis on techniques of forming basic wheelthrown shapes on the electric or kick wheel. Emphasis also on decorating, glazing, and firing of ceramic pieces. NOTE: Art Majors: ART 105B and ART 105C must both be taken to receive equivalency at UH Mānoa as an art elective. Liberal Arts Students: ART 105B or ART 105C will transfer to fulfill the Humanities DA core requirements.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 107,
    "course_title": "Introduction to Photography",
    "course_desc": "Studio experience mainly for non-majors. An introduction to black and white photography emphasizing a variety of picture-making techniques. Student must have film camera with adjustable shutter speeds and aperture settings.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": "107D",
    "course_title": "Intro to Digital Photography",
    "course_desc": "ART 107D is an introduction to digital photography using digital cameras and basic image editing software that emphasizes a variety of picture-making techniques, including the technical and aesthetic considerations needed for artistic expression and entry into photographic professions or the digital media workplace. Examines the broad functions of digital photography within contemporary society and cultivates understanding in the language of image making, equally relevant for both makers and consumers. Student must have access to a digital camera with manual control over shutter speeds and aperture settings. Studio experience for Art majors and non-majors.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Student must have access to a digital camera with manual control over shutter speeds and aperture settings."
  },
  {
    "course_prefix": "ART",
    "course_number": 108,
    "course_title": "Elementary Studio: Drawing and Painting",
    "course_desc": "Art 108 is a studio course, which includes drawing and an introduction to acrylic painting techniques, with an emphasis on acrylic painting. Course content will also emphasize composition and color theory. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 111,
    "course_title": "Introduction to Watercolor Painting",
    "course_desc": "Art 111 is an introduction to watercolor painting materials and techniques. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 112,
    "course_title": "Introduction to Digital Art",
    "course_desc": "ART 112 is a studio introduction to digital technology and its applications to the production of visual art. Emphasis will also be placed on developing an aesthetic criteria for evaluation.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 113,
    "course_title": "Introduction to Drawing",
    "course_desc": "Art113 is an introduction to the materials and techniques of drawing, focusing online drawing, rendering, and the use of perspective. This course will include the study of the drawings of old and modern masters. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 114,
    "course_title": "Introduction to Color",
    "course_desc": "Art 114 is an introductory course focusing on color theory and the application of color as related to studio art practice.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 115,
    "course_title": "Introduction to 2D Design",
    "course_desc": "Art 115 is an introductory course, which focuses on the basic design concepts, elements and principles of art. This course emphasizes projects in basic two-dimensional design.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: ART 101"
  },
  {
    "course_prefix": "ART",
    "course_number": 116,
    "course_title": "Introduction to Three-Dimensional Composition",
    "course_desc": "Focuses on building three-dimensional structures and basic sculptural forms using various approaches and materials, as well as the designing of creative environments. The student’s awareness of the natural order and the aesthetic aspect of design is broadened and the student learns the use of texture, volume, color, temperature, proportion, space, time and movement in a three-dimensional form.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 123,
    "course_title": "Introduction to Oil Painting",
    "course_desc": "Art 123 is an introduction to the materials and techniques of oil painting. Classical painting techniques will be emphasized. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: ART 101, 113 and 114"
  },
  {
    "course_prefix": "ART",
    "course_number": 126,
    "course_title": "3D Computer Graphics I",
    "course_desc": "This course explores introductory level conceptual and technical topics in 3D computer graphics. Autodesk Maya and related applications will be utilized to develop projects which integrate 3D modeling, UV layout, texture mapping, lighting, and rendering. (Cross-listed as CM 126)",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in ART 112 or consent of instructor."
  },
  {
    "course_prefix": "ART",
    "course_number": 131,
    "course_title": "Introduction to Fused Glass",
    "course_desc": "Introduction to expressive explorations in the use of kiln-formed, fusible-sheet glasses and enameling on glass.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 175,
    "course_title": "Survey of Global Art",
    "course_desc": "Art produced in Asia, Africa, Native America, Europe, and the Pacific Islands, from prehistory to the 15th century. Religious and philosophical ideas expressed in architecture, painting, prints, sculpture, applied art, body art, and textiles.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ART",
    "course_number": 176,
    "course_title": "Survey of Global Art II",
    "course_desc": "Art produced in Asia, Africa, Native America, Europe, and the Pacific Islands, from the 15th century to the present. Religious and philosophical ideas expressed in architecture, painting, prints, sculpture, applied art, body art, and textiles.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ART",
    "course_number": 189,
    "course_title": "Introduction to Hawaiian Art",
    "course_desc": "An integrated beginning studio art course, which offers students the opportunity to understand and express Hawaiian cultural perspective through contemporary visual arts activities.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 202,
    "course_title": "Introduction to Digital Imaging",
    "course_desc": "Combined theory and practice examining major techniques, concepts, and aesthetics in contemporary digital image production. Direct studio experience in essential software, printing techniques and hardware necessary in producing the gallery quality inkjet print.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 207,
    "course_title": "Intermediate Photography: Black and White",
    "course_desc": "Basic techniques and aesthetics of black and white photography; the camera as a tool for communication and self expression. Student must have a film camera with adjustable shutter speeds and aperture settings. Up to 6 credits applicable toward A.A. degree.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 208,
    "course_title": "Intermediate Photography: Color Studio",
    "course_desc": "Color in photography emphasizing communication and self-expression. Lectures, demonstrations and projects. Student must have film camera with adjustable shutter speeds and aperture settings.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 101 and 107, or consent of instructor."
  },
  {
    "course_prefix": "ART",
    "course_number": 213,
    "course_title": "Intermediate Drawing",
    "course_desc": "Art 213 is a continuation and development of drawing ideas and skills introduced in Art 113. A variety of materials, techniques and concepts are explored, particularly pertaining to drawing concepts unique to the 20th century. Portraiture will also be introduced. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 214,
    "course_title": "Introduction to Life Drawing",
    "course_desc": "Art 214 is an introductory figure drawing course. Anatomical construction, light, space, diagrammatic analysis, and thematic content will be studied through the drawing process. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 113 or consent of instructor."
  },
  {
    "course_prefix": "ART",
    "course_number": 220,
    "course_title": "The Windward Atelier (AKA Atelier Hawai‘i) Intensive Study in Drawing and Painting",
    "course_desc": "Art 220 is an intensive course of study in the classical techniques of drawing and painting. Cast drawing, portraiture and figure painting will be the focus of instruction. The Windward Atelier is designed primarily for those students who have some prior studio experience in drawing; however, students of all skill levels are welcome.",
    "num_units": 6,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 223,
    "course_title": "Intermediate Painting",
    "course_desc": "Survey of late 19th and early 20th century studio practice. Completion of paintings which concentrate on historical styles as well as on a more personal direction. May be repeated for up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 123 or consent of instructor."
  },
  {
    "course_prefix": "ART",
    "course_number": 224,
    "course_title": "Painting from Life",
    "course_desc": "Art 224 is a survey of the figurative tradition of painting, using the model as the primary subject matter. This course is an intensive studio experience of painting from the model. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 123 and 214, or consent of instructor."
  },
  {
    "course_prefix": "ART",
    "course_number": 243,
    "course_title": "Intermediate Ceramics–handbuilding",
    "course_desc": "Development of handbuilding techniques, sculptural and vessel concepts, and surface treatment and glazing. May be repeated up to 6 credits. NOTE: Art Majors: ART 243 and 244 must both be taken to receive equivalency at UH Mānoa as ART 242, Introduction to Ceramics.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 105B or consent of instructor"
  },
  {
    "course_prefix": "ART",
    "course_number": 244,
    "course_title": "Intermediate Ceramics–wheelthrowing",
    "course_desc": "Development of wheelthrowing techniques, vessel and structural concepts, and surface treatment and glazing. May be repeated up to 6 credits. NOTE: Art Majors: ART 243 and 244 must both be taken to receive equivalency at UH Mānoa as ART 242, Introduction to Ceramics.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ART 105C, or consent of instructor"
  },
  {
    "course_prefix": "ART",
    "course_number": 251,
    "course_title": "Mold Making for Ceramics and Sculpture",
    "course_desc": "ART 251 is an introduction to mold making techniques and their application in the creation of functional ceramics and sculptural objects. Emphasis on the fabrication of various types of plaster molds from original and “found” objects, pressing and casting forms from molds in clay and other non-metal media, and various finishing techniques including glazing and firing. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 253,
    "course_title": "Sculpture–Figure Modeling",
    "course_desc": "Modeling the human figure in clay, with emphasis on the basic skeletal structure and muscles in relation to surface modulation, proportion, volume and gesture. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": 260,
    "course_title": "Gallery Design and Management",
    "course_desc": "Design theory and techniques for presentation of artwork and mounting an exhibition. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ART",
    "course_number": "269V",
    "course_title": "Study Abroad (Designated Region, Variable Credit)",
    "course_desc": "An on-site study of the art/architecture of a designated location(s), using lectures and discussions and/or an art studio medium as a tool to analyze, understand and appreciate the development of this region’s art/architecture.",
    "num_units": "1-6",
    "dept_name": "ART",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ASTR",
    "course_number": 110,
    "course_title": "Survey of Astronomy",
    "course_desc": "Introduction to the astronomical universe for non-science students.",
    "num_units": 3,
    "dept_name": "Astronomy",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ASTR",
    "course_number": "110L",
    "course_title": "Survey of Astronomy Lab",
    "course_desc": "Demonstration of astronomical principles through laboratory observations and analysis of astronomical data. Not required for ASTR 110.",
    "num_units": 1,
    "dept_name": "Astronomy",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ASTR",
    "course_number": 130,
    "course_title": "Introduction to Archaeoastronomy",
    "course_desc": "Introduction to the interdisciplinary study of cultures and astronomy for non-science majors. Topics include naked-eye astronomy, myths and rituals, calendar systems, architectural alignments and navigation.",
    "num_units": 3,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": 170,
    "course_title": "Introduction to Rocketry",
    "course_desc": "This is a general introductory course to rocket science. Principles of propulsion, aerodynamics, and safety protocols for design and ground operations are stressed.",
    "num_units": 3,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": 180,
    "course_title": "Planetary Astronomy",
    "course_desc": "A survey of modern solar system astronomy with emphasis on the underlying physical principles. Topics discussed include the celestial sphere and aspects of the night sky, the structure and evolution of the Sun’s planetary system, comparative planetology, and theories of the formation of planetary systems. Intended for science majors and prospective science teachers.",
    "num_units": 3,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Pre: The student should have a good operational familiarity with high school algebra.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": 181,
    "course_title": "Stellar Astronomy",
    "course_desc": "A survey of modern stellar, galactic, and extragalactic astronomy, with emphasis on the underlying physical principles. Topics covered include stellar structure, interstellar environments and the formation of stars, stellar evolution and death, the structures of galaxies, and cosmology. Intended for science majors and prospective science teachers.",
    "num_units": 3,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Pre: The student should have a good operational familiarity with high school algebra; credit in ASTR 110 and/or ASTR 180.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": 250,
    "course_title": "Observational Astronomy",
    "course_desc": "An introduction to the tools and techniques of observational astronomy: astronomical time and coordinate systems, photometric systems and magnitudes, principles of telescopes and their operation, introduction to modern astronomical instruments, analysis of astronomical data. Includes planetary, solar and stellar observations.",
    "num_units": 3,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ASTR 110; or ASTR 180 and ASTR 181; Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": "250L",
    "course_title": "Observational Astronomy Lab",
    "course_desc": "A lab course in modern observational astronomy, with emphasis on “hands-on” use of instruments to acquire data with research-grade telescopes at the college’s Lanihuli Observatory. Remote telescope observations may also be used. Students will gain on-site observing experience with CCD photometry and spectroscopy through direct acquisition and data analysis using modern laboratory data reduction software. Applications to planetary, solar, stellar and, where possible, galactic astrophysics will be covered.",
    "num_units": 1,
    "dept_name": "ASTR",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit or current enrollment in ASTR 250; Lab Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": 281,
    "course_title": "Space Explorations",
    "course_desc": "Current topics in planetary exploration, extraterrestrial life, and space resources and colonization.",
    "num_units": 3,
    "dept_name": "Astronomy",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ASTR 110 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ASTR",
    "course_number": "294V",
    "course_title": "Special Topics in Astronomy",
    "course_desc": "This course covers current topics in astronomy. The course is designed to have variable credit to coincide with the rigor of the topic. May be repeated up to 8 credits with different topics. A course description will be presented in the schedule of classes.",
    "num_units": "1-4",
    "dept_name": "Astronomy",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ASTR 110 or consent of instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "ATMO",
    "course_number": 101,
    "course_title": "Introduction to Weather and Climate",
    "course_desc": "Introductory (DP) Diversification Physical Science course for all undergraduates in any major. A non-mathematical introduction to basic atmospheric variables, Earth’s past climates, global warming, air pollution, El Nino, hurricanes, tornadoes, and forecasting weather in Hawai’i.",
    "num_units": 3,
    "dept_name": "Atmospheric Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOC",
    "course_number": 106,
    "course_title": "Ono Cooking and Food Science",
    "course_desc": "This course is designed to integrate the science of food with the chemical, physical, and biological nature of food. It will incorporate Hawaiian resources and sustainability. The overall goal of this course is to enhance students’ understanding of the science of food using the home kitchen to demonstrate the principles of chemistry, biology, and physics of food through videos, meetings, inquiry-based activities, and a student-designed research project.",
    "num_units": 3,
    "dept_name": "Biochemistry",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOC",
    "course_number": "106L",
    "course_title": "Ono Cooking and Food Science Laboratory",
    "course_desc": "This laboratory course is designed to illustrate fundamental techniques in the chemical, physical, and biological nature of food through experimentation. It will incorporate Hawaiian resources and sustainability. The overall goal of this course is to enhance students’ understanding of the science of food.",
    "num_units": 1,
    "dept_name": "Biochemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better or registration in BIOC 106.; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOC",
    "course_number": 141,
    "course_title": "Fundamentals of Biochemistry",
    "course_desc": "Biological chemistry focusing on the integration of concepts from general, inorganic, and biochemistry and their application to living systems. Satisfies the one-semester chemistry requirement for pre-nursing and pre-dental hygiene majors.",
    "num_units": 3,
    "dept_name": "Biochemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in MATH 25, 26, 28, 29, 75X or higher.; Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 100,
    "course_title": "Human Biology",
    "course_desc": "Introduction to structure and functions of cells, tissues, organs, and systems of the human body. Topics related to physical fitness, nutrition, health, and disease. Not intended for science majors. Students who have received credit for or are currently enrolled in ZOOL 101 may not receive credit for BIOL 100.",
    "num_units": 3,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "100L",
    "course_title": "Human Biology Laboratory",
    "course_desc": "Laboratory to accompany BIOL100 (Human Biology). Emphasizes the application of the scientific method, basic laboratory methods and procedures in biology, and facts and principles of human anatomy and physiology.",
    "num_units": 1,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BIOL 100 or equivalent preparation or consent of instructor.; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 101,
    "course_title": "Biology and Society",
    "course_desc": "BIOL 101 introduces students to the process of science through the biological sciences including the historical development of scientific concepts and the interaction of society with science. BIOL 101 is primarily designed to serve non-science majors and presents a broad survey of biology with special emphasis on its relevance in our everyday lives.",
    "num_units": 3,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "101L",
    "course_title": "Biology and Society Lab",
    "course_desc": "BIOL 101L is a laboratory to accompany BIOL 101 Biology and Society. The course includes laboratory and computer exercises, field trips and research projects to explore questions in biology.",
    "num_units": 1,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or concurrent enrollment in BIOL 101.; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 124,
    "course_title": "Environment and Ecology",
    "course_desc": "A study of human ecology through the analysis of the interrelationships between science and technology, the means these provide for manipulation of environment and the effects of this manipulation on the environment and on human populations. Lecture/field trip course designed for non-science majors.",
    "num_units": 3,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "124L",
    "course_title": "Environment and Ecology Lab",
    "course_desc": "Companion laboratory class to BIOL 124, Environment and Ecology. This class, providing hands-on experience in the laboratory and in the field, enhances the student’s understanding of basic environmental science and ecological concepts presented in BIOL 124.",
    "num_units": 1,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BIOL 124 or consent of instructor; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 171,
    "course_title": "Introduction to Biology I",
    "course_desc": "First semester of introductory biology for all life science majors. Topics include: Overview of the science of biology; Cell structure, chemistry, growth, and reproduction; Classical, chromosomal and molecular genetics; Evolution, phylogeny and systematics; and Biology and diversity of viruses and bacteria.",
    "num_units": 3,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "171L",
    "course_title": "Introduction to Biology I Lab",
    "course_desc": "Laboratory to accompany BIOL 171.",
    "num_units": 1,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BIOL 171; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 172,
    "course_title": "Introduction to Biology II",
    "course_desc": "Continuation of BIOL 171. Topics include: Origin of eukaryotic organisms, their general characteristics, life cycles, systematics and evolution; Anatomy, physiology and classification of higher plants; Anatomy, physiology, behavior and classification of animals; and Basic ecological principles.",
    "num_units": 3,
    "dept_name": "Biology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for BIOL 171; Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "172L",
    "course_title": "Introduction to Biology II Lab",
    "course_desc": "Laboratory to accompany BIOL 172.",
    "num_units": 1,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 200,
    "course_title": "Coral Reefs",
    "course_desc": "Introduction to the biology, ecology and geology of stony corals and the reef structures they build. Topics include, but not limited to, the following: photobiology, biochemistry, physiology, reproduction, ecology, biogeography and evolution of stony corals; contributions made by other members of the coral reef community, such as algae, invertebrates, fish, sea turtles, sea birds, and marine mammals; reef formation and geomorphology; corals as resources for human utilization and the impacts of human activities upon reefs throughout the world. Emphasis will be on Hawai‘i’s coral reefs, but comparisons will be made among reefs from other areas.",
    "num_units": 3,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "200L",
    "course_title": "Coral Reef Laboratory and Field Studies",
    "course_desc": "Laboratory and field studies of the biology, ecology, and geology of stony corals and the reef structures they build; companion course to BIOL 200.",
    "num_units": 1,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BIOL 200 or consent of instructor; Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 265,
    "course_title": "Ecology and Evolutionary Biology",
    "course_desc": "Principles of ecology and evolution for life science majors stressing integrated approach and recent advance.",
    "num_units": 3,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for BIOL 171/171L and 172/172L; or one year of introductory college biology plus labs; or equivalent preparation; or consent of the instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "265L",
    "course_title": "Ecology and Evolutionary Biology Lab",
    "course_desc": "Laboratory to accompany BIOL 265.",
    "num_units": 1,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Lab Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": 275,
    "course_title": "Cell and Molecular Biology",
    "course_desc": "Integrated cell and molecular biology for life science majors. Modern advances in recombinant DNA technology.",
    "num_units": 3,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in BIOL171/171L and CHEM 272/272L or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "BIOL",
    "course_number": "275L",
    "course_title": "Cell and Molecular Biology Lab",
    "course_desc": "Laboratory for cell and molecular biology.",
    "num_units": 1,
    "dept_name": "BIOL",
    "inst_ipeds": 141990,
    "metadata": "Lab Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 101,
    "course_title": "General Botany",
    "course_desc": "Introduction to plant structure, function, reproduction, and evolution; plants in relation to the environment and human activities. Lecture course.",
    "num_units": 3,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": "101L",
    "course_title": "General Botany Lab",
    "course_desc": "Lab observations and experiments illustrating basic principles of plant biology.",
    "num_units": 1,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BOT 101; Lab Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 105,
    "course_title": "Ethnobotany",
    "course_desc": "The scientific study of the interaction between human culture and plants, including the interrelationship of botany, socio-economics, belief systems and history that have shaped the cultural uses of plants in Hawai‘i, as well as Asia or the Pacific. Lecture/field trip course with service-learning option.",
    "num_units": 3,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 111,
    "course_title": "Introduction to Algae",
    "course_desc": "This course will cover what algae are, why they are important, and why we are interested in them for both their environmental benefit, as well as their use for products. Students will explore the vast diversity of algae including the characteristics and applications of some of the main types of algae that are in commercial use today. Students will learn about algal ecology and how interactions with the environment, including pest and predators, affect algal productivity. Students will examine the processes of algae bio-manufacturing including production processes, as well as some of the products, benefits, and challenges that impact our ability to make commercially viable products from algae. Repeatable up to 6 credits.",
    "num_units": 3,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 130,
    "course_title": "Plants in the Hawaiian Environment",
    "course_desc": "Introduction to the evolution of plant communities and species of Hawaiian ecosystems; ecological interactions; observations, identification and systematics of native and introduced flora.",
    "num_units": 3,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BOT 130L; Lecture Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": "130L",
    "course_title": "Plants in the Hawaiian Environment Lab",
    "course_desc": "BOT 130L focuses on observations of Native Hawaiian plant species, populations and communities as they interact in the natural environment and studies the unique characteristics of the plants through lab observations.",
    "num_units": 1,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BOT 130; Lab Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 160,
    "course_title": "IdentiPcation of Tropical Plants",
    "course_desc": "Nontechnical course in identification of common plants of tropics, including native and introduced flora.",
    "num_units": 3,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": "192V",
    "course_title": "Special Topics in Plant Science",
    "course_desc": "Topics from diverse fields in plant science, and chosen by the Instructor. Course content may vary. May be repeated.",
    "num_units": "1-4",
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "BOT",
    "course_number": 199,
    "course_title": "Independent Study",
    "course_desc": "Supervised research or study in a chosen area of botany.  Specific topics and workload are determined in consultation with the instructor.",
    "num_units": "2-3",
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 0"
  },
  {
    "course_prefix": "BOT",
    "course_number": 205,
    "course_title": "Ethnobotanical Pharmacognosy",
    "course_desc": "A study of medicinal plants of Hawai‘i, their characteristics, plant extraction, isolation and identification of their chemical constituents for possible uses in pharmaceuticals or in their natural state, and bioproduct manufacturing. This course is designed to train students for careers in plant and medical biotechnology. Lecture and laboratory/fieldtrip course.",
    "num_units": 4,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in any of these courses: BOT 101, BOT 105, BOT 130, MICR 130, MICR 140, BIOL 172/172L, CHEM 152/152L or consent of instructor.; Lecture Hours: 3; Lab Hours: 3"
  },
  {
    "course_prefix": "BOT",
    "course_number": 210,
    "course_title": "Phytobiotechnology",
    "course_desc": "Introduction to practical aspects of Plant Biotechnology. Topics include micropropagation techniques, such as plant tissue, cell and protoplast cultures: DNA-based technologies, such as DNA extraction, DNA sequencing, PCR; and methods of plant genetic engineering. This course is designed to train students for careers in advanced agriculture technology and industry.",
    "num_units": 4,
    "dept_name": "Botany",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in BOT 101, or AG 152, or MICR 130 and MICR 140, or BIOL 171 and 171L. Placement into MATH 100 or higher.; Lecture Hours: 3; Lab Hours: 3"
  },
  {
    "course_prefix": "BUS",
    "course_number": 120,
    "course_title": "Principles of Business",
    "course_desc": "Surveys the fundamentals of the American business enterprise. Examines the foundations and responsibilities of accounting, business, management, finance, marketing, and the business environment.",
    "num_units": 3,
    "dept_name": "Business",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BUS",
    "course_number": 122,
    "course_title": "Introduction to Entrepreneurship",
    "course_desc": "This course covers the basic economic and business principles regarding small-scale business enterprises. Focusing on the creation of a business plan, topics include researching and evaluating resources, planning, marketing, cultivating money resources, and understanding key concepts in law, budgeting, financial statements, and business documentation.",
    "num_units": 3,
    "dept_name": "Business",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BUS",
    "course_number": "122B",
    "course_title": "Introduction to Entrepreneurship: Sustainable Agriculture",
    "course_desc": "This course is a specialized section of Introduction to Entrepreneurship that focuses on sustainable agriculture. The course will cover the basic economic and business principles regarding small-scale business enterprises connected to agriculture, with a particular focus on sustainable agriculture in Hawai‘i. With a focus on the creation of a business plan, topics include researching and evaluating resources, planning, marketing, cultivating money resources, and understanding key concepts in law, budgeting, financial statements, and business documentation.",
    "num_units": 3,
    "dept_name": "Business",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "BUS",
    "course_number": 123,
    "course_title": "Small Business Marketing",
    "course_desc": "This course will complement Windward CC's BUS 120 Introduction to Marketing course by allowing students to further develop the marketing plan section of the overall business plan that is created in BUS 120. This course will explore the sociological aspects of media and marketing; how psychology affects marketing; the effectiveness of different business structures; organizational behavior and psychology; and the economic impacts and influences of marketing/advertising.",
    "num_units": 3,
    "dept_name": "Business",
    "inst_ipeds": 141990,
    "metadata": "Pre: BUS 120 and Placement into ENG 100W; Lecture Hours: 3"
  },
  {
    "course_prefix": "BLAW",
    "course_number": 200,
    "course_title": "Legal Environment of Business",
    "course_desc": "Introduction to the legal environment of business operations with particular attention to business law and ethics and to principles of law relating to contracts, agency, partnerships, and corporations.",
    "num_units": 3,
    "dept_name": "Business",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or higher in ENG 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "BUSN",
    "course_number": 121,
    "course_title": "Introduction to Word Processing",
    "course_desc": "The course covers proper keyboarding techniques; word processing concepts (Microsoft® Word); and document formatting of letters, memos, tables, reports, and email. Basic file management and operating system functions are included. Keyboarding speed and accuracy are emphasized.",
    "num_units": 3,
    "dept_name": "Business Technology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ENG 23 or higher; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 100,
    "course_title": "Chemistry and Society",
    "course_desc": "Introduction to chemistry for non-science majors. Discussion of basic chemistry concepts and their application to everyday life. Provides a survey of basic concepts and applications of chemistry with emphasis on the role of chemistry in the real world. This is suitable for students who have little or no background in chemistry and serves to fulfill a general education physical science core course for the nonscience major or as a preparatory course for CHEM 151 or BIOC 141.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "100L",
    "course_title": "Chemistry and Society Lab",
    "course_desc": "Experiments in everyday chemistry.",
    "num_units": 1,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in CHEM 100.; Lab Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 151,
    "course_title": "Elementary Survey of Chemistry",
    "course_desc": "Provides the student with an adequate background in the fundamentals of chemistry. Covers the basic language and quantitative relationships of chemistry, including atomic structure, chemical bonding, structure-property relationships, chemical reactions. Prerequisite to CHEM 152 for majors in medical technology and nursing and other allied health and science-related fields, or can be taken as a preparatory course for CHEM 161.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit in MATH 24, 25, 26, 28, 29, 75X or higher, and placement in ENG 23 or higher.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "151L",
    "course_title": "Elementary Survey of Chemistry Lab",
    "course_desc": "Experiments introducing laboratory techniques and illustrating chemical principles; supplemented by films, demonstrations, and problem sessions.",
    "num_units": 1,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in CHEM 151.; Lab Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 152,
    "course_title": "Survey of Organic and Bioorganic Chemistry",
    "course_desc": "Structure, nomenclature, properties and reactions of organic compounds will be studied with emphasis on those compounds of practical importance in life science and related fields.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for CHEM 151 or equivalent or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "152L",
    "course_title": "Survey of Organic and Bioorganic Chemistry Laboratory",
    "course_desc": "Techniques of preparation, purification, and identification of organic compounds.",
    "num_units": 1,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for CHEM 151L and credit for or registration in CHEM 152.; Lab Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 161,
    "course_title": "General Chemistry I",
    "course_desc": "Basic principles of inorganic chemistry with an emphasis on problem solving. First course of a two-course sequence designed to meet the one-year General Chemistry requirement for pre-med, science and engineering majors. Topics include chemical calculations, electronic structure, chemical bonding, states of matter and solutions.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in Math 103 or higher, or placement into Math 135 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "161L",
    "course_title": "General Chemistry I Lab",
    "course_desc": "Laboratory experiments illustrating fundamental principles of chemistry.",
    "num_units": 1,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in CHEM 161.; Lab Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 162,
    "course_title": "General Chemistry II",
    "course_desc": "Second course of a two-course sequence designed to meet the one-year General Chemistry requirement for pre-med, science and engineering majors. Topics include thermochemistry, kinetics, acid-base equilibrium, solubility equilibrium and electrochemistry. Emphasis on problem solving.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in CHEM 161, credit for or registration in MATH 135, or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "162L",
    "course_title": "General Chemistry II Lab",
    "course_desc": "Laboratory experiments illustrating fundamental principles of chemistry.",
    "num_units": 1,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in CHEM 162; Lab Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 272,
    "course_title": "Organic Chemistry I",
    "course_desc": "This is the first semester course in organic chemistry intended for science majors. Topics to be covered include structure, properties, nomenclature, reactions, reaction mechanisms, stereochemistry and spectroscopy of alkanes, alkenes, alkynes, alkyl halides, alcohols and their applications to biology.",
    "num_units": 3,
    "dept_name": "Chemistry",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in CHEM 162 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "272L",
    "course_title": "Organic Chemistry I Lab",
    "course_desc": "Laboratory principles of Organic Chemistry I, the first semester course in organic chemistry intended for science majors. Topics to be covered include structure, properties, nomenclature, reactions, reaction mechanisms, stereochemistry and spectroscopy of alkanes, alkenes, alkynes, alkyl halides, alcohols and their applications to biology.",
    "num_units": 2,
    "dept_name": "CHEM",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better or registration in CHEM 272 or consent of instructor.; Lab Hours: 5"
  },
  {
    "course_prefix": "CHEM",
    "course_number": 273,
    "course_title": "Organic Chemistry II",
    "course_desc": "This is the second semester course in organic chemistry intended or science majors. Topics to be covered include structure, properties, nomenclature, reactions, reaction mechanisms, stereochemistry and spectroscopy of conjugated systems, aromatic compounds, aldehydes, ketones, carboxylic acids and their derivatives, enols, enolates and their applications to biology.",
    "num_units": 3,
    "dept_name": "CHEM",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in CHEM 272 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "273L",
    "course_title": "Organic Chemistry II Lab",
    "course_desc": "Laboratory principles of Organic Chemistry II, the second semester course in organic chemistry intended for science majors. Topics to be covered include techniques, synthesis, qualitative organic analysis and applications of spectroscopy.",
    "num_units": 1,
    "dept_name": "CHEM",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in CHEM 272L and a grade of “C” or better or registration in CHEM 273 or consent of instructor.; Lab Hours: 4"
  },
  {
    "course_prefix": "CE",
    "course_number": 270,
    "course_title": "Applied Mechanics I",
    "course_desc": "This course is a study of equilibrium of rigid bodies under the action of forces and the application of the principles of mechanics to solve static problems in engineering.",
    "num_units": 3,
    "dept_name": "Civil Engineering",
    "inst_ipeds": 141990,
    "metadata": "Pre: Physics 170; credit for or registration in MATH 243 (formerly MATH 231) or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHW",
    "course_number": 101,
    "course_title": "Community Health Worker Fundamentals",
    "course_desc": "Identifies the roles that Community Health Workers play in Hawai‘i and the broader public health system and introduces the attitudes, skills and knowledge of the profession.",
    "num_units": 3,
    "dept_name": "Community Health Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement into ENG 100X; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHW",
    "course_number": 135,
    "course_title": "Health Promotion and Disease Prevention",
    "course_desc": "Explores the role Community Health Workers play in health promotion and disease prevention. Introduces the major causes of premature mortality and morbidity, behavioral and environmental contributions to illness and injury, and strategies for promoting health, wellness, and risk reduction. Provides opportunities to practice developing and teaching health promotion/disease prevention classes.",
    "num_units": 3,
    "dept_name": "Community Health Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in CHW 101, or instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHW",
    "course_number": 140,
    "course_title": "Introduction to Counseling & Interviewing",
    "course_desc": "Offers a basic introduction to counseling theory and practice for those interested in working in helping professions. Provides opportunities to practice skills through role-playing.",
    "num_units": 3,
    "dept_name": "Community Health Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement into ENG 100X; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHW",
    "course_number": 141,
    "course_title": "Case Management",
    "course_desc": "Provides knowledge and practical skills to become a competent case manager in health and human services agencies. Students apply the Ecological Model, Strengths Perspective, and effective interviewing skills to case management tasks including intake, assessment, service planning, care coordination, discharge planning, and referral. Explores individual and community capacity building, cultural competence, professional ethics and boundaries.",
    "num_units": 3,
    "dept_name": "Community Health Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in CHW 140, or instructor consent; Lecture Hours: 3"
  },
  {
    "course_prefix": "CHW",
    "course_number": 145,
    "course_title": "Community Health Worker Practicum",
    "course_desc": "Students will complete 225 practicum hours over the semester. Practicum hours include preparation of resume, letter of introduction, researching agencies and interviewing for placement. (225 hours Clinical Instruction)",
    "num_units": 4,
    "dept_name": "Community Health Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in CHW 140 and ENG 100, or instructor consent"
  },
  {
    "course_prefix": "CM",
    "course_number": 120,
    "course_title": "Introduction to Digital Video",
    "course_desc": "Students will develop basic skills in video production.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2"
  },
  {
    "course_prefix": "CM",
    "course_number": 126,
    "course_title": "3D Computer Graphics I",
    "course_desc": "This course explores introductory level conceptual and technical topics in 3D computer graphics. Autodesk Maya and related applications will be utilized to develop projects which integrate 3D modeling, UV layout, texture mapping, lighting, and rendering. (Cross-listed as ART 126)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in ART 112 or consent of instructor"
  },
  {
    "course_prefix": "CM",
    "course_number": 142,
    "course_title": "Introduction to Video Game Design",
    "course_desc": "This course offers an introduction to the fundamentals of video game and application design, development, and deployment through project-based challenges that culminate in a publishable application.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2"
  },
  {
    "course_prefix": "CM",
    "course_number": "204C",
    "course_title": "Introduction to Creative Writing (Screenwriting)",
    "course_desc": "Introduction to Creative Writing (Screenwriting) introduces students to the basic practices and principles of screenwriting. (Cross-listed as ENG 204C)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 220,
    "course_title": "Intermediate Digital Video",
    "course_desc": "Students will develop intermediate skills in video production and apply them to creating videos for publication on the web and other distribution platforms. Repeatable for up to 6 credits.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in CM 120 or consent of instructor.; Lecture Hours: 2"
  },
  {
    "course_prefix": "CM",
    "course_number": 223,
    "course_title": "Introduction to Acting for Camera",
    "course_desc": "An introduction to acting techniques for film, TV production, and other camera-based media. Repeatable up to 6 credits. (Cross-listed as THEA 223)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in THEA 221.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 240,
    "course_title": "Introduction to Digital Music Production",
    "course_desc": "Introduction to digital music and sound production on the Macintosh platform: MIDI sequencing, audio recording, music arranging, editing, mixing and mastering; preparing audio files for CD, video and web applications; sound synthesis and programming using virtual instruments. (Cross-listed as MUS 240.)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: MUS 108, 121 (alpha) or 253; or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 242,
    "course_title": "Video Game Design II",
    "course_desc": "This course picks up where CM 142 left off. In addition to creating games at a higher technical and aesthetic standard, presentation skills (as in “presentation to potential investors”) are emphasized. May be repeatable up to 6 credits.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in CM 142; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 255,
    "course_title": "Introduction to Cinema and Digital Media",
    "course_desc": "The course is an in-depth study of the process and art of cinematic storytelling. We will watch, discuss, analyze, read and write about films, television programs and/or online video with a critical eye to understanding cinematic storytelling and its various elements such as mise-en-scene, cinematography, editing and sound.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 271,
    "course_title": "Games and Gaming in Society",
    "course_desc": "This survey study of games and gaming in human culture and society brings together various methodologies and conceptual tools.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 272,
    "course_title": "Concepts in Game Design",
    "course_desc": "This course introduces students to concepts in game design, and cultivates their ability to create and produce games.",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in CM 271; Lecture Hours: 2"
  },
  {
    "course_prefix": "CM",
    "course_number": 280,
    "course_title": "Book Production: Pueo Literary and Art Journal",
    "course_desc": "This course is intended to acquaint students with the theory, practice, and skills required to publish a book (Pueo Literary and Art Journal), and, by extension, enable students to participate in the production of any small publication such as magazines, handbooks, manuals, brochures, flyers, newsletters, etc. To varying degrees over two semesters, the course covers planning, publicity, selection, editing, proofreading, layout, production, distribution, and celebration. Six credits may be applied to the AA degree. (Cross-listed as ENG 280.)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in Eng 100 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": 286,
    "course_title": "Multimedia News Production",
    "course_desc": "Students will develop intermediate skills in video journalism and produce video and multimedia news stories about campus and community events and issues for publication on the Ka Ohana website and other distribution platforms. Repeatable for up to 6 credits. (Crosslisted as JOUR 286.)",
    "num_units": 3,
    "dept_name": "Creative Media",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for CM 120 or JOUR 120; or consent of instructor.; Lecture Hours: 2"
  },
  {
    "course_prefix": "CM",
    "course_number": "295A",
    "course_title": "Careers in Video Game Design",
    "course_desc": "This capstone course covers the basic business, legal and ethical issues related to careers in video game design. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "CM",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better or registration in CM 242, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "CM",
    "course_number": "295B",
    "course_title": "Careers in Filmmaking",
    "course_desc": "This capstone course covers the basic business, legal and ethical issues related to careers in filmmaking. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "CM",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better or registration in CM 220, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 121,
    "course_title": "Beginning Ballet",
    "course_desc": "Introduction to classical ballet technique. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "Dance",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 122,
    "course_title": "Continuing Beginning Ballet",
    "course_desc": "Continuation of beginning classical ballet technique. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "Dance",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in DNCE 121 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 131,
    "course_title": "Beginning Modern Dance",
    "course_desc": "Introduction to modern dance technique. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 132,
    "course_title": "Continuing Beginning Modern Dance",
    "course_desc": "Continuation of beginning modern dance technique. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in DNCE 131 or Instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 221,
    "course_title": "Low Intermediate Ballet",
    "course_desc": "Low intermediate ballet technique. Maybe repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in DNCE 122 or instructor’s consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 231,
    "course_title": "Low Intermediate Modern Dance",
    "course_desc": "Low intermediate modern dance technique. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in DNCE 132 or Instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 252,
    "course_title": "Applied Dance",
    "course_desc": "This course provides individual instruction in dance, covering intermediate and advanced performance techniques taught to each student's individual level. Applied dance is a performance course. The emphasis will be toward developing performing skills from a wide range of methods and training. The goal is to facilitate student dancers in attaining a level of confidence and skill that allows for consistently powerful and effective performances. This course may be repeated for up to 4 credits. (1 hour Individual Instruction)",
    "num_units": "1-4",
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in DNCE 121 or DNCE 131.; Lecture Hours: 1"
  },
  {
    "course_prefix": "DNCE",
    "course_number": 270,
    "course_title": "Dance Performance",
    "course_desc": "DNCE 270 is a performance course designed to enhance and develop students' dance skills through the staging of selected dance pieces either as individual pieces or as part of a larger production project.",
    "num_units": 3,
    "dept_name": "DNCE",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in DNCE 121 or 131, or Instructor's consent; Lab Hours: 6"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 101,
    "course_title": "Introduction to Geology",
    "course_desc": "The natural physical environment; the landscape; rocks and minerals, rivers and oceans; volcanism, earthquakes and other processes inside the Earth; effects of human use on the Earth and its resources. Field trip.",
    "num_units": 3,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": "101L",
    "course_title": "Introduction to Geology Lab",
    "course_desc": "Hands-on study of minerals, rocks, and topographic maps. Examine volcanism, hydrology, coastal processes and hazards, geologic time and earthquakes. Field trips to investigate landslides, beaches and Oʻahu geology.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Lab Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 102,
    "course_title": "Quantifying Global & Environmental Change",
    "course_desc": "Introductory mathematical approaches to quantifying key aspects of global and environmental change. Includes data analysis, graphical representation, and modeling of population growth, greenhouse gas emissions and fate, sustainable resource utilization, and sea-level change.",
    "num_units": 3,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 103,
    "course_title": "Geology of Hawaiian Islands",
    "course_desc": "Hawaiian geology and geologic processes: origin of Hawaiian Islands, volcanism, rocks and minerals, land forms, stream and coastal processes, landslides, earthquakes and tsunamis, ground water, geologic and environmental hazards. Field trips arranged.",
    "num_units": 3,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 135,
    "course_title": "Natural Disasters and Human History",
    "course_desc": "Examines how natural hazards have affected the course of human culture and societies from pre-history to the present in Hawai‘i/Oceania, Asia, Africa, Europe, and the Americas.",
    "num_units": 3,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 210,
    "course_title": "O‘ahu Field Geology",
    "course_desc": "Field trip and laboratory sessions relating to the Geology of O‘ahu.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in ERTH 101, ERTH 103, or consent of instructor."
  },
  {
    "course_prefix": "ERTH",
    "course_number": 211,
    "course_title": "Big Island Field Geology",
    "course_desc": "A four-day field trip on the island of Hawai‘i. A survey of Hawaiian volcanic processes is illustrated by studying Kilauea, Mauna Kea, Mauna Loa, Hualalai, and Kohala volcanoes. Students are responsible for air and ground transportation, meals, and lodging.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in ERTH 101, ERTH 103, or consent of instructor. Must have medical clearance.; Lab Hours: 3"
  },
  {
    "course_prefix": "ERTH",
    "course_number": 212,
    "course_title": "Maui Field Geology",
    "course_desc": "A four-day field trip on the island of Maui. A survey of Hawaiian volcanology and geomorphology illustrated by field studies of Haleakala and West Maui volcanoes. Students are responsible for air and ground transportation, meals, and lodging.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ERTH",
    "course_number": 213,
    "course_title": "Moloka‘i, Lana‘i, and Kaho‘olawe Field Geology",
    "course_desc": "A four-day field trip on the islands of Moloka‘i and Lana‘i. Field studies of East Moloka‘i, West Moloka‘i, Makanalua (Kalaupapa) and Lana‘I volcanoes, and directed reading on Kaho‘olawe volcano. Students are responsible for air and ground transportation, meals, and lodging.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ERTH",
    "course_number": 214,
    "course_title": "Kaua‘i and Ni‘ihau Field Geology",
    "course_desc": "A four-day fieldtrip on the island of Kaua‘I to study the volcanological evolution and continuing geological history of Kaua‘i and Ni‘ihau volcanoes. Students are responsible for air and ground transportation, meals, and lodging.",
    "num_units": 1,
    "dept_name": "ERTH",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "ECON",
    "course_number": 130,
    "course_title": "Principles of Microeconomics",
    "course_desc": "Examination of the decision-making process of both households and firms. Analysis of the functioning of a competitive market system, using supply and demand models and the role of government in cases of market failure.",
    "num_units": 3,
    "dept_name": "Economics",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ECON",
    "course_number": 131,
    "course_title": "Principles of Macroeconomics",
    "course_desc": "Examination of the forces determining levels of and changes in national income, employment and the price level, including the role of government through its fiscal and monetary policies.",
    "num_units": 3,
    "dept_name": "Economics",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ECON",
    "course_number": 220,
    "course_title": "Introduction to Environmental Economics",
    "course_desc": "Environmental Economics uses the basic tools of economic analysis to focus on issues that pertain to the natural environment and its resources. The central theme is that there are competing demands for our limited natural resources necessitating that difficult choices be made regarding how those resources are used. Topics include global warming, Hawai‘i’s environment and other current environmental issues as time permits.",
    "num_units": 3,
    "dept_name": "Economics",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "EE",
    "course_number": 160,
    "course_title": "Programming for Engineers",
    "course_desc": "Introductory course on computer programming and modern computing environments with an emphasis on algorithm and program design, implementation and debugging. Designed for engineering students, this course includes a hands-on laboratory to develop and practice programming skills.",
    "num_units": 4,
    "dept_name": "Electrical Engineering",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in Math 140 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "EE",
    "course_number": 211,
    "course_title": "Basic Circuit Analysis I",
    "course_desc": "This is an introductory course covering linear passive circuits, time domain analysis, transient and steady state responses, phasors, impedance and admittance, power and energy, frequency responses, and resonance.",
    "num_units": 4,
    "dept_name": "Electrical Engineering",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in MATH 243 (formerly MATH 231) or higher, credit for or registration in PHYS 272, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": 100,
    "course_title": "Composition I",
    "course_desc": "This college-level composition course promotes critical reading, the writing process, rhetorical principles, research strategies, and the documentation of sources.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 22, OR placement into ENG 100, OR grade of “C” or better in ENG 23 and corequisite enrollment in ENG 100W, OR placement and enrollment in co-requisite ENG 100W OR grade of “C” or better in ENG 100W OR approval of designated Language Arts representative.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": "100W",
    "course_title": "Composition I Writing Workshop",
    "course_desc": "This course offers increased student-teacher collaboration on English 100 course content: college-level composition, critical reading, the writing process, rhetorical principles, research strategies, and the documentation of sources. (140 min studio)",
    "num_units": 1,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of \"C\" or better in ENG 23, or placement into ENG 100W, or approval of designated Language Arts representative."
  },
  {
    "course_prefix": "ENG",
    "course_number": 200,
    "course_title": "Composition II",
    "course_desc": "A writing intensive composition course that furthers the study of rhetorical, conceptual, and stylistic demands of writing. through a variety of assignments, each essay students write will build on the next one, culminating in a final argumentative research paper into which students will incorporate the knowledge they have gained through the writing and research performed during the semester.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": "204A",
    "course_title": "Introduction to Creative Writing (Fiction)",
    "course_desc": "English 204A Introduction to Creative Writing (fiction) introduces students to the basic practices and principles involved in the writing and publication of short stories and novels.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": "204B",
    "course_title": "Introduction to Creative Writing (Poetry)",
    "course_desc": "English 204B Introduction to Creative Writing (Poetry) introduces students to the basic practices and principles involved in the writing and publication of poems.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": "204C",
    "course_title": "Introduction to Creative Writing (Screenwriting)",
    "course_desc": "English 204C Introduction to Creative Writing (Screenwriting) introduces students to the basic practices and principles of screenwriting. (Cross-listed as CM 204C)",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": "204D",
    "course_title": "Introduction to Creative Writing: Creative Nonfiction",
    "course_desc": "English 204D Introduction to Creative Writing (Creative Nonfiction) introduces students to the basic practices and principles involved in the writing and publication of creative nonfiction, which includes autobiography, biography, nature and travel writing, cultural criticism, and historical and scientific writing.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": 209,
    "course_title": "Business Writing",
    "course_desc": "A study of business and managerial writing; practice in writing letters, memos, and reports, including a report requiring research and documentation.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": 271,
    "course_title": "Introduction to Literature: Genre",
    "course_desc": "This course introduces students to the study of significant works of literature in selected genres. Emphasis is on discussion of and writing about characteristics and themes of the works. A student may enroll in this course more than one time (for different genres); however, only three credits will be applied toward degree.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": 272,
    "course_title": "Introduction to Literature: Culture and Literature",
    "course_desc": "This course introduces students to the study of significant works of literature in selected cultures and cultural formations. Emphasis is on discussion of and writing about characteristics and themes of the works. A student may enroll in this course more than one time (for different cultures); however, only three credits will be applied toward degree.",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ENG",
    "course_number": 280,
    "course_title": "Book Production: Pueo Literary and Art Journal",
    "course_desc": "This course is intended to acquaint students with the theory, practice, and skills required to publish a book (Pueo Literary and Art Journal), and, by extension, enable students to participate in the production of any small publication such as magazines, handbooks, manuals, brochures, flyers, newsletters, etc. To varying degrees over two semesters, the course covers planning, publicity, selection, editing, proofreading, layout, production, distribution, and celebration. Six credits may be applied to the AA degree. (Cross-listed as CM 280.)",
    "num_units": 3,
    "dept_name": "English",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "FIN",
    "course_number": 150,
    "course_title": "Personal Finance",
    "course_desc": "A goal-oriented approach to personal financial management covering budgeting, use of financial institutions, income tax effects and strategies, credit risk management, investment analysis, risks, alternatives, financial products and markets, retirement planning and estate planning. Students will be introduced to various financial planning software programs.",
    "num_units": 3,
    "dept_name": "Finance",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in Math 75X or equivalent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "FSHN",
    "course_number": 185,
    "course_title": "Human Nutrition",
    "course_desc": "An introductory level biological science course which integrates basic concepts of science with the study of human nutrition. Designed for students who want an introduction to nutrition, as well as those who later choose to major in it.",
    "num_units": 3,
    "dept_name": "Food Science and Human Nutrition",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement in ENG 100 and credit in Math 25, 26, 29, or 82 or higher, placement into Math 103 or higher, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "GEO",
    "course_number": 101,
    "course_title": "The Natural Environment",
    "course_desc": "Survey of the natural environment; distribution and interrelationships of climates, vegetation, soil, and land forms.",
    "num_units": 3,
    "dept_name": "Geography & Environment",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "GEO",
    "course_number": "101L",
    "course_title": "The Natural Environment Laboratory",
    "course_desc": "Analysis by use of maps, air photos, field and laboratory observation, and experimentation. Emphasis on Hawai‘i and on human modification of environment. Required field trips during regular class hours.",
    "num_units": 1,
    "dept_name": "Geography",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in GEO 101.; Lab Hours: 3"
  },
  {
    "course_prefix": "GEO",
    "course_number": 102,
    "course_title": "World Regional Geography",
    "course_desc": "Geography 102 is a survey of the world’s major cultural regions. Environmental, cultural, political, and economic characteristics of each region and regional interactions are explored from a geographic perspective.",
    "num_units": 3,
    "dept_name": "Geography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "GEO",
    "course_number": 151,
    "course_title": "Geography and Contemporary Society",
    "course_desc": "Elements of population geography and urban studies, economic geography and resource management; application to current problems of developed and underdeveloped countries.",
    "num_units": 3,
    "dept_name": "Geography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "GEO",
    "course_number": 252,
    "course_title": "The Landscape of Japan: Natural, Cultural and Historical",
    "course_desc": "Analyses of ordinary and symbolic landscapes of Japan from natural, cultural and historical perspectives. The course interprets a landscape synthesizing underlying physical, cultural and historical settings of the landscape.",
    "num_units": 3,
    "dept_name": "Geography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HAW",
    "course_number": 100,
    "course_title": "Language in Hawai‘i: A Microcosm of Global Language Issues",
    "course_desc": "Course is a survival kit for life in Hawai‘i and an introduction to Hawaiian and language related issues enhancing communicative experiences in Hawai‘i. An examination of social, cultural, political, and linguistic cross-cultural interaction locally and globally. Taught in English and Hawai‘i Creole English.",
    "num_units": 3,
    "dept_name": "Hawaiian Language",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HAW",
    "course_number": 101,
    "course_title": "Elementary Hawaiian I",
    "course_desc": "An elementary course in the Hawaiian language which focuses on rules of grammar, pattern drills, the building of an adequate vocabulary to facilitate conversation, and reading of selected materials at an elementary level.",
    "num_units": 4,
    "dept_name": "Hawaiian Language",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 4"
  },
  {
    "course_prefix": "HAW",
    "course_number": 102,
    "course_title": "Elementary Hawaiian II",
    "course_desc": "Continuation of HAW 101.",
    "num_units": 4,
    "dept_name": "Hawaiian Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HAW101 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "HAW",
    "course_number": 201,
    "course_title": "Intermediate Hawaiian I",
    "course_desc": "Continuation of HAW 102 with emphasis on increasing proficiency in use of major sentence patterns in reading, writing, conversation, and translation.",
    "num_units": 4,
    "dept_name": "Hawaiian Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HAW 102 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "HAW",
    "course_number": 202,
    "course_title": "Intermediate Hawaiian II",
    "course_desc": "Continuation of HAW 201. Further refinement of basic language skills including vocabulary development beyond the 201 level. Increased control over structures and idioms. Includes readings about history, culture, and diverse forms of literature.",
    "num_units": 4,
    "dept_name": "Hawaiian Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HAW 201 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "HWST",
    "course_number": 107,
    "course_title": "Hawai‘i: Center of the Pacific",
    "course_desc": "An introduction to Hawai‘i and Hawaiian culture in the context of the larger Pacific, including Hawaiian origins, settlement, language, land, history, society, religion and the arts.",
    "num_units": 3,
    "dept_name": "Hawaiian Studies",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 110,
    "course_title": "Huaka‘i Wa‘a: Introduction to Hawaiian Voyaging",
    "course_desc": "This course introduces students to modern Hawaiian canoe voyaging through a beginning examination of the science and narratives of ancient voyaging, the history of the modern revival of voyaging, and the Hawaiian navigator’s toolkit.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 115,
    "course_title": "Mo‘okūauhau: Hawaiian Genealogies",
    "course_desc": "This is a course in which students will learn about the centrality of genealogy to Hawaiian history, culture, and family. Students of any ancestry or background will gain value in learning about a central aspect of Hawaiian culture, and in doing research that is geared toward either their own family genealogy or the researching of the genealogies of public figures, or historical figures. Students will be guided through a research process and set of research methodologies for vital statistics, land, tax, census, historical material, and online resources. Students will also learn chiefly and family genealogies of Hawai‘i, which is a Hawaiian method through which some of the history of Hawai‘i is also explored. By completion of the semester, students will be expected to assemble a genealogy and family history beyond what they might already have completed before enrollment in this class for either themselves or a public figure cleared by the instructors of this course.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 130,
    "course_title": "Hula ‘Ōlapa: Traditional Hawaiian Dance",
    "course_desc": "In this class students will learn various beginning traditional hula interpretations. Students will be taught the basic footwork and hand gestures of traditional hula accompanied by chanting, Ipu Heke (double gourd) or Pahu (drum). Students may also be required to make accompanying instruments like Ipu (smaller single gourd), Kala‘au (sticks), ‘Ili‘ili (stones), and Pū‘ili (split bamboo), and learn accompanying oli (chants) under the direction of the class Instructor. Students will be taught different historical aspects of specific hula, associated hula mythology, ali‘i (chiefly) genealogies, plants and place names.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2; Lab Hours: 2"
  },
  {
    "course_prefix": "HWST",
    "course_number": 131,
    "course_title": "Hula Ōlapa ‘elua: Traditional Hawaiian Dance II",
    "course_desc": "Continuation of HWST 130. In this second class, students will learn intermediate traditional hula interpretations. Foot work and hand gestures of traditional hula will be reinforced accompanied by chanting, Ipu Heke (double gourd) or Pahu (drum). Students will be exposed to chants, and pule of traditional and ceremonial protocols related to the discipline of hula. Students may also be required to make accompanying instruments, like Ipu (smaller single gourd), Kala‘au (sticks), ‘Ili‘ili (stones), and Pū‘ili (split bamboo) under the direction of the class instructor. Students will be taught different historical aspects of specific hula, associated hula mythology, ali‘i (chiefly) genealogies; plants, and place names.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HWST 130, and enrollment in or credit for HAW 101 or HWST 107.; Lecture Hours: 2; Lab Hours: 2"
  },
  {
    "course_prefix": "HWST",
    "course_number": 135,
    "course_title": "Kālai Lā‘au: Hawaiian Woodwork and Wood Carving",
    "course_desc": "This is a Hawaiian cultural woodwork and wood carving project class. This class will involve the development of two to three introductory woodworking projects of Hawaiian cultural significance or ceremonial use. through this class the students will develop both the skills needed to work effectively and safely with wood, and the cultural knowledge important to the pieces developed. As a project class, there will be specific projects and themes set by the instructor of general Hawaiian cultural interest. Students will learn different aspects and solutions in carving and creating Hawaiian cultural projects.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "HWST",
    "course_number": 136,
    "course_title": "Kālai Lā‘au II: Advanced Techniques in Hawaiian Carving",
    "course_desc": "This is a Hawaiian cultural carving class that is a continuation of the themes and techniques learned in HWST 135 Kālai La‘au. Students will be required to complete at least one large piece and two highly finished smaller pieces. Students will be expected to have a basic understanding of carving upon entering the class and will spend their time fine tuning and working on a larger scale. through this class students will develop skills and techniques with more advanced tools needed to work effectively and safely with wood, bone, and/or stone, and students will acquire the cultural knowledge important to the pieces developed. Students will also learn how to make some of the tools required for use in the class.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HWST 135 with a grade of “B” or better, or consent of the instructor."
  },
  {
    "course_prefix": "HWST",
    "course_number": 140,
    "course_title": "Mahiʻai I: Hawaiian Taro Culture",
    "course_desc": "The first mahiʻai course in a series of four in Hawaiian cultivation practices. Covers the history, lore, and geographically specific methods of mahiʻai. Emphasis on the cultivation of kalo and related staple foods.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 142,
    "course_title": "Mahiʻai Kalo II - Traditional and Modern Techniques of Loʻi Kalo Production",
    "course_desc": "This course expands on the traditional Hawaiian kalo growing knowledge covered in the first class to include the ecology of wetland kalo systems, focusing on traditional loʻi techniques, and the integration of nutrient flow analysis through the ahupuaʻa and nutrient management practices for loʻi kalo. Additional emphasis is placed on both scientific and practical approaches. Cooking and eating are used throughout the course to demonstrate linkages between kalo and human nutrition and wellbeing. The course will consist of a mixture of lecture and hands-on field experience.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in HWST 140 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 215,
    "course_title": "Oli Hūlona: Beginning Hawaiian Protocol and Chant",
    "course_desc": "An introduction to beginning Hawaiian protocol(s) and chant. Students will learn types of chants, voice quality, modes of chanting, and their basic elements of place chants at an introductory level.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HWST 107 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 217,
    "course_title": "Understanding Polynesian Religions",
    "course_desc": "This course provides an introduction to the study of Polynesian religions through an exploration of the oral traditions of Hawai‘i, Aotearoa (New Zealand), French Polynesia (Tahiti et al.), and Samoa among others. In this class, students will gain a foundational understanding of important religious themes that permeate Polynesia. Main themes include but are not limited to deities’ forms & functions, cosmogonies, etiologies, and belief-regulated practices. Additionally, a portion of the semester will focus on belief narratives as vehicles for the transmission of knowledge and the significance of contemporary representation and self-representation of Polynesian religion and culture. This class will use comparative analysis between Hawaiian religion and the religious traditions of Aotearoa, French Polynesia, and Samoa to identify the fundamental concepts needed to understand Polynesian religions and explore how they are interconnected and interwoven into the fabric of our lives today. (Cross-listed as REL 217)",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 222,
    "course_title": "Ma‘awe No‘eau: Hawaiian Fiber Work",
    "course_desc": "This is a Hawaiian cultural fiber arts project class. This class will involve the development of three to four introductory fiber arts projects of Hawaiian cultural significance or ceremonial use. through this class students will learn how to procure the materials needed to complete various fiber arts projects, including learning related protocol and methods for gathering, understanding of Native Hawaiian gathering rights, and the type of environments in which specific materials grow and can be gathered, Students will develop the skills needed to work effectively and safely with various fiber arts materials on introductory projects, and students will learn the cultural knowledge important to the pieces created. As a project class, there will be specific projects and themes set by the instructor of general Hawaiian cultural interest.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "HWST",
    "course_number": 253,
    "course_title": "Kamehameha I and the Hawaiian Kingdom",
    "course_desc": "Kamehameha I, also known as Pai‘ea, Ka Na‘i Aupuni, and Kaiwakiloumoku is the most famous Hawaiian in history. This course will look at the rise to power of Kamehameha I, as he consolidated all of the islands under his control establishing the Hawaiian Kingdom. We will examine his genealogy and chiefly family relations including, his most famous exploits and battles, the olelo no‘eau (wise sayings) related to his life, and the cultural and political legacies he has left Hawai‘i.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: HWST 107 and HAW 101; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 255,
    "course_title": "Introduction to the Hawaiian Kingdom",
    "course_desc": "This course focuses on the Hawaiian Kingdom era covering two major historical periods: the first from 1810 until 1893; the second from 1893 to the present. This course focuses primarily on the first historical period, allowing the legal, political, and economic conclusions from that era to inform and provide for us a continuity into the second historical period. Major topics addressed in this course are: unification; the Hawaiian Constitutions; recognition and nationhood in 1843; feudal and allodial land systems; the Hawaiian economy; the Hawaiian monarchs; the occupation of the Hawaiian Islands; issues and methods of de-occupation; historical, political, legal, and economic global contexts.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in HWST 107, HIST 284 or HIST 224.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 263,
    "course_title": "Hawaiian and Indigenous Film & Literature",
    "course_desc": "This course is a study of film & literature created by Native Hawaiians and other Indigenous peoples; especially to focus on the situational and cultural impetus from which these texts were created.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HWST 107 or PACS 108, or instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 270,
    "course_title": "Hawaiian Mythology",
    "course_desc": "Survey of gods, ‘aumakua, kupua, mythical heroes, heroines, and their kinolau as the basis of traditional Hawaiian Metaphor. This course will investigate and analyze oral and written Hawaiian literary sources.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HWST 107 or HAW 102.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 273,
    "course_title": "Tattoo Traditions of Polynesia",
    "course_desc": "An overview of the traditional tattoo practices of the various Polynesian islands within the context of the great Pacific.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 275,
    "course_title": "Wahi Pana: Mythology of the Hawaiian Landscape",
    "course_desc": "Wahi Pana: Mythology of the Landscape, is designed to illuminate Hawaiian intelligence regarding the geographic features of these islands. Students will undertake a basic study of the natural sciences from a Western/modern perspective. They will then look at various Hawaiian chants and epic tales to explore the connections with indigenous knowledge forms found in a Hawaiian worldview. Cross-cultural comparisons are made with the goal of bringing forth specific, physical information about important Hawaiian places. Students will gain cultural awareness of their surroundings through the bridging of geography and the mythology studied, thus creating a more Hawaiian sense-of-place in our community.",
    "num_units": 3,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in HWST 107, or HWST 270; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": "275L",
    "course_title": "Wahi Pana: Mythology of the Hawaiian Landscape Field Lab",
    "course_desc": "This field lab supports HWST 275. Together, they illuminate Hawaiian intelligence regarding the geographic features of these islands. The course highlights the Ko‘olau districts (Waimānalo to Waimea) or O‘ahu as a living classroom resource where the Wahi Pana (sacred places) and mythology of the landscape can be seen and appreciated. Students will explore connections between the social and natural sciences, and indigenous knowledge forms found in a Hawaiian worldview from observing their physical surroundings. Cross-cultural comparisons are made with the goal of bringing forth specific, physical information about important Hawaiian places.",
    "num_units": 1,
    "dept_name": "HWST",
    "inst_ipeds": 141990,
    "metadata": "Pre: Enrollment or credit in HWST 275 lecture component"
  },
  {
    "course_prefix": "HWST",
    "course_number": 285,
    "course_title": "Lā‘au Lapa‘au I: Hawaiian Medicinal Herbs",
    "course_desc": "In this class students will learn the basic philosophy and traditions surrounding Hawaiian healing herbs. Students will also learn how to identify, grow, harvest, prepare, store and use these herbs for various human ailments.",
    "num_units": 4,
    "dept_name": "Hawaiian Studies",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for HWST 107 or BOT 105.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 296,
    "course_title": "Special Topics in Hawaiian Studies",
    "course_desc": "Students will investigate important topics in Hawaiian Studies such as specific people, events, or periods. May be repeated up to 9 credits with different topics.",
    "num_units": 3,
    "dept_name": "Hawaiian Studies",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in HWST 107.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HLTH",
    "course_number": 123,
    "course_title": "Introduction to Clinical Skills and Patient Care",
    "course_desc": "HLTH 123 provides an opportunity for students to discover their suitability for a career in direct client care and clinical medicine. Personal and cultural values and practices, professional conduct, and team-based care will be explored. In depth study will focus on medical terminology, common illnesses, interviewing patients, clinical cases, health care service models, workforce, and provider organizations. Safety/OSHA/HIPPA, CPR/AED certification, payor systems, and health ethics. Concepts and skills learned will be supplemented with site visits to healthcare facilities and guest lectures from selected healthcare professionals.",
    "num_units": 3,
    "dept_name": "Health",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HLTH",
    "course_number": "123C",
    "course_title": "Introduction to Clinical Skills and Patient Care",
    "course_desc": "HLTH 123C will be taught by a registered nurse and satisfies the requirements for the State of Hawaii Certified Nurses Aide Licensure. This course provides an opportunity for students to discover their suitability for a career in direct client care and clinical medicine. Personal and cultural values and practices, professional conduct, and team-based care will be explored. In depth study will focus on medical terminology, common illnesses, interviewing patients, clinical cases, health care service models, workforce, and provider organizations. Safety/OSHA/HIPPA, CPR/AED certification, payor systems and health ethics. Concepts and skills learned will be supplemented with site visits to healthcare facilities and guest lectures from selected healthcare professionals.",
    "num_units": 3,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HLTH",
    "course_number": 124,
    "course_title": "Introduction to Hawaiian and Indigenous Health and Healing: Kupuna Care for Nurse Aides",
    "course_desc": "Intro to Hawaiian and Indigenous Health and Healing combines traditional and Western healing knowledge and care giving skills. Training in the Native Hawaiian traditional healing practices focuses on mālama kupuna (elder care), mālama ‘aina (agricultural practices), ‘ai pono (healthy nutrition), ho‘oponopno (mutual reciprocation), lomilomi (massage), and lā‘au lapa‘au (plant medicine). The Western elements of the course focuses on human anatomy, medical terminology, basic nursing care, basic home care, nutrition, basic personal care, patient interaction and communication, dressing, bathing and feeding patients, helping patients get out of bed or move about, taking patients' temperature, blood pressure and pulse, and reporting to nurses.",
    "num_units": 3,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HLTH 123 or instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HLTH",
    "course_number": "124C",
    "course_title": "Introduction to Hawaiian and Indigenous Health and Healing: Kupuna Care for Nurse Aides",
    "course_desc": "Intro to Hawaiian and Indigenous Health and Healing combines traditional and Western healing knowledge and caregiving skills. HLTH 124C will be taught by a registered nurse and satisfies the requirements for the State of Hawaii Certified Nurses Aid licensure. Intro to Hawaiian and Indigenous Health and Healing combines traditional and Western healing knowledge and care giving skills. Training in the Native Hawaiian traditional healing practices focuses on mālama kūpuna (elder care), mālama ‘aina (agricultural practices), ‘ai pono (healthy nutrition), ho‘oponopno (mutual reciprocation), lomilomi (massage), and lā‘au lapa‘au (plant medicine). The Western elements of the course focuses on human anatomy, medical terminology, basic nursing care, basic home care, nutrition, basic personal care, patient interaction and communication, dressing, bathing and feeding patients, helping patients get out of bed or move about, taking patients' temperature, blood pressure and pulse, and reporting to nurses.",
    "num_units": 3,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HLTH 123C or instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HLTH",
    "course_number": 125,
    "course_title": "Survey of Medical Terminology",
    "course_desc": "HLTH 125 familiarizes the student with medical terminology used in both human and animal medicine through analysis of prefixes, suffixes, and word roots. This course covers the pronunciation, spelling, and definitions of selected medical words dealing with mammalian body systems. Commonly used medical abbreviations and pharmacological terms are also discussed.",
    "num_units": 1,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 21 or ENG 23, or placement in ENG 100X; Lecture Hours: 1"
  },
  {
    "course_prefix": "HLTH",
    "course_number": 134,
    "course_title": "Practicum to Hawaiian and Indigenous Health and Healing: Kupuna care for Nurse Aides",
    "course_desc": "This course is a practicum companion to HLTH 124 and prepares students to work in non-long-term care settings. However, it does not qualify students to sit for the State of Hawai‘i Nurse Aide exam to become a Certified Nurse Aide (CNA). Intro to Hawaiian and Indigenous Health and Healing combines traditional Western healing knowledge and care giving skills. Training in the Native Hawaiian traditional healing practices focuses on mālama kapuna (elder care), mālama ‘aina (agricultural practices), ka‘a‘ike waha (communication), ‘ai Pono (healthy nutrition), ho‘oponopono (mutual restitution), lomilomi (massage), and lā‘au lapa‘au (plant medicine). Western knowledge focuses on human anatomy, medical terminology, basic nursing care, basic home care, emergency care, nutrition, dressing, bathing and feeding patients, taking patients' temperature, blood pressure and pulse, and reporting too nurses. (3 hours Clinical Instruction)",
    "num_units": 1,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better or registration in HLTH 124."
  },
  {
    "course_prefix": "HLTH",
    "course_number": "134C",
    "course_title": "Practicum to Hawaiian and Indigenous Health and Healing: Kupuna care for Nurse Aides",
    "course_desc": "This course is a practicum companion to HLTH 124 and is required for students planning to qualify to sit for the State of Hawaii Nurse Aide exam to become a Certified Nurse Aide (CNA). Intro to Hawaiian and Indigenous Health and Healing combines traditional Western healing knowledge and care giving skills. Training in the Native Hawaiian traditional healing practices focuses on mālama kūpuna (elder care), mālama ‘aina (agricultural practices), ka‘a‘ike waha (communication), ‘ai Pono (healthy nutrition), ho‘oponopono (mutual restitution), lomilomi (massage), and lā‘au lapa‘au (plant medicine). Western knowledge focuses on human anatomy, medical terminology, basic nursing care, basic home care, emergency care, nutrition, dressing, bathing and feeding patients, taking patients' temperature, blood pressure and pulse, and reporting too nurses. (3 hours clinical instruction)",
    "num_units": 1,
    "dept_name": "HLTH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better or registration in HLTH 124C."
  },
  {
    "course_prefix": "HIST",
    "course_number": 151,
    "course_title": "World History to 1500",
    "course_desc": "A global and historical survey focusing on human societies and cross-cultural interactions to 1500 C.E.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 152,
    "course_title": "World History Since 1500",
    "course_desc": "A global and historical survey focusing on human societies and cross-cultural interactions since 1500 C.E.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 230,
    "course_title": "Pre-Modern European Civilization",
    "course_desc": "A survey of Pre-Modern Europe to 1500 CE. Focus is given to the political evolution and the major economic, social, and cultural development of European states.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 241,
    "course_title": "Civilizations of Asia I",
    "course_desc": "A survey course covering the development of the major civilizations of East Asia, South and Southeast Asia, and historical personages and events from the earliest periods to the 1500’s.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 242,
    "course_title": "Civilizations of Asia II",
    "course_desc": "A survey course focusing on the changes/development of the major civilizations of East Asia, South and Southeast Asia from the Sixteenth Century to the present. Particular emphasis placed on an analysis of representative Asian societies, the Asian response to the West, and Asian nationalism.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 260,
    "course_title": "Twentieth Century World History",
    "course_desc": "This course covers the major individuals and political, economic, social, and culture events of the world during the twentieth century. Emphasis will be placed on global relationships, conflict, and changing patterns of interaction among cultures and peoples in an era of near-constant change.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 270,
    "course_title": "History, Cartoons, and Comic Books: Examining Historical Discourse through Popular Art",
    "course_desc": "This course surveys the history of newspaper strips, comic books, pulp fiction, graphic novels, and other media from the 19th century to the present. Students will analyze different themes in world history--including imperialism, colonialism, war, civil unrest, and revolution--through the medium of the \"comic\" as it evolved throughout the 19th and 20th centuries. Focused topics include the deconstruction of late 19th/early 20th century political cartoons, the creation of the modern comic book, the birth of the super hero, and historical events such as WWI, The Great Depression, WWII, and the Cold War.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 281,
    "course_title": "Introduction to American History I",
    "course_desc": "An introduction to American history covering significant events in U.S. history from the colonial to Civil War period.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 282,
    "course_title": "Introduction to American History II",
    "course_desc": "Continuation of HIST 281 focusing on significant events in American history from Reconstruction (1865) to the present.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 284,
    "course_title": "History of Hawai‘i",
    "course_desc": "A general study of the social, political and economic development of Hawai‘i from the ancient Hawaiians to the present.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HIST",
    "course_number": 285,
    "course_title": "Environmental History of Hawai‘i",
    "course_desc": "This course investigates human interactions with the natural world in the Hawaiian Islands. It is interdisciplinary, drawing on insights from history, geography, anthropology and the natural sciences. Topics covered will include island biogeography and evolution; the natural and human histories of Hawai‘i; Hawaiian and American attitudes toward the environment; the impact of introduced diseases, plants and animals in Hawai‘i.",
    "num_units": 3,
    "dept_name": "History",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HDFS",
    "course_number": 230,
    "course_title": "Human Development and Family Studies",
    "course_desc": "This course provides students with theories of biological, cognitive, and psycho-social development from infancy to adulthood and with similarities and differences among individuals and their cultures.",
    "num_units": 3,
    "dept_name": "Human Development and Family Studies",
    "inst_ipeds": 141990,
    "metadata": "Pre: PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "HDFS",
    "course_number": 231,
    "course_title": "Infancy and Early Childhood",
    "course_desc": "Growth and development from the prenatal period to age 5. Historical and current issues and research based on ecological, cross-cultural perspectives. Focus on optimal development.",
    "num_units": 3,
    "dept_name": "HDFS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HDFS 230; Lecture Hours: 3"
  },
  {
    "course_prefix": "HDFS",
    "course_number": 232,
    "course_title": "Childhood",
    "course_desc": "Intensive investigation into developmental aspects of 6–12 year old children. Historical and current issues, research, and examination of the role of schools and other community resources. Focus on optimal development.",
    "num_units": 3,
    "dept_name": "HDFS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HDFS 230; Lecture Hours: 3"
  },
  {
    "course_prefix": "HDFS",
    "course_number": 241,
    "course_title": "Parenting",
    "course_desc": "Parenting theories, methods, skills, issues, and resources; parent-child relations in various cultural contexts.",
    "num_units": 3,
    "dept_name": "HDFS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in HDFS 230; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 100,
    "course_title": "Computing Literacy and Applications",
    "course_desc": "Fundamental information technology concepts and computing terminology, productivity software for problem solving, computer technology trends and impact on individuals and society. Emphasizes the utilization of operating systems and the production of professional documents, spreadsheets, presentations, databases, and web pages.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit in both ENG 22 or ENG 23 and MATH 22, 24, 25, 26, 28, 29, 75X or higher.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 101,
    "course_title": "Digital Tools for the Information World",
    "course_desc": "Fundamental information technology concepts and computing terminology, productivity software for problem solving, computer technology trends and impact on individuals and society. Emphasizes the utilization of operating systems and the production of professional documents, spreadsheets, presentations, databases, and web pages.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 105,
    "course_title": "Introduction to Computing Skills",
    "course_desc": "In this introductory computing course, students will learn basic file management, digital communication, word processing, and presentation software. Students will explore various computing systems and terminology. This course is recommended for students inexperienced in computing.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 107,
    "course_title": "Web Site Development",
    "course_desc": "An introduction to the concepts and skills for developing websites from planning through publishing. Design, usability, accessibility, markup and styling language, and integrating media will be emphasized. Web development software utilized.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Intermediate computing skills including file management and common computing skills: cut, copy, paste, open/save files, web search.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 111,
    "course_title": "Introduction to Computer Science I",
    "course_desc": "Intended for computer science majors and all others interested in a first course in programming. An overview of the fundamentals of computer science emphasizing problem solving, algorithm development, implementation, and debugging/testing using an object-oriented programming language.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: MATH 103 with a grade of “C” or better, placement into MATH 135, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 119,
    "course_title": "Introduction to Social Media",
    "course_desc": "This computing course explores the foundations of building a presence on the Web, developing an entity’s brand and creating a social channel to share ideas, expertise and business philosophies. Topics covered: choosing a domain name, securing a content hosting service, initiating content creation, and constructing a social web channel.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 121,
    "course_title": "Computing Topics",
    "course_desc": "This course covers current computing topics. The course is designed to have variable credits to coincide with the rigor of the topic. Maybe repeated up to 6 credits with different topics. A course description will be on record to designate the various topics for a student’s transcript.",
    "num_units": "1 - 4",
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: TBA based on course topic.; Lecture Hours: 1"
  },
  {
    "course_prefix": "ICS",
    "course_number": 123,
    "course_title": "Introduction to Digital Audio and Video Production",
    "course_desc": "This is an introductory course covering concepts and skills of working with digital audio and video including recording, editing and publishing online.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 129,
    "course_title": "Introduction to Databases",
    "course_desc": "This course covers the fundamental concepts in database technology, including storage structures, access methods, recovery, concurrency, and integrity. The relational model and its implementation will be covered in depth together with an overview of SQL and its role in application development. The course will also present an overview of database administration, including modeling and design activities. A substantial part of the course involves the development of an understanding of database concepts.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 141,
    "course_title": "Discrete Mathematics for Computer Science I",
    "course_desc": "This course covers logic, sets, functions, matrices, algorithmic concepts, mathematical reasoning, recursion, counting techniques, and probability theory.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 103 or placement into MATH 135 or higher, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 171,
    "course_title": "Introduction to Computer Security",
    "course_desc": "Examines the essentials of computer security, including risk management, the use of encryption, activity monitoring, intrusion detection; and the creation and implementation of security policies and procedures to aid in security administration.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: ICS 184 with a C or better, or concurrent enrollment, or consent of the instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 184,
    "course_title": "Introduction to Networking",
    "course_desc": "This course provides the student with the knowledge and skills to manage, maintain, troubleshoot, install, operate and configure basic network infrastructure, as well as to describe networking technologies, basic design principles, and adhere to wiring standards and use testing tools. The course also introduces the student to network security concepts.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": "193V",
    "course_title": "Cooperative Education/Internship/Practicum",
    "course_desc": "Cooperative program between the student, an employer, and the College that integrates classroom learning with supervised practical experience. Reflects the student’s major interest area and availability of job assignments. Offers the opportunity to develop workplace employability skills dependent on job assignments and course of study.",
    "num_units": "1-3",
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Various as determined by the particular course of study and placement of the cooperative education/internship practicum in the sequence of courses.; Lecture Hours: 1"
  },
  {
    "course_prefix": "ICS",
    "course_number": 203,
    "course_title": "Digital Image Editing",
    "course_desc": "Introduction to the terminology, tools, features and techniques of digital image editing.",
    "num_units": 3,
    "dept_name": "Information and Computer Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 207,
    "course_title": "Building Web Applications",
    "course_desc": "Web Applications introduces programming for the web. Topics include: problem solving; web interactivity for websites; building applications with web authoring languages for markup, styling and scripting; presenting applications for mobile devices.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Students must have HTML and CSS experience.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 211,
    "course_title": "Introduction to Computer Science II",
    "course_desc": "Reinforce and strengthen problem-solving skills using abstract data types and introduce software development practices. Emphasize the use of searching and sorting algorithms and their complexity, recursion, object-oriented programming, and data structures.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in ICS 111 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 212,
    "course_title": "Program Structure",
    "course_desc": "Program organization paradigms, programming environments, implementation of a module from specifications, the C and C++ programming languages.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ICS 211 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 215,
    "course_title": "Introduction to Scripting",
    "course_desc": "Introduction to scripting languages for the integration of applications and systems. Scripting in operating systems, web pages, server-side application integration, regular expressions, event handling, input validation, selection, repetition, and parameter passing for languages such as Perl, JavaScript, PHP, Python, and/ or shell scripting.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ICS 211 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 240,
    "course_title": "Operating Systems",
    "course_desc": "This course introduces students to various aspects of Operating Systems. This course examines and explores the structure, basic functionality, administration, troubleshooting, and installation of operating systems and related applications. Advanced topics include scripting, operating system security, maintenance and services.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ICS 111.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 241,
    "course_title": "Discrete Mathematics for Computer Science II",
    "course_desc": "Includes program correctness, recurrence relations and their solutions, divide and conquer relations, graph theory, trees and their applications, Boolean algebra, introduction to formal languages and automata theory.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ICS 141 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 281,
    "course_title": "Ethical Hacking",
    "course_desc": "This course covers basic ethical hacking techniques also known as white hat hacking. It stresses the moral and legal issues about hacking and how these techniques can be used to defend against attacks as well as to perform authorized system security evaluation testing.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ICS 171, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ICS",
    "course_number": 282,
    "course_title": "Computer Forensics",
    "course_desc": "This course covers basic computer forensics including operating system diagnostics, the use of forensic toolkits to examine and validate computer activity and techniques for the proper collection, examination and preservation of forensic evidence.",
    "num_units": 3,
    "dept_name": "ICS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ICS 171, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": 103,
    "course_title": "Introduction to College",
    "course_desc": "This course offers strategies for success in college and life-long learning. It emphasizes understanding yourself, setting and attaining goals, critical thinking, effective communication, relationship building, study habits and skills, time management, college resources, and setting your foundation to succeed. Students will participate in and lead classroom learning through discussions, readings, writing assignments, group activities, and hands-on experiences.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": "105B",
    "course_title": "Career Decision Making",
    "course_desc": "An introductory course designed to prepare students to make more focused career/life decisions through self analysis and world of work examinations.",
    "num_units": 2,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2"
  },
  {
    "course_prefix": "IS",
    "course_number": "105C",
    "course_title": "Professional Employment Preparation",
    "course_desc": "Facilitates employment search by emphasizing professional techniques and standards in the preparation of application forms, resumes, cover letters, and employment interviews.",
    "num_units": 1,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "IS",
    "course_number": 130,
    "course_title": "CSI Hawaii: An Introduction to the Scientific Process Using Forensic Science",
    "course_desc": "This is an interdisciplinary science course that uses forensic science to teach students about the scientific process. It draws chiefly upon biology but also incorporates elements of chemistry, mathematics, and physics. Topics covered include the biology of mammals (including humans), anatomy and physiology of select body systems, types of forensic evidence, latent fingerprints, blood typing, and blood spatter analysis, osteology, hair and fiber analysis, fluorescence of bodily fluids, and ballistics. This is a non-majors class intended for students who have an interest in forensic science and wish to satisfy DB and DY requirements for the AA degree. It is not intended for forensic science majors.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ENG 100 and MATH 100 or higher; Lecture Hours: 2; Lab Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": 201,
    "course_title": "The Ahupua‘a",
    "course_desc": "Study of the traditional Hawaiian approaches to natural resource development, utilization, exploitation, and management. The ahupua’a, as the traditional Hawaiian unit of land and sea subdivision, beginning in the upland forests, stretching across lower elevations, past the shoreline to the edge of the reef, will be evaluated as a microcosm of an integrated ecosystem and as a model for natural resource management and sustainability.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Pre: BIOL 101 or BIOL 124 or similar preparation.; Lecture Hours: 2; Lab Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": 204,
    "course_title": "Themes in Popular Culture",
    "course_desc": "An interdisciplinary study of a specific event, person, idea, or process in popular culture which will bring together various methodologies and conceptual tools to create a complex analysis. Topics covered will include: the concept of popular culture, how elements of popular culture are created and circulated, how elements of popular culture connect to historical, political, social, symbolic and intellectual history, how different groups in society are related to the elements of popular culture, and how popular culture plays a role in the lives of individuals.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": 207,
    "course_title": "Research in Sustainability",
    "course_desc": "IS 207 offers a research experience in sustainability, drawing upon the natural sciences, social science, humanities, Hawaiian studies, language arts, mathematics, or other disciplines. This is a research-based course emphasizing the application of scholarly methods to a specific project. Repeatable for up to 6 credits.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": 231,
    "course_title": "The Zombie Apocalypse & Other Doomsday Beliefs in Popular Culture",
    "course_desc": "An interdisciplinary study of the zombie apocalypse and other doomsday beliefs in popular culture which will bring together various methodologies and conceptual tools to create a complex analysis. Topics covered will include: the concept of apocalyptic beliefs in popular culture; how apocalyptic beliefs are created and circulated in popular culture; how elements of apocalyptic beliefs in popular culture connect to historical and contemporary philosophical, religious, political, and psychological issues; how different groups and individuals in history and contemporary society relate to apocalyptic beliefs.",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "IS",
    "course_number": "295A",
    "course_title": "Hawaiian Knowledge Innovation Capstone",
    "course_desc": "This is a capstone project course for the Academic Subject Certificate in Hawaiian Knowledge Innovation. Students enrolled in this ASC program will apply knowledge they have learned from both their Information and Computer Science and Hawaiian Studies Classes to develop and finish an independent technology based project using a Hawaiian theme and Hawaiian cultural content. Students will work with two faculty members, one from the Hawaiian Studies/Hawaiian Language disciplines, and one from the Information and Computer Sciences discipline to develop their project. Students can work both individually and in small groups depending on capstone enrollment and faculty approval on a case-by-case basis. Students will be required to meet with faculty mentors regularly throughout the semester. Students will be required to track weekly hours spent on research and project development. (3 hours cooperative education)",
    "num_units": 3,
    "dept_name": "IS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor Consent"
  },
  {
    "course_prefix": "JPN",
    "course_number": 101,
    "course_title": "Elementary Japanese I",
    "course_desc": "An introductory course focusing on grammar and vocabulary sufficient to maintain conversation at the elementary level and on the three writing systems: hiragana, katakana, and kanji.",
    "num_units": 4,
    "dept_name": "JPN",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 4"
  },
  {
    "course_prefix": "JPN",
    "course_number": 102,
    "course_title": "Elementary Japanese II",
    "course_desc": "A continuation of JPN 101 focusing on additional grammar topics and increased vocabulary to maintain conversation at the elementary level and on the three writing systems: hiragana, katakana, and kanji.",
    "num_units": 4,
    "dept_name": "JPN",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for JPN 101 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "JPN",
    "course_number": 108,
    "course_title": "Basic Japanese Conversation",
    "course_desc": "Elementary-level conversational Japanese to develop speaking and understanding of Japanese culture. This is a course recommended for people who deal with or are interested in things concerning Japan.",
    "num_units": 3,
    "dept_name": "JPN",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "JPN",
    "course_number": 201,
    "course_title": "Intermediate Japanese I",
    "course_desc": "A continuation of JPN 102 focusing on additional grammar topics and increased vocabulary to maintain conversation at the intermediate level and on the three writing systems: hiragana, katakana, and kanji.",
    "num_units": 4,
    "dept_name": "JPN",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for JPN 102 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "JPN",
    "course_number": 202,
    "course_title": "Intermediate Japanese II",
    "course_desc": "A continuation of JPN 201 focusing on additional grammar topics and increased vocabulary to maintain conversation with greater proficiency at the intermediate level and on the three writing systems: hiragana, katakana, and kanji.",
    "num_units": 4,
    "dept_name": "Japanese Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for JPN 201 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "JOUR",
    "course_number": 150,
    "course_title": "Media and Society",
    "course_desc": "The role of the media in contemporary society, including development, influence, rights, responsibilities, issues and trends - with emphasis on the social, political and economic effects.",
    "num_units": 3,
    "dept_name": "Journalism",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "JOUR",
    "course_number": 200,
    "course_title": "Introduction to Multimedia Journalism",
    "course_desc": "Fundamentals of multimedia journalism including reporting stories that include photography, audio, graphics and video that can be combined into the ideal online package.",
    "num_units": 3,
    "dept_name": "Journalism",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "JOUR",
    "course_number": 250,
    "course_title": "Media Writing",
    "course_desc": "An introductory course in reporting and writing news stories for delivery to different media, including print, online media and video.",
    "num_units": 3,
    "dept_name": "JOUR",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "JOUR",
    "course_number": 270,
    "course_title": "Introduction to Multimedia Storytelling",
    "course_desc": "Fundamentals of multimedia storytelling using video, audio and photography to report and produce news and documentary stories for the web and other distribution platforms.",
    "num_units": 3,
    "dept_name": "JOUR",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in JOUR 150 or JOUR 250 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "JOUR",
    "course_number": 286,
    "course_title": "Multimedia News Production",
    "course_desc": "Students will develop intermediate skills in video journalism and produce video and multimedia news stories about campus and community events and issues for publication on the Ka ‘Ohana website and other distribution platforms. Repeatable for up to 6 credits. (Crosslisted as CM 286.)",
    "num_units": 3,
    "dept_name": "JOUR",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for CM 120 or JOUR 120; or consent of instructor.; Lecture Hours: 2"
  },
  {
    "course_prefix": "JOUR",
    "course_number": "287V",
    "course_title": "Newspaper Production",
    "course_desc": "Complete production of the student newspaper Ka‘Ohana, including reporting, writing, layout, editing, photography, web and social media. Repeatable for up to 6 credits.",
    "num_units": "1-3",
    "dept_name": "Journalism",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in ENG 100 and credit for or registration in JOUR 205 or 250; or consent of instructor. NOTE: credits are variable 1 to 3 credits.; Lecture Hours: 1"
  },
  {
    "course_prefix": "LSK",
    "course_number": 110,
    "course_title": "College Study Skills",
    "course_desc": "This course assists students to deal more effectively with the rigors of the academic expectations of college. Students will carefully assess their work habits, attitudes, and learning styles and will learn specific strategies to achieve academic success.",
    "num_units": 3,
    "dept_name": "Unspecified",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement in ENG 21 or ENG 23 or higher or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "LING",
    "course_number": 102,
    "course_title": "Introduction to Language",
    "course_desc": "An investigation of the nature and function of language, its sounds, structures and semantics, oral and written expression, acquisition and change. General linguistic principles applicable to all languages will be covered. We will learn ways of talking about language that will enable us to discuss language and understand what linguists do and say.",
    "num_units": 3,
    "dept_name": "Linguistics",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ENG 22 or ENG 23 or higher or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MGT",
    "course_number": 120,
    "course_title": "Principles of Management",
    "course_desc": "This course is a practical introduction to and study of management principles and practices. The student will learn the elements needed to manage effectively as well as better understand the decision making process in business.",
    "num_units": 3,
    "dept_name": "Management",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": "75X",
    "course_title": "Introduction to Mathematical Reasoning",
    "course_desc": "This course prepares students for MATH 100, MATH 101, MATH 111, and MATH 115. Course topics include ratio and percent, unit conversion, graphs, data interpretation, basic algebra, solving linear equations, and working with formulas with special emphasis on pattern recognition and problem solving. Additional topics may include set theory, inequalities, and quadratics.",
    "num_units": 4,
    "dept_name": "Math",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 4"
  },
  {
    "course_prefix": "MATH",
    "course_number": 78,
    "course_title": "College Math Companion",
    "course_desc": "This course provides students concurrently enrolled in MATH 100, MATH 101, MATH 111, or MATH 115 with Just-In-Time support with special emphasis on pattern recognition and problem solving. Course topics are tailored to the concurrent course and may include ratio and percent, unit conversion, graphs, data interpretation, basic algebra, solving linear equations, and working with formulas. (Grading is CR/NC)",
    "num_units": 1,
    "dept_name": "Math",
    "inst_ipeds": 141990,
    "metadata": "Pre: Satisfactory Placement Score; Lecture Hours: 1"
  },
  {
    "course_prefix": "MATH",
    "course_number": 82,
    "course_title": "Algebraic Foundations",
    "course_desc": "This course covers elementary algebra topics. Topics include linear equations and inequalities, graphing, linear systems, properties of exponents, operations on polynomials, factoring, rational and radical expressions and equations, quadratic equations, and applications.",
    "num_units": 4,
    "dept_name": "Math",
    "inst_ipeds": 141990,
    "metadata": "Pre: Satisfactory Placement, or a Grade of “C” or better in Math 21, Math 21B, Math 24, Math 28, or Math 75X.; Lecture Hours: 4"
  },
  {
    "course_prefix": "MATH",
    "course_number": 88,
    "course_title": "College Algebra Companion",
    "course_desc": "Math 88 provides students with supplemental algebra instruction that directly supports the topics covered in Math 103. (Grading is CR/NC)",
    "num_units": 2,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Satisfactory Placement Score; Lecture Hours: 2"
  },
  {
    "course_prefix": "MATH",
    "course_number": 100,
    "course_title": "Survey of Mathematics",
    "course_desc": "An introduction to quantitative and logical reasoning for the nonscience/nonmathematics major. The question, “What is mathematics?” is explored, while focusing on mathematical systems or models, cultivating an appreciation for mathematics as an aesthetic art, and developing skills in problem-solving and analysis.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in MATH 25, 26, 28, 29, 75X or higher or equivalent; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 101,
    "course_title": "Mathematics for Veterinary Assistants & Technicians",
    "course_desc": "An introduction to clinical calculations used in veterinary medicine. Topics include the application of mathematical skills to solve applied problems in veterinary nursing and pharmaceutical dispensing with emphasis on dosage, concentration, dilution and drip rates. Also included is mathematical and laboratory terminology. This course is intended for students entering veterinary technology, veterinary assisting or other animal-related fields.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MATH 25, 26, 28, 29, 75X or higher or equivalent, satisfactory math placement test score.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 103,
    "course_title": "College Algebra",
    "course_desc": "Linear equations, inequalities, systems of equations, polynomials, functions, fractional expressions and equations, exponents, powers, roots, quadratic equations and functions; rational, exponential and logarithmic functions.",
    "num_units": 4,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in MATH 25, 26, 29, 82 or equivalent; Lecture Hours: 4"
  },
  {
    "course_prefix": "MATH",
    "course_number": 111,
    "course_title": "Mathematics for Elementary Teachers I",
    "course_desc": "Math 111 is the first of a two-course sequence designed to give prospective elementary education majors the depth of understanding necessary to teach mathematics in the elementary classroom. Topics include number (natural numbers, integers, fractions, and real numbers) and operations, sets, patterns, functions and algebra. Emphasis will be on communication, connections and problem solving, representations, and reasoning and proof.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in Math 25, 26, 28, 29, 75X, or higher or equivalent, satisfactory math placement test, and grade of C or better in ENG 22 or ENG 23 or placement in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 112,
    "course_title": "Mathematics for Elementary Teachers II",
    "course_desc": "Math 112 is the second of a two-course sequence designed to give prospective elementary education majors the depth of understanding necessary to teach mathematics in the elementary classroom. Topics include the representation of and operations on the natural numbers and properties of those operations. Emphasis will be on communication, connections and problem solving, representation and reasoning.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 111.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 115,
    "course_title": "Introduction to Statistics and Probability",
    "course_desc": "Utilizes basic statistical topics including measures of central tendency and dispersion, classification of variables, sampling techniques, elementary probability, normal and binomial probability distributions, tests of hypothesis, linear regression and correlation in order to solve problems.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in Math 25, 26, 28, 29, 75X or higher or equivalent, satisfactory math placement test score, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 135,
    "course_title": "Precalculus: Elementary Functions",
    "course_desc": "Investigates linear, quadratic, polynomial, rational, exponential, logarithmic functions, and related topics. This course is the first part of the precalculus sequence",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 103 or equivalent, satisfactory math placement test score, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 140,
    "course_title": "Precalculus: Trigonometry and Analytic Geometry",
    "course_desc": "Studies trigonometric functions, analytic geometry, polar coordinates, vectors, and related topics. This course is the second part of the precalculus sequence.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 135 or equivalent, satisfactory math placement test score, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 203,
    "course_title": "Calculus for Business and the Social Sciences",
    "course_desc": "Basic mathematical concepts, topics in differentiation and introductory integration of algebraic, exponential and logarithmic functions. Related applications to management, finance, economics and social science will be considered.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “B” or better in MATH 103, “C” or better in MATH 135 or equivalent, satisfactory math placement test score or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 241,
    "course_title": "Calculus I",
    "course_desc": "Basic mathematical concepts, topics in differentiation, and introductory integration of algebraic and trigonometric functions. Applications of differentiation and integration will be demonstrated. Formerly MATH 205.",
    "num_units": 4,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 140 or equivalent, satisfactory math placement test score, or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "MATH",
    "course_number": 242,
    "course_title": "Calculus II",
    "course_desc": "Differentiation and integration concepts of trigonometric, exponential, logarithmic and hyperbolic functions. Integration implements, infinite series, and applications of derivatives and integrals are also featured. Formerly MATH 206.",
    "num_units": 4,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 205 or MATH 241 or equivalent or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "MATH",
    "course_number": 243,
    "course_title": "Calculus III",
    "course_desc": "Vector algebra, vector-valued functions, differentiation in several variables, and optimization. Formerly MATH 231.",
    "num_units": 3,
    "dept_name": "MATH",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MATH 206 or MATH 242 or equivalent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MATH",
    "course_number": 244,
    "course_title": "Calculus IV",
    "course_desc": "Math 244 is the fourth course in the calculus sequence. Topics include multiple integrals, line integrals, Green’s Theorem, surface integrals, Stokes’ Theorem, Gauss’ Theorem and differential equations. Formerly MATH 232.",
    "num_units": 3,
    "dept_name": "Math",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in Math 231 or MATH 243 or equivalent or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MICR",
    "course_number": 130,
    "course_title": "General Microbiology",
    "course_desc": "Fundamentals of microbiology, growth, development, and classification of bacteria, viruses, protozoa, fungi and algae; roles of microorganisms in the environment and human affairs: medical microbiology, immunology, and applied microbiology for food sanitation and public health.",
    "num_units": 3,
    "dept_name": "Microbiology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MICR",
    "course_number": "140L",
    "course_title": "General Microbiology Lab",
    "course_desc": "Laboratory course illustrating fundamental techniques and concepts of microbiology, such as microscopic observations, aseptic transfer, microorganism classification and identification, environmental factors influencing microorganisms, biochemistry of microorganisms, ecological microbiology, and medical microbiology. This course is designed to complement MICR 130. Primarily for students in Agripharmatech, nursing, dental hygiene and nutrition. Science laboratory course.",
    "num_units": 2,
    "dept_name": "Microbiology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in MICR 130; placement into Math 24, 25, 26, 28, 29, 82 or higher.; Lab Hours: 4"
  },
  {
    "course_prefix": "MUS",
    "course_number": 106,
    "course_title": "Intro to Music Literature",
    "course_desc": "Elements, styles, and forms of music, from the listener’s standpoint. Focus on classical music literature. Concert attendance and written critique required for two live performances during semester.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 107,
    "course_title": "Music in World Cultures",
    "course_desc": "Music as organized sound and as a cultural object. Role of music in various societies: ancient and modern, sophisticated and non-sophisticated, child and adult, Western and non-Western. Representative styles and regional characteristics viewed in terms of musical characteristics and related cultural factors; a conceptual introduction to music and culture. Attendance at one ethnic performance is required.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 108,
    "course_title": "Music Fundamentals",
    "course_desc": "A basic music theory course. Emphasis on learning basic concepts involved in reading and writing music. Notation and reading of simple and compound rhythm, pitch, intervals and triads. Application to performance.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 114,
    "course_title": "College Chorus",
    "course_desc": "Rehearsal and performance of choral literature. Open to all students. No previous choral experience required. Attendance at class concerts is required. Repeatable for up to 8 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121B",
    "course_title": "Voice 1",
    "course_desc": "Performance class in vocal production and literature for voice. No previous vocal training required. Repeatable for up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121C",
    "course_title": "Piano 1",
    "course_desc": "Basic principles of performance. Relevant problems in piano literature at elementary level. MUS 121C, 122C must be taken in sequence. May be repeated up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: MUS 121C, 122C must be taken in sequence; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121D",
    "course_title": "Guitar 1",
    "course_desc": "Basic principles of classical guitar performance; relevant problems in literature. Repeatable for up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121F",
    "course_title": "Slack Key Guitar 1",
    "course_desc": "Basic principles of performance; relevant problems in literature. Student learns to play two slack key tunings. This course is intended for students with little or no background in this style of guitar playing. Ability to read music is not required. May be repeated up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121G",
    "course_title": "Hawaiian Steel Guitar 1",
    "course_desc": "Introductory course in Hawaiian Steel guitar. Basic principles of performance; history and development of the steel guitar and playing methods. Focus on principles of performance. The course is intended for students with little or no experience in playing the ukulele. May be repeated for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121H",
    "course_title": "Hawaiian Singing",
    "course_desc": "This class is a performance and history course that focuses on different Hawaiian singing styles and qualities of voice. May be repeated up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121Z",
    "course_title": "‘Ukulele 1",
    "course_desc": "Introductory course in ‘ukulele. Basic principles of performance; history and development of ‘ukulele playing methods. Focus on principles of performance. Course is intended for students with little or no experience in playing the ukulele. May be repeated for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122B",
    "course_title": "Voice 2",
    "course_desc": "Performance class in vocal production and literature for voice. Class is designed for students with previous vocal experience or training. May be repeated up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 121B or consent of instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122C",
    "course_title": "Piano 2",
    "course_desc": "Designed for further study of principles and basic skills of piano performance established in first semester piano. Continues the group participation chord approach with greater emphasis on ensemble playing and improvisation. MUS 121C and 122C must be taken in sequence. Repeatable for up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 121C or consent of the instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122D",
    "course_title": "Intermediate Classical Guitar",
    "course_desc": "Continuation of MUS 121D. Increased emphasis on guitar literature. Recommended that students register for MUS 101 concurrently.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MUS 121D or consent of instructor.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122F",
    "course_title": "Slack Key Guitar 2",
    "course_desc": "Intermediate slack key guitar: level I. Student learns to play solos in C tunings and intermediate solos at level I in tunings learned in the elementary class. May be repeated up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MUS 121F or consent of instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122H",
    "course_title": "Hawaiian Singing 2",
    "course_desc": "This class is a performance and history course that focuses on different Hawaiian singing styles and qualities of voice at an intermediate level. May be repeated up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 121H or instructor consent.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122Z",
    "course_title": "‘Ukulele 2",
    "course_desc": "Continuation of MUS 121Z. Increased emphasis on ‘ukulele literature. Focus on principles of performance. Emphasis on ensemble playing. Repeatable for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in MUS 121Z or consent of instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "130F",
    "course_title": "Slack Key Guitar Ensemble",
    "course_desc": "Continuation of Music 122F. Increased emphasis on slack key literature, techniques, and tunings. Advanced intermediate techniques of slack key guitar as applied to ensemble playing.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MUS 122F."
  },
  {
    "course_prefix": "MUS",
    "course_number": 140,
    "course_title": "Introduction to Audio Production",
    "course_desc": "Introduction to the process of audio engineering for live concerts and performances. Students learn the proper usage of audio production tools in both the analog and digital formats through lecture and hands-on projects. May be repeated for up to 6 credits.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 166,
    "course_title": "Popular Music in America",
    "course_desc": "A survey of Pop Music (including Blues, Jazz, Rock and Folk), in the United States in the twentieth century. Activities will include listening to recordings, writing lyrics and tunes and learning various aspects of the business of music. Fieldtrips and concert attendance required.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 177,
    "course_title": "Intro to Hawaiian Music",
    "course_desc": "A survey of Hawaiian music from Polynesian origins and pre- contact traditional forms to acculturated and contemporary forms and expressions including vocal, instrumental and dance music in their social, cultural and religious contexts.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 211,
    "course_title": "Intro to Hawaiian Ensemble",
    "course_desc": "Performance of Hawaiian music for groups of various sizes at an introductory level. Exploration of basic principles of history and development of ensemble performance. Students learn to play while singing. Ability to read music is not required. Repeatable up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 121Z, MUS 121F, MUS 121D, OR by instructor consent.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": 212,
    "course_title": "Polynesian Music",
    "course_desc": "Performance of Polynesian music for groups of various sizes. Exploration of basic principles, histories, and techniques for different Polynesian styles of music. Students learn to play while singing. Ability to read music is not required. Repeatable up to 6 credits. (1 hour lecture, 2 hour lecture/lab)",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 121Z, MUS 121F, MUS 121D, or MUS 211; or by instructor consent.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "221C",
    "course_title": "Piano 3",
    "course_desc": "Continuation of MUS 122C. Increased emphasis on piano literature up to the intermediate level. Repeatable for up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 122C or consent of the instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "221F",
    "course_title": "Slack Key 3",
    "course_desc": "Continuation of MUS 122F. Increased emphasis on Slack Key literature up to the intermediate level. Repeatable for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in MUS 122F or MUS 211.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "221Z",
    "course_title": "'Ukulele 3",
    "course_desc": "Continuation of MUS 122Z. Increased emphasis on ‘Ukulele literature up to the intermediate level. Repeatable for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in MUS 122Z or MUS 211.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "222C",
    "course_title": "Piano 4",
    "course_desc": "Continuation of MUS 221C. Increased emphasis on piano technique and literature up to the intermediate level. Introduction to accompanying. Repeatable for up to 4 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in MUS 221C or consent of the instructor.; Lecture Hours: 1"
  },
  {
    "course_prefix": "MUS",
    "course_number": "222F",
    "course_title": "Slack Key 4",
    "course_desc": "Continuation of MUS 221F. Increased emphasis on Slack Key literature up to the advanced level. Repeatable for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in MUS 221F.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "222Z",
    "course_title": "'Ukulele 4",
    "course_desc": "Continuation of MUS 221Z. Increased emphasis on ‘ukulele literature up to the advanced level. Repeatable for up to 6 credits.",
    "num_units": 2,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in MUS 221Z.; Lecture Hours: 1; Lab Hours: 2"
  },
  {
    "course_prefix": "MUS",
    "course_number": "231B",
    "course_title": "Applied Music, Western (Voice)",
    "course_desc": "This course provides individual instruction in vocal performance. The course covers intermediate vocal technique paced to an appropriate level for each student’s experience. Applied Voice is a performance class. The emphasis will be toward developing vocal technique that focuses on breath technique, expression, movement, clarity, dynamics, diction and musicianship. May be repeated up to 4 credits. (1 hour individual instruction)",
    "num_units": "1-6",
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "MUS",
    "course_number": "231C",
    "course_title": "Applied Music, Western (Piano)",
    "course_desc": "This course provides individual instruction in piano performance, covering intermediate and advanced piano technique paced to an appropriate level for each student’s experience. Applied piano instruction is a performance class. The emphasis will be toward developing piano technique that has clarity, flexibility, dynamic intensity, and sensitivity of phrasing for expressive musicianship through increasingly more confident and skillful performances. Pedaling, theory, sight-reading, and learning/ practicing/ memorization/ performing techniques will also be covered. May be repeated up to 4 credits. (1 hour Individual Instruction)",
    "num_units": "1-6",
    "dept_name": "MUS",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "MUS",
    "course_number": "231F",
    "course_title": "Applied Music, Western (Slack Key Guitar)",
    "course_desc": "This course provides individual instruction in slack key guitar. The course covers slack key techniques that are appropriate for the student's experience. Applied slack key guitar is a performance class. The emphasis will be toward developing guitar playing technique that focuses on expression, dynamics, rhythmic stability and musicianship. May be repeated up to 4 credits. (1 hour individual instruction)",
    "num_units": 1,
    "dept_name": "MUS",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "MUS",
    "course_number": "231Z",
    "course_title": "Applied Music, Western ('Ukulele)",
    "course_desc": "This course provides individual instruction in ‘ukulele. The course covers ‘ukulele techniques that are appropriate for the student's level of experience. Applied ‘ukulele is a performance class. The emphasis will be toward developing playing techniques for the ‘ukulele that focus on expression, dynamics, rhythmic stability and musicianship. May be repeated up to 4 credits. (1 hour individual instruction)",
    "num_units": 1,
    "dept_name": "MUS",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "MUS",
    "course_number": 240,
    "course_title": "Introduction to Digital Music",
    "course_desc": "Introduction to digital music and sound production on the Macintosh platform: MIDI sequencing, audio recording, music arranging, editing, mixing and mastering; preparing audio files for CD, video and web applications; sound synthesis and programming using virtual instruments. (Cross-listed as CM 240.)",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: MUS 108, 121 (alpha) or 253; or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 241,
    "course_title": "Digital Music Production II",
    "course_desc": "Continuation of principles and skills introduced in MUS 240. Digital music composition and audio production on the Macintosh platform with emphasis on advanced MIDI and mixing techniques, audio editing, sound synthesis, and programming of virtual instruments and effects.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: MUS 240 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 253,
    "course_title": "Elementary Music in Action",
    "course_desc": "Deals with musical concepts, philosophy & pedagogy; the use of media, singing, movement, and instruments; and resources for an active elementary classroom. Presents correlation between music and brain development in early childhood. Intended for Education majors. Music is a vital stimulus to the developmental process and contributes to the emergence of positive self-esteem. Elementary education candidates learn to apply appropriate strategies in order to provide music making as part of everyday classroom activities.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 277,
    "course_title": "Mele, Mo‘olelo, and Motion",
    "course_desc": "This is a music class that focuses on Hawaiian songs, the stories that accompany those songs, and how the motions of the hula interact with both the lyrics and the stories. May be repeated up to 6 credits.",
    "num_units": "3-6",
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 280,
    "course_title": "Basic Theory and Aural Skills",
    "course_desc": "Basic Theory and Aural Skills develops students’ skills in music reading and music perception through notation, sight singing and dictation exercises. Students learn how to notate simple rhythms in simple and compound time; learn to recognize intervals, scales, triads, seventh chords and harmonic functions; and learn how to analyze non-modulating harmonic progressions in root position.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MUS 108; Lecture Hours: 3"
  },
  {
    "course_prefix": "MUS",
    "course_number": 296,
    "course_title": "Special Topics in Music",
    "course_desc": "Students will investigate important topics in music, such as specific people, genres, or periods. Classes may include a performance component. Specific course information will be made available in the schedule of classes. May be repeated up to 9 credits with different topics.",
    "num_units": 3,
    "dept_name": "Music",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": 155,
    "course_title": "Nā Limu Hawai‘i: Hawaiian Seaweeds and their Uses",
    "course_desc": "An introduction to Hawaiian Limu biology, ecology, and diversity. Students will learn about the historical, current, and potential uses of Limu and choose a species to research. An introduction to Limu groups (red, green and brown) and sustainable cultivation. Students will learn about the cultural significance and history of Limu in Hawai‘i.",
    "num_units": 3,
    "dept_name": "Natural Sciences",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "HWST",
    "course_number": "155L",
    "course_title": "Nā Limu Hawai‘i: Hawaiian Seaweeds and their Uses Lab",
    "course_desc": "Students will study the various morphologies of local limu species and learn basic limu hatchery and farming techniques such as tumble culture or attached cultivation methods. Hands-on experience in the cultivation, and instruction in the equipment necessary to monitor and manage the cultivation system will take place in the hands-on laboratory. Students are introduced to media preparation, sterile technique, various Limu cultivation methods, and stereomicroscopy. Students will learn seeding techniques for re-planting Limu in critical habitats. Additionally, some lab skills such as DNA extraction/sequencing, and lipid extractions will be covered.",
    "num_units": 1,
    "dept_name": "Natural Sciences",
    "inst_ipeds": 141990,
    "metadata": "Pre: Completed or concurrently enrolled in HWST 155.; Lab Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": 101,
    "course_title": "Introduction to the Marine Option Program",
    "course_desc": "This course provides an overview of statewide issues and organizations involved with ocean and freshwater activities, including management, education, research and business. It also provides an orientation to the Marine Option Program (MOP) and reviews the requirements of the MOP certificate. The course explores opportunities for internships, projects and careers related to water environments. The course will present guidelines on proposal writing, project implementation, data collection and interpretation, and final report preparation and presentation. This course is taught via HITS interactive television with participation of students and faculty throughout the UH system.",
    "num_units": 1,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Pre: “C” or better in MATH 24, 25, 26, 28, 29, 75X or higher.; Lecture Hours: 1"
  },
  {
    "course_prefix": "OCN",
    "course_number": 102,
    "course_title": "Introduction to the Environment and Sustainability",
    "course_desc": "This course will introduce students to the basic principles of environmental science and sustainability as they apply to analysis of environmental systems on a global scale. The integrated natures of ocean, terrestrial and atmospheric systems will be introduced by first introducing the Earth’s major ecosystems and then discussing their coupled integration. The concepts of sustainability will be infused into the course with an emphasis on the importance of sustaining resources and mitigating pollution to ecosystems. This issue of sustainability will be approached from the perspective of the impact that 9 billion or more people will impose upon the planets resources and ecosystems. Similarly, this course will include the concepts of sustainability with Native Hawaiian culture and indigenous knowledge.",
    "num_units": 3,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": 120,
    "course_title": "Global Environmental Challenges",
    "course_desc": "Scientific approach to evaluating human-caused environmental challenges and their potential solutions.",
    "num_units": 3,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": 201,
    "course_title": "Science of the Sea",
    "course_desc": "An introductory course to oceanography covering the dimensions of the science of oceanography, the physical and chemical properties of sea water, waves, tides, currents, life in the ocean, and the geologic structure of the ocean floor, environmental concerns, and human use of the oceans.",
    "num_units": 3,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": "201L",
    "course_title": "Science of the Sea Lab",
    "course_desc": "Experiments, computer exercises and field trips demonstrating the geological, physical, chemical and biological principles, and equipment, of earth and ocean sciences.",
    "num_units": 1,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in OCN 201 or equivalent preparation or consent of instructor.; Lab Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": 260,
    "course_title": "Pacific Surf Science and Technology",
    "course_desc": "Pacific Surf Science and Technology is a lecture-based course that showcases scientific and industry aspects of the surfing world for surfers and non-surfers. The course takes a scientific approach to understanding the natural processes that create and influence Waves and surf conditions, while also introducing many ocean safety concepts relating to the environment and the popularity of ocean recreation. A weather and surf journal along with weekly campus field excursions dedicated to studying weather phenomena adds an essential experiential component to the course.",
    "num_units": 3,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "OCN",
    "course_number": "260L",
    "course_title": "O‘ahu Surf Science and Technology Lab",
    "course_desc": "OCN 260L is a field lab designed to run concurrently with OCN 260, Pacific Surf Science and Technology. The course presents the surfing world through laboratory and field activities, including surfing demonstrations and instruction, learning water safety techniques, studying board design at surfboard manufacturing shops, and speaking with local industry professionals. Meteorology and surf forecasting techniques are covered through on site weather observation activities, and physical processes involved in shaping waves as they approach a shoreline will be examined through several coastal studies.",
    "num_units": 1,
    "dept_name": "Oceanography",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in OCN 260.; Lab Hours: 3"
  },
  {
    "course_prefix": "PACS",
    "course_number": 108,
    "course_title": "Pacific Worlds: an Introduction to Pacific Islands Studies",
    "course_desc": "This course situates Hawai‘i in the larger context of Oceania and exposes students to issues, themes, values, and practices across the region. It also introduces students to the geography, societies, histories, cultures, and arts of Oceania, including Hawai‘i. This course combines lecture and discussion that emphasize Pacific Islander perspectives and experiences.",
    "num_units": 3,
    "dept_name": "Pacific Islands Studies",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHRM",
    "course_number": 203,
    "course_title": "General Pharmacology",
    "course_desc": "Covers a wide range of drugs with emphasis on sites and mechanism of action, toxicity, fate and uses of major therapeutic agents. This course is intended for students in nursing and allied health fields.",
    "num_units": 3,
    "dept_name": "Pharmacology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ZOOL 141 and ZOOL 142.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 100,
    "course_title": "Introduction to Philosophy: Survey of Problems",
    "course_desc": "Great philosophical issues, theories, and controversies. Course will focus on issues such as the problem of determinism, the problem of induction, the problem of distributive justice, the problem of the highest good, and the problem of the function of government.",
    "num_units": 3,
    "dept_name": "Philosophy",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 101,
    "course_title": "Introduction to Philosophy: Morals and Society",
    "course_desc": "Social and individual values, obligations, rights, and responsibilities. Course will cover normative theories and their applications to business, medicine, ethics and sexual relations.",
    "num_units": 3,
    "dept_name": "PHIL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 102,
    "course_title": "Introduction to Asian Philosophy: Asian Traditions",
    "course_desc": "Introductory course in selected schools of Asian thought. Universal issues/problems examined from Asian perspective. Focus will be on Indian, Chinese, and Japanese traditions.",
    "num_units": 3,
    "dept_name": "PHIL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 110,
    "course_title": "Introduction to Logic",
    "course_desc": "A study of the foundations and development of rational thought and communication and their applications. Includes analysis of deductive reasoning, formal and informal fallacies, and the use of symbolic systems.",
    "num_units": 3,
    "dept_name": "PHIL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 111,
    "course_title": "Introduction to Inductive Logic",
    "course_desc": "Introduction to the theory of arguments based on probabilities and to the theory of decision-making in the context of uncertainty.",
    "num_units": 3,
    "dept_name": "PHIL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 211,
    "course_title": "Ancient Philosophy",
    "course_desc": "The philosophical traditions of Greece and Rome between the 5th century BCE and the 5th century CE. Important works by four representative figures (two from Classical Greece and two from the Roman tradition).",
    "num_units": 3,
    "dept_name": "Philosophy",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHIL",
    "course_number": 213,
    "course_title": "Modern Philosophy",
    "course_desc": "Introduction to the history of philosophy based on texts or translations of “modern” works, that is works originally written in a modern European language.",
    "num_units": 3,
    "dept_name": "Philosophy",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 122,
    "course_title": "Introduction to Science: Physical",
    "course_desc": "Characteristics of science, historical development of scientific concepts, and interactions with society illustrated by topics from physical sciences, with emphasis in physics and chemistry. Designed for non-science majors.",
    "num_units": 3,
    "dept_name": "Physics",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit in Math 25, 26, 28, 29, 75X or higher or equivalent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": "122L",
    "course_title": "Introduction to Physical Science Lab",
    "course_desc": "Lab experiments illustrating topics and methods in the Physical Sciences with emphasis in Physics and Chemistry. Designed for nonscience majors.",
    "num_units": 1,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYS 122 or consent of instructor.; Lab Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 151,
    "course_title": "College Physics I",
    "course_desc": "A noncalculus one semester course for preprofessional or nonengineering majors. Study of the basic concepts of physics, including the fundamental principles and theories in mechanics, energy, and waves.",
    "num_units": 3,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in MATH 140 or higher, or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": "151L",
    "course_title": "College Physics I Lab",
    "course_desc": "Experiments in statics, mechanics, energy, waves, and friction.",
    "num_units": 1,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYS 151.; Lab Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 152,
    "course_title": "College Physics II",
    "course_desc": "A noncalculus, one-semester course for pre-professional or nonengineering majors. Study of the basic concepts of physics, including the fundamental principles and theories in electricity, magnetism, optics, and modern physics.",
    "num_units": 3,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for PHYS 151 or equivalent, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": "152L",
    "course_title": "College Physics II Lab",
    "course_desc": "Experiments in electricity, magnetism, optics, and modern physics.",
    "num_units": 1,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYS 152.; Lab Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 170,
    "course_title": "General Physics I",
    "course_desc": "This is the first of a rigorous, calculus-based course in physics for the professional or engineering majors. The study of the concepts of physics including the fundamental principles and theories of mechanics, energy, waves and thermodynamics.",
    "num_units": 4,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MATH 241 (formerly MATH 205) or higher or equivalent or consent of instructor; Lecture Hours: 4"
  },
  {
    "course_prefix": "PHYS",
    "course_number": "170L",
    "course_title": "General Physics I Lab",
    "course_desc": "This laboratory course is a rigorous, calculus-based study for professional or engineering majors. Laboratory exercises are designed to reinforce the fundamental concepts of kinematics, mechanics, energy, waves and thermodynamics.",
    "num_units": 1,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Lab Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 272,
    "course_title": "General Physics II",
    "course_desc": "This is the second in a rigorous, calculus-based physics course for the professional or engineering major. The study of the concepts of physics including the fundamental principles and theories of electricity, magnetism, light, and optical theory.",
    "num_units": 3,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for MATH 242 (formerly MATH 206) or higher or equivalent and a grade of “C” or better in PHYS 170 or consent of instructor; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": "272L",
    "course_title": "General Physics II Lab",
    "course_desc": "This laboratory course is a rigorous, calculus-based study for professional or engineering majors. Laboratory exercises are designed to reinforce the fundamental concepts of electricity, magnetism, light and optical theory.",
    "num_units": 1,
    "dept_name": "PHYS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYS 272.; Lab Hours: 3"
  },
  {
    "course_prefix": "PHYS",
    "course_number": 274,
    "course_title": "General Physics III",
    "course_desc": "This course focuses on the study of physical optics, special relativity, quantum mechanics, solid state physics, atomic and nuclear physics, and elementary particle physics.",
    "num_units": 3,
    "dept_name": "Physics",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for PHYS 272 and PHYS 272L, and credit for or registration in MATH 243 (formerly MATH 231), or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYL",
    "course_number": 141,
    "course_title": "Human Anatomy and Physiology I",
    "course_desc": "PHYL 141 is the first semester of a comprehensive two-semester course which provides a thorough introduction to the structure and function of the human body. PHYL 141 covers the gross anatomy, histology, and physiology of the integumentary, skeletal, muscular, and nervous systems. Students will be expected to learn details of anatomy and physiology as well as applying those details in the broader context of whole body function and homeostasis. The covered topics include body orientation, chemical level, cellular level, tissue level, integumentary system, bone tissue, skeletal system, joints, muscular tissue, muscular system, nervous tissue, spinal cord and spinal nerves, brain and cranial nerves, autonomic nervous system, and special senses. Formerly ZOOL 141.",
    "num_units": 3,
    "dept_name": "Physiology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYL",
    "course_number": "141L",
    "course_title": "Human Anatomy and Physiology I Lab",
    "course_desc": "PHYL 141L is the laboratory course of Human Anatomy and Physiology I and it provides a thorough introduction to the structure and function of the human body. PHYL 141L covers the gross anatomy, histology, and physiology of the integumentary, skeletal, muscular, and nervous systems. Students will be expected to learn details of anatomy and physiology through models, dissections, and physiological experimentations. Students will also apply those details in the broader context of whole body function and homeostasis. The covered topics include body orientation, chemical level, cellular level, tissue level, integumentary system, bone tissue, skeletal system, joints, muscular tissue, muscular system, nervous tissue, spinal cord and spinal nerves, brain and cranial nerves, autonomic nervous system, and special senses. Formerly ZOOL 141L.",
    "num_units": 1,
    "dept_name": "PHYL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYL 141.; Lab Hours: 3"
  },
  {
    "course_prefix": "PHYL",
    "course_number": 142,
    "course_title": "Human Anatomy and Physiology II",
    "course_desc": "PHYL 142 is the second semester of a comprehensive two-semester course which provides a thorough introduction to the structure and function of the human body. PHYL 142 covers the gross anatomy, histology, and physiology of the endocrine, cardiovascular, lymphatic, respiratory, digestive, urinary, reproduction systems as well as basic concepts of inheritance and development. Students will be expected to learn details of anatomy and physiology as well as applying those details in the broader context of whole body function and homeostasis.  Formerly ZOOL 142.",
    "num_units": 3,
    "dept_name": "PHYL",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in PHYL 141.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PHYL",
    "course_number": "142L",
    "course_title": "Human Anatomy and Physiology II Lab",
    "course_desc": "PHYL 142L is the laboratory course of PHYL 142 (Human Anatomy and Physiology II) and it provides a thorough introduction to the structure and function of the human body. PHYL 142L covers the gross anatomy, histology, and physiology of the endocrine, cardiovascular, lymphatic, respiratory, digestive, urinary, reproductive systems as well as basic concepts of inheritance and development. Students will be expected to learn details of anatomy and physiology through models, dissections, and physiological experimentations. Students will also apply those details in the broader context of whole body function and homeostasis.  Formerly ZOOL 142L.",
    "num_units": 1,
    "dept_name": "PHYL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in PHYL 142.; Lab Hours: 3"
  },
  {
    "course_prefix": "POLS",
    "course_number": 110,
    "course_title": "Introduction to Political Science",
    "course_desc": "Introduction to politics as a human activity. Discusses theories, ideologies, systems, and processes of politics.",
    "num_units": 3,
    "dept_name": "Political Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "POLS",
    "course_number": 120,
    "course_title": "Introduction to World Politics",
    "course_desc": "Power economics and world politics from cross-national perspectives. Discussion of U.S. foreign policy since 1945.",
    "num_units": 3,
    "dept_name": "Political Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "POLS",
    "course_number": 130,
    "course_title": "Introduction to American Government",
    "course_desc": "Focus on American politics and government on the basis of tradition and continuity. Covers: overview of constitutional development, institutions, processes, and participants of the American political system and alternative interpretations.",
    "num_units": 3,
    "dept_name": "Political Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "POLS",
    "course_number": 180,
    "course_title": "Introduction to Hawaiian Politics",
    "course_desc": "Introduction to the study of political institutions, processes, and issues in Hawai‘i.",
    "num_units": 3,
    "dept_name": "Political Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "POLS",
    "course_number": 243,
    "course_title": "Introduction to Politics and Film",
    "course_desc": "The course introduces students to the analysis of the relationship between politics and film. Topics covered in the course will include the impact of films and the film industry on politics, the impact of politics on film, and methods for understanding the representational practices of film.",
    "num_units": 3,
    "dept_name": "Political Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 100,
    "course_title": "Survey of Psychology",
    "course_desc": "An introductory course with emphasis on principles of human behavior. Topics covered include motivation, learning, perception, emotion, development, personality, states of consciousness, group processes, problem solving and thinking, and methods of inquiry.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 170,
    "course_title": "Psychology of Adjustment",
    "course_desc": "Focus is on understanding, evaluating and improving adjustment. Includes study of theories, concepts and techniques concerning personal growth and behavior change.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 202,
    "course_title": "Psychology of Gender",
    "course_desc": "Survey of topics in psychology relevant to gender and its impact on the lives of women and men: socialization of gender, mental health, racial identity, majority-minority status, sexual orientation, life-span issues, and violence. (Cross-listed as WGSS 202)",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of “C” or better in WGSS 151 or PSY 100 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 212,
    "course_title": "Survey of Research Methods",
    "course_desc": "Provides an overview of research design strategies used in psychological research. Topic covered include the scientific method; reviewing literature for hypothesis development; ethical issues in research; the operational definition of variables; observational, self-report and experimental methods; data analysis; inferential hypothesis testing; and the American Psychological Association writing style. The course furnishes students with the fundamentals of research that all psychology majors should be aware of, regardless of whether they plan to pursue a research career. Emphasis is placed on the critical evaluation of psychological research as it is reported in the popular media and research periodicals.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 224,
    "course_title": "Abnormal Psychology",
    "course_desc": "Concepts and principles used in clinical practice: dynamics, diagnosis, and treatment of abnormal behavior. Compares and contrasts the different patterns of abnormal behavior. Examines the differences in theoretical models for understanding maladaptive behavior.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 225,
    "course_title": "Statistical Techniques",
    "course_desc": "This course covers statistical methods related to behavioral sciences including frequency distributions, graphic methods, central tendency, variability, correlation, reliability, and tests of significance.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit in a 100-level (or above) Social Science course, placement into English 100, and placement into Math 103 or higher; or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 240,
    "course_title": "Developmental Psychology",
    "course_desc": "This course examines the emotional, mental, physical, and social development of individuals from infancy to adulthood with special attention to interests abilities and critical issues at successive developmental stages.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 241,
    "course_title": "Applied Developmental Psychology",
    "course_desc": "Examines the emotional, mental, physical, and social development of individuals from infancy to adulthood with special attention to the impact of racism at each developmental stage.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 250,
    "course_title": "Social Psychology",
    "course_desc": "This course will provide students with an understanding of the relationship of social roles on human behaviors and how interpersonal relationships, attribution theories, attitudes, group behaviors, and stereotypes affect human behaviors.",
    "num_units": 3,
    "dept_name": "Psychology",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in PSY 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 251,
    "course_title": "Human Sexuality",
    "course_desc": "Examines topic areas in the field of human sexuality including anatomy/physiology, sexual response, and sexual themes in society. Emphasizes understanding of one’s sexuality through decision-making and communication skills.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 253,
    "course_title": "ConQict Resolution & Mediation",
    "course_desc": "Explores the reasons for conflict and the different approaches for seeking resolution for conflict. Studies personal and societal value systems, the psychology of how people respond to conflict, the impact of culture on conflict styles, communication skills useful in dealing with conflict, and alternative resolution strategies. Practices mediation skills as a third party intervention method.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: Pre-Requisite: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 255,
    "course_title": "Applied Social Psychology",
    "course_desc": "This course explores how social psychological concepts are utilized in media, including literature, film, and television. The course emphasizes how social psychological theories are illustrated through fictional characters and situations along with investigating how accurately these characters and situations reflect real life research on said theories.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in PSY 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 260,
    "course_title": "Psychology of Personality",
    "course_desc": "An introduction to the basic theoretical approaches to personality, how they are developed, changed and analyzed.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 270,
    "course_title": "Introduction to Clinical Psychology",
    "course_desc": "History, theories, nature of psychological problems, methods of assessment, forms of intervention, current developments.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in PSY 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 271,
    "course_title": "Introduction to Trauma",
    "course_desc": "This course provides an overview of trauma, covering the types of traumas experienced, the nature of trauma such as sexual abuse, combat, and natural disasters, how trauma affects individuals, grief reactions, and traumatic stress. It explores the professional’s response to trauma, vicarious traumatization, the use of trauma-informed care as a crisis intervention, comorbid disorders and general treatment issues.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in PSY 100 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "PSY",
    "course_number": 294,
    "course_title": "Special Topics: Psychology",
    "course_desc": "This course offers students the opportunity to participate in the creation of academic learning experiences designed to meet individual needs, interests, aptitudes and desired outcomes. It is intended to serve the student, who, after completing the requirements of an introductory course, may wish to continue an in depth study of a particular topic or issue previously covered, or who may wish to reinforce understanding of concepts or relationships covered.",
    "num_units": 3,
    "dept_name": "PSY",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "REL",
    "course_number": 150,
    "course_title": "Introduction to World’s Major Religions",
    "course_desc": "Introduction to the world’s major religions: Primitive, Hinduism, Buddhism, Shinto, Confucianism, Taoism, Judaism, Christianity, and Islam. Fieldtrips maybe required outside class time.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 151,
    "course_title": "Religion and the Meaning of Existence",
    "course_desc": "Introduction to basic issues of the question of the meaning of human existence. Emphasis is placed upon the student analyzing his/her own beliefs and exploring alternative answers.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 201,
    "course_title": "Understanding the New Testament",
    "course_desc": "Analysis of the origin and development of the early Christian message as set forth in the New Testament. Special attention will be given to the message of Jesus and Paul and its relevance to the modern world.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 202,
    "course_title": "Understanding Indian Religions",
    "course_desc": "Historical survey of the teachings and practices of the major religious traditions of India.",
    "num_units": 3,
    "dept_name": "REL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Placement in ENG 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 205,
    "course_title": "Understanding Hawaiian Religion",
    "course_desc": "Major Hawaiian religious teachings and practices from ancient times to the present. Investigation of cultural influence of Hawaiian religious beliefs; analysis of religious texts and relation to other traditions. This course may be applied to the BA language/culture core requirements at UH Mānoa.",
    "num_units": 3,
    "dept_name": "REL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 206,
    "course_title": "Understanding Confucianism",
    "course_desc": "Exploration of Confucianism in its philosophical, cultural, and historical context in China.",
    "num_units": 3,
    "dept_name": "REL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 207,
    "course_title": "Understanding Buddhism",
    "course_desc": "Survey of major forms and practices of Buddhism.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 212,
    "course_title": "Science Fiction and Religion",
    "course_desc": "This course explores and reflects on the presence of religions and religious themes in science fiction films and television shows. Students will also discuss the ethics of robots and other forms of artificial intelligence (AI). This course explores the presence of religious themes such as the messianic hero, immortality, free will and determinism, prophecy, evil, mysticism, and apocalypse in films and tv shows including Star Trek, Star Wars, the Matrix, I Robot, Avatar, Superman, and more.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 217,
    "course_title": "Understanding Polynesian Religions",
    "course_desc": "This course provides an introduction to the study of Polynesian religions through an exploration of the oral traditions of Hawai‘i, Aotearoa (New Zealand), French Polynesia (Tahiti et al.), and Samoa among others. In this class, students will gain a foundational understanding of important religious themes that permeate Polynesia. Main themes include but are not limited to deities’ forms & functions, cosmogonies, etiologies, and belief-regulated practices. Additionally, a portion of the semester will focus on belief narratives as vehicles for the transmission of knowledge and the significance of contemporary representation and self-representation of Polynesian religion and culture. This class will use comparative analysis between Hawaiian religion and the religious traditions of Aotearoa, French Polynesia, and Samoa to identify the fundamental concepts needed to understand Polynesian religions and explore how they are interconnected and interwoven into the fabric of our lives today. (Cross-listed as HWST 217)",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "REL",
    "course_number": 296,
    "course_title": "Special Topics in Religion",
    "course_desc": "Students will investigate important topics in the study of religion such as Sacred Places, Religion and the Media, or Religion and Politics. A specific course description will be printed in the schedule of classes.",
    "num_units": 3,
    "dept_name": "Religion",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SCI",
    "course_number": 210,
    "course_title": "Polynesian Voyaging: Seamanship and Stewardship",
    "course_desc": "This course focuses on the fundamentals of oceanic voyaging by blending the traditions of Polynesian culture, history and skills with modern science and technology. An interdisciplinary approach is used in treating topics in astronomy, navigation, geology, oceanography, meteorology and archaeology. Students are introduced to the basic skills of seamanship and stewardship, including the techniques in navigational wayfinding and the impact of human activity on the island environments.",
    "num_units": 3,
    "dept_name": "Science",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SCI",
    "course_number": "210L",
    "course_title": "Polynesian Voyaging: Seamanship and Stewardship Lab",
    "course_desc": "Laboratory/field trip course designed to acquire seamanship skills and apply knowledge of astronomy, geology, oceanography, meteorology, marine biology, ethnobotany and archaeology through sailing and environmental exploring activities. Laboratory/field trip course is also designed to apply knowledge of Polynesian skills and modern science to the impact on the environment due to human settlement, especially in Hawai‘i.",
    "num_units": 1,
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: 1. Minimum water skills and survival requirements Student must demonstrate an: -Ability to swim a minimum of 500 yards in the open ocean using any strokes, except backstroke. -Ability to tread water for 30 minutes in the open ocean. (Note: Accredited water skill and survival tests passed within the past year are acceptable upon instructor approval. The swim test must be completed by the date of the first sailing lab.) 2. Health Clearance: from a licensed physician must be provided. (Note: Health clearance submitted within the past year is acceptable upon instructor approval. Health clearance must be submitted by the date of the first sailing lab.); Lab Hours: 3"
  },
  {
    "course_prefix": "SCI",
    "course_number": "295AL",
    "course_title": "Introduction to STEM Research in Algae",
    "course_desc": "STEM research class with a student engaged in independent research in topic areas related to Algae Studies. Credits vary from 1 – 4 based on the complexity of the research topic. May be repeated up to 6 credits. (3 hours cooperative education/work experience per week per credit.)",
    "num_units": "1-4",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor Consent."
  },
  {
    "course_prefix": "SCI",
    "course_number": "295AS",
    "course_title": "Introduction to STEM Research in Aerospace Science",
    "course_desc": "SCI 295AS Introduction to STEM Research in Aerospace Science (variable 1-3 credits) offers a research experience in aerospace science, which emphasizes the application of the scientific method to a specific aerospace project. Repeatable up to 6 credits.  (3 hours cooperative education/work (COOP) experience per week per credit)",
    "num_units": "1-3",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor consent"
  },
  {
    "course_prefix": "SCI",
    "course_number": "295EN",
    "course_title": "Introduction to STEM Research in Engineering",
    "course_desc": "offers a research experience in engineering, which emphasizes the application of the scientific method to a specific engineering project. Repeatable for up to 6 credits. (3 hours cooperative education/work (COOP) experience per week per credit)",
    "num_units": "1-3",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor consent."
  },
  {
    "course_prefix": "SCI",
    "course_number": "295EP",
    "course_title": "Introduction to STEM Research in Ethnobotanical Pharmacognosy",
    "course_desc": "offers a research experience in study of Hawaiian medicinal plants for the health benefits, bioactive constituents, development of value added foods, and possible production of nutraceuticals. A total of four credits are necessary to meet the capstone requirement for the Certificate in Ethnopharmacognosy. May be repeated up to 6 credits. (3 hours cooperative education/work (COOP) experience per week per credit.)",
    "num_units": "1-4",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor Consent."
  },
  {
    "course_prefix": "SCI",
    "course_number": "295PB",
    "course_title": "Introduction to STEM Research in Plant Biotechnology",
    "course_desc": "offers a research experience in application of the principles and techniques of plant biotechnology in agricultural production and plant conservation. A total of four credits are necessary to meet the capstone requirement for the Certificate in Plant Biotechnology. May be repeated up to 6 credits. (3 hours cooperative education/work experience per week per credit.)",
    "num_units": "1-4",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor Consent."
  },
  {
    "course_prefix": "SCI",
    "course_number": "295V",
    "course_title": "Introduction to STEM Research",
    "course_desc": "SCI 295V offers a research experience in science, technology, engineering, and/or mathematics, emphasizing the application of the scientific method to a specific project. Repeatable for up to 6 credits. (3 hours cooperative education/work experience per week per credit)",
    "num_units": "1-3",
    "dept_name": "SCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Instructor consent."
  },
  {
    "course_prefix": "SOCS",
    "course_number": 225,
    "course_title": "Statistical Analysis for Social Sciences",
    "course_desc": "This course covers statistical methods related to behavioral sciences including frequency distributions, graphic methods, central tendency, variability, correlation, reliability, and tests of significance.",
    "num_units": 3,
    "dept_name": "SOCS",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit in a 100-level (or above) Social Science course, placement into English 100, and placement into Math 103 or higher; or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "SSCI",
    "course_number": 193,
    "course_title": "Cooperative Arts and Science Education",
    "course_desc": "A work-study course providing opportunities to reinforce skills learned in the Social Science areas and to apply those skills in actual job situations. May be repeated up to 6 credits.",
    "num_units": "1-4",
    "dept_name": "SSCI",
    "inst_ipeds": 141990,
    "metadata": "Pre: Minimum of 12 credit hours of general curricula."
  },
  {
    "course_prefix": "SSCI",
    "course_number": 293,
    "course_title": "Cooperative Arts and Science Education",
    "course_desc": "A work-study course providing opportunities to upgrade and diversify knowledge and skills learned in the behavioral and social sciences, and to apply these in job situations. (Practicum)",
    "num_units": "1-4",
    "dept_name": "Social Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: SSCI 193V"
  },
  {
    "course_prefix": "SW",
    "course_number": 200,
    "course_title": "The Field of Social Work",
    "course_desc": "Orientation to the profession of social work; the nature and scope of social work, historical development, values and philosophy, methods of practice, scope, and aims.",
    "num_units": 3,
    "dept_name": "Social Work",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ENG 22 or ENG 23 or placement in ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "SOC",
    "course_number": 100,
    "course_title": "Survey of General Sociology",
    "course_desc": "This course is an introduction to the scientific discipline of sociology. It will focus on key concepts, main theoretical perspectives, and research findings used by sociologists to explain the social world and social interaction. The course examines the fundamental components and institutions that makeup the structure of human societies as well as the basic processes and direction of social change.",
    "num_units": 3,
    "dept_name": "Sociology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SOC",
    "course_number": 214,
    "course_title": "Introduction to Race and Ethnic Relations",
    "course_desc": "This course focuses on race and ethnic relations from local (Hawaii), national, and international perspectives; patterns of race/ethnic relations; and the social, economic, and political problems associated with racial/ethnic conflict.",
    "num_units": 3,
    "dept_name": "SOC",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SOC",
    "course_number": 218,
    "course_title": "Introduction to Social Problems",
    "course_desc": "This course is a theoretical and substantive survey of the nature and causes of social problems; selected topics may vary from semester to semester.",
    "num_units": 3,
    "dept_name": "SOC",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SOC",
    "course_number": 231,
    "course_title": "Introduction to Juvenile Delinquency",
    "course_desc": "This course focuses on juvenile delinquency in the U.S. and examines the nature of and trends in juvenile delinquency, explanations for and theories of juvenile delinquency, and institutional responses to and treatment of juvenile delinquency in the U.S. juvenile justice system.",
    "num_units": 3,
    "dept_name": "SOC",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SOC",
    "course_number": 251,
    "course_title": "Introduction to Sociology of the Family",
    "course_desc": "SOC 251 is the study of human relationships within courtship, marriage, and the family as influenced by culture and society. It is designed to challenge students to re-examine assumptions regarding behavior, decisions, choices, and motivations in interpersonal relationships. The course places particular emphasis on diverse family forms, and the changing nature of how we define family.",
    "num_units": 3,
    "dept_name": "SOC",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "SPAN",
    "course_number": 101,
    "course_title": "Beginning Spanish I",
    "course_desc": "Introduction to basic structures of the Spanish language emphasizing speaking, writing, listening and reading. Oral communication emphasized to provide students with the right pronunciation vocabulary and the control of basic grammar. Introduction to Hispanic culture.",
    "num_units": 4,
    "dept_name": "Spanish Language",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 4"
  },
  {
    "course_prefix": "SPAN",
    "course_number": 102,
    "course_title": "Beginning Spanish II",
    "course_desc": "Continues SPAN 101 through reading, speaking, writing and listening. Oral communication emphasized. Utilizes videos, stories and songs. Deals with Hispanic culture and the basic knowledge of the history, geography, and the traditions of Spanish speaking countries.",
    "num_units": 4,
    "dept_name": "Spanish Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for SPAN 101 or consent of instructor.; Lecture Hours: 4"
  },
  {
    "course_prefix": "SPAN",
    "course_number": 201,
    "course_title": "Intermediate Spanish I",
    "course_desc": "Continuation of SPAN 102. Further refinement of basic language skills. Increased control over structures and idioms in written and oral expression. Reading about Hispanic culture, society, history and literature.",
    "num_units": 3,
    "dept_name": "Spanish Language",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for SPAN 102 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "SPAN",
    "course_number": 202,
    "course_title": "Intermediate Spanish II",
    "course_desc": "Continuation of SPAN 201. Further refinement of basic language skills including vocabulary development beyond the 201 level. Increased control over structures and idioms. Includes reading about literature, culture and society.",
    "num_units": 3,
    "dept_name": "Spanish Language",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "SP",
    "course_number": 151,
    "course_title": "Personal and Public Speech",
    "course_desc": "This course introduces students to the basic principles of human communication. Students will receive practice in improving their competency in the areas of public speaking, specifically in informative and persuasive speaking.",
    "num_units": 3,
    "dept_name": "Speech",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "SP",
    "course_number": 181,
    "course_title": "Introduction to Interpersonal Communication",
    "course_desc": "Introduction to basic principles of interaction between two people. Emphasis is on enhancement of skills in a variety of interpersonal contexts.",
    "num_units": 3,
    "dept_name": "Speech",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "SP",
    "course_number": 251,
    "course_title": "Principles of ENective Public Speaking",
    "course_desc": "This course provides students with the opportunity to build on their public speaking skills through extensive practice in speech preparation and delivery techniques. This course will focus on how to organize a presentation, develop rhetorical skills, and use analytical skills.",
    "num_units": 3,
    "dept_name": "SP",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100 or credit for SP 151.; Lecture Hours: 3"
  },
  {
    "course_prefix": "SP",
    "course_number": 253,
    "course_title": "Argumentation and Debate",
    "course_desc": "SP 253 develops writing, reading, critical thinking, and communication skills. Students will learn to develop techniques to researching and presenting arguments in an effective and articulate manner.",
    "num_units": 3,
    "dept_name": "SP",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in ENG 100 or credit for SP 151.; Lecture Hours: 3"
  },
  {
    "course_prefix": "SP",
    "course_number": 261,
    "course_title": "Organizational Communication",
    "course_desc": "Introduces theories and strategies for managing communication in organizations. Students will gain an understanding of how communication functions by addressing the self, maintaining interpersonal relationships, problem solving and decision-making, and the use of technology in the workplace.",
    "num_units": 3,
    "dept_name": "SP",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 101,
    "course_title": "Introduction to Drama and Theatre",
    "course_desc": "An introduction to the art of drama and theatre. Students study selected plays that are representative of important playwrights and historical periods. These plays are studied in their historical context and provide a basis for understanding elements and styles of drama. Theatre production will also be explored by considering the functions of actors, audiences, designers, playwrights and technicians.",
    "num_units": 3,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 131,
    "course_title": "Beginning Unarmed Stage Combat",
    "course_desc": "Introduction to theatrical unarmed stage combat. Maybe repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 132,
    "course_title": "Beginning Sword Stage Combat",
    "course_desc": "Introduction to sword-fighting for the stage. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in THEA 131 or instructor consent.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 133,
    "course_title": "Stage Combat Workshop Level I",
    "course_desc": "Continuing exploration of theatrical stage combat in assorted weapons. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "THEA",
    "course_number": 177,
    "course_title": "Introduction to Theatre of Hawai’i",
    "course_desc": "An exploration of theatrical performances and plays showcasing the people, places and history of Hawai’i.",
    "num_units": 3,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": "200B",
    "course_title": "Beginning Theatre Practicum: (Acting)",
    "course_desc": "Beginning workshop experience in the practical application of theatre skills: (B) acting. THEA 200 is repeatable up to four credits in each alpha.",
    "num_units": 1,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": "Pre: for 200B, audition and performance of role in a THEA 260 production or similar performance deemed appropriate by instructor."
  },
  {
    "course_prefix": "THEA",
    "course_number": "200C",
    "course_title": "Beginning Theatre Practicum: (Stagecraft)",
    "course_desc": "Beginning workshop experience in the practical application of theatre skills: (C) Stagecraft. THEA 200 is repeatable up to four credits in each alpha.",
    "num_units": 1,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "THEA",
    "course_number": "200D",
    "course_title": "Beginning Theatre Practicum: (Costume)",
    "course_desc": "Beginning workshop experience in the practical application of theatre skills: (D) Costume. THEA 200 is repeatable up to 4 credits in each alpha.",
    "num_units": 1,
    "dept_name": "Theatre",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "THEA",
    "course_number": 211,
    "course_title": "Mask Making and Performance",
    "course_desc": "A hands-on course exploring several mask-making techniques, and the fundamentals of bringing a mask to life. The history and cultural significance of the mask will be surveyed. Students will make several masks and will perform for each other.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 220,
    "course_title": "Beginning Voice and Movement",
    "course_desc": "Introduction to vocal and movement techniques to increase self- awareness and potential for self-expression. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 221,
    "course_title": "Acting I",
    "course_desc": "Performance course concentrating on voice, relaxation, body awareness, and freedom from self-consciousness through theatre games, improvisation, and exercises. Emphasis on ensemble work. Students must see two plays and write about them or use the Service- Learning option. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 222,
    "course_title": "Acting II",
    "course_desc": "Performance course concentrating on exploration of character creation; continued work on voice, relaxation, and self-realization. Students must see two plays and write about them or use the Service- Learning option. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of “C” or better in THEA 221.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 223,
    "course_title": "Introduction to Acting for Camera",
    "course_desc": "An introduction to acting techniques for film, TV production, and other camera-based media. Repeatable up to 6 credits. (Cross-listed as CM 223)",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in THEA 221.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 225,
    "course_title": "Shakespeare Workshop",
    "course_desc": "A study of William Shakespeare's life, works, contemporary performance practices, and the Royal Shakespeare Company's current training and methods of bringing the Bard's work to life for modern audiences. The curriculum of this course is tailored to the Royal Shakespeare Company's Summer Season, and this course serves as mandatory preparation for the Windward CC Footholds Shakespeare Study Abroad program to London and Stratford-upon-Avon. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in THEA 260 and THEA 200B, or Instructor Permission."
  },
  {
    "course_prefix": "THEA",
    "course_number": 226,
    "course_title": "Footholds UK Shakespeare Study Abroad",
    "course_desc": "This course is a two-week intensive study abroad program to England. The first week is spent working with top-tier industry professionals at East 15 Acting School in London, and viewing productions at noted theatres there, as well as meeting professional actors for Q&A sessions. The second week is spent in Stratford-upon-Avon training closely with the Royal Shakespeare Company, attending lectures and seminars at the Shakespeare Birthplace Trust, and viewing two productions at the Royal Shakespeare Theatre. The course culminates in a performance of scenes and monologues in Shakespeare's own gardens for visiting tourists.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of B or better in THEA 225."
  },
  {
    "course_prefix": "THEA",
    "course_number": 231,
    "course_title": "Intermediate Unarmed and Staff Stage Combat",
    "course_desc": "Intermediate training in the Unarmed and Quarterstaff disciplines of Stage Combat. Repeatable for up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in THEA 131 or instructor approval.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 232,
    "course_title": "Intermediate Rapier and Dagger Stage Combat",
    "course_desc": "Intermediate training in Rapier and Rapier and Dagger weapon disciplines in Stage Combat. Repeatable for up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Grade of C or better in THEA 132 or instructor approval.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 233,
    "course_title": "Stage Combat Workshop Level II",
    "course_desc": "Level II Training in assorted weapon disciplines. Repeatable for up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for THEA 131 AND 132, OR Credit for THEA 133 OR Instructor approval"
  },
  {
    "course_prefix": "THEA",
    "course_number": 240,
    "course_title": "Introduction to Stagecraft",
    "course_desc": "Introduction to the technical process of theatre including scenery, lighting, sound and stage management. Students will focus on the range of skills needed to work in theatrical space. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 241,
    "course_title": "Advanced Stagecraft",
    "course_desc": "Advanced techniques of the technical process of theatre including lighting, sound, and rigging. Students will focus on the range of skills needed to work in convention, theatrical, concert, and dance applications. May be repeated up to 6 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for THEA 240 or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 251,
    "course_title": "Applied Theatre",
    "course_desc": "This course provides individual instruction in theatre, covering intermediate and advanced performance techniques taught to each student's individual level. Applied theatre is a performance course. The emphasis will be toward developing performing skills from a wide range of methods focusing on bringing characters to vivid life, textual analysis, cold reading, voice and movement training, and playing truthful and effective moments on stage or screen for a contemporary audience. The goal is to facilitate student actors in attaining a level of confidence and skill that allows for consistently powerful and playful performances. This course may be repeated for up to 4 credits. (1 hour Individual Instruction)",
    "num_units": 1,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in THEA 221."
  },
  {
    "course_prefix": "THEA",
    "course_number": 252,
    "course_title": "Professional Preparation",
    "course_desc": "This course provides individual instruction in theatre, covering necessary professional skills and resources to facilitate student performers' transition into the professional performing arts industry. Students will learn audition best practices, procure headshots, build a resume, and cultivate a repertoire of audition pieces. This course may be repeated for up to 4 credits. (1 hour Individual Instruction)",
    "num_units": 1,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in THEA 221."
  },
  {
    "course_prefix": "THEA",
    "course_number": 260,
    "course_title": "Dramatic Production",
    "course_desc": "Introduction to the process of converting a play into a performance. Students are required to participate in at least two aspects of an actual production. May be repeated up to 9 credits.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": ""
  },
  {
    "course_prefix": "THEA",
    "course_number": 280,
    "course_title": "Beginning Playwriting",
    "course_desc": "The course introduces structure, guidelines, and format of the monologue and short play; beginning with the conception of an idea, followed by effective outlining and research techniques, subsequent drafts, and the final product in a polished monologue and short play.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for ENG 100.; Lecture Hours: 3"
  },
  {
    "course_prefix": "THEA",
    "course_number": 296,
    "course_title": "Special Topics in Theatre",
    "course_desc": "Students will investigate important topics in Theatre Studies such as specific artists/practitioners, genres, or methods of training. May be repeated up to 6 credits with different topics.",
    "num_units": 3,
    "dept_name": "THEA",
    "inst_ipeds": 141990,
    "metadata": "Pre: C or better in THEA 101 or C or better in THEA 221.; Lecture Hours: 3"
  },
  {
    "course_prefix": "WGSS",
    "course_number": 151,
    "course_title": "Introduction to Women, Gender, and Sexuality Studies",
    "course_desc": "This course is an introduction to feminist interdisciplinary analysis from global and critical perspectives. It explores relationships between women and men from various cultures, with a focus on gender, race, class, and sexual dynamics. The course also explores women’s negotiations with institutional dynamics.",
    "num_units": 3,
    "dept_name": "Women, Gender & Sexuality Studies",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "WGSS",
    "course_number": 200,
    "course_title": "Culture, Gender, and Appearance",
    "course_desc": "This course explores the social construction of gender within culture and its visual expression through appearance. An analysis of role, identity, conformity, and deviance in human appearance is emphasized.",
    "num_units": 3,
    "dept_name": "WGSS",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "WGSS",
    "course_number": 202,
    "course_title": "Psychology of Gender",
    "course_desc": "Survey of topics in psychology relevant to gender and its impact on the lives of women and men: socialization of gender, mental health, racial identity, majority-minority status, sexual orientation, life-span issues, and violence. (Cross-listed as PSY 202)",
    "num_units": 3,
    "dept_name": "WGSS",
    "inst_ipeds": 141990,
    "metadata": "Pre: A grade of C or better in WGSS 151 or PSY 100, or consent of instructor.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 105,
    "course_title": "Hawaiian Use of Fish and Aquatic Invertebrates",
    "course_desc": "A study of fish and aquatic invertebrates used traditionally by Native Hawaiians. This class will examine the role of fish and aquatic invertebrates in Hawaiian culture and resource utilization and management.",
    "num_units": 3,
    "dept_name": "Zoology",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 106,
    "course_title": "Hawaiian Marine Invertebrates",
    "course_desc": "Survey of marine invertebrates, their structure, ecology, and evolutionary relationships. Emphasis will be placed on identification and uses of Hawaiian tidal and coral reef animals. Three field trips required.",
    "num_units": 3,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 107,
    "course_title": "IdentiPcation of Hawaiian Fishes",
    "course_desc": "Identification of major groups and common species of fishes in Hawai‘i with emphasis on shore fishes. Topics include morphology, adaptation, physiology, phylogenetic relationships, feeding relationships, behavior, ecology, fishing methods and Hawaiian use of fishes. Lecture/laboratory/field trip course (two required field tips on Saturdays).",
    "num_units": 3,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 2; Lab Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 154,
    "course_title": "Exercise for Wellness",
    "course_desc": "The course will introduce students to the field of exercise, including a discussion of the underlying physiology, clinical responses, and the recommended medically related remediation. Exercise will be analyzed as an open energy system, supported by the major body systems, including cardiovascular, pulmonary, skeletal and neuromuscular systems. Important factors that will be considered include the frequency, intensity, type, and duration/time of exercise as well as the impact of gender, age, purpose, lifestyle and your body composition and metabolic status.",
    "num_units": 3,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: BIOL 100 or ZOOL 101 or ZOOL 141 and ZOOL 142.; Lecture Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 200,
    "course_title": "Marine Biology",
    "course_desc": "Biological, physical, and chemical characteristics, flora and fauna, and interactions of components of marine ecosystems; survey of marine environments; utilization, exploitation, pollution, and conservation of marine resources; with special emphasis on the Hawaiian marine environment.",
    "num_units": 3,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Registration in ZOOL 200L; Lecture Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": "200L",
    "course_title": "Marine Biology Lab",
    "course_desc": "Companion laboratory to ZOOL 200, Marine Biology. Practical, hands-on experiences in marine biology. Laboratory/fieldtrip class.",
    "num_units": 1,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Pre: Credit for or registration in ZOOL 200 or consent of instructor.; Lab Hours: 3"
  },
  {
    "course_prefix": "ZOOL",
    "course_number": 254,
    "course_title": "Exercise Therapy",
    "course_desc": "This course introduces selected concepts, principles and practices of physical activity that affect human wellness and fitness throughout all stages of life. In particular, the concepts of exercise specificity, adaptation, and remediation are presented as they affect human growth and development, and the aging process. The clinical concept of hypokinetic disease (under activity) is presented and its counterpart, clinical exercise therapy (Rx dosage) for purposes of preventative health application and remediation. Comparative study of both Western and Eastern exercise regimens are included in the context of their clinical contribution to wellness.",
    "num_units": 3,
    "dept_name": "ZOOL",
    "inst_ipeds": 141990,
    "metadata": "Lecture Hours: 3"
  }
]